{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "FUEL SYSTEM",
    "SEATS",
    "POWER TRAIN",
    "TIRES"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Faulty Fuel Regulator Hose Failure",
      "impact": "The failure of the fuel regulator hose can cause a vehicle fire, which can lead to serious injury or death, as well as significant property damage.",
      "symptoms": [
        "Vehicle catches fire",
        "engine fire",
        "fire starts between the back of the engine and firewall",
        "vehicle fire after recall repair",
        "fuel regulator hose failure."
      ],
      "odiNumbers": [
        "603425",
        "516915",
        "961348"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Power Seat Track Failure (Driver Side)",
      "impact": "The failure of the power seat track can cause the seat to become stuck in a position, making it difficult or impossible for the driver to adjust their seat, which can lead to discomfort, distraction, and increased risk of accidents.",
      "symptoms": [
        "The power seat is stuck in a position",
        "the power seat will not move",
        "the power seat makes a grinding or clicking noise",
        "the power seat is loose or wobbly."
      ],
      "odiNumbers": [
        "535868"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Axle Steel Tube Failure",
      "impact": "The failure of the rear axle steel tube can cause a rattling or clunking noise, which can be a sign of a more serious problem, potentially leading to loss of vehicle control, accidents, or strandings.",
      "symptoms": [
        "Rattling or clunking noise from the rear of the vehicle",
        "especially when hitting small bumps or potholes",
        "vibration while driving."
      ],
      "odiNumbers": [
        "518471"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Incorrect Wheel and Tire Installation",
      "impact": "The installation of the wrong wheel and tire in the luggage saver at the factory can lead to a loss of vehicle control, increased stopping distance, and a higher risk of tire failure, which can cause accidents and injuries.",
      "symptoms": [
        "The spare tire and wheel do not match the vehicle's specifications",
        "the spare tire and wheel have a different number of lug holes",
        "the spare tire and wheel are not compatible with the vehicle's wheel hub."
      ],
      "odiNumbers": [
        "482835"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Insufficient Quality Control at Factory",
      "impact": "The lack of proper quality control at the factory can lead to a range of safety issues, including incorrect installations, faulty components, and inadequate testing, which can cause accidents, injuries, and fatalities.",
      "symptoms": [
        "Various symptoms depending on the specific issue",
        "including incorrect installations",
        "faulty components",
        "and inadequate testing."
      ],
      "odiNumbers": [
        "482835"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}