{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SEAT BELTS",
    "STEERING",
    "STRUCTURE",
    "FUEL SYSTEM",
    "POWER TRAIN"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Inoperative Seat Belt Buckle",
      "impact": "A faulty seat belt buckle can lead to inadequate restraint during a crash, increasing the risk of injury or fatality.",
      "symptoms": [
        "The seat belt buckle fails to latch",
        "the seat belt buckle will not stay locked",
        "the seat belt is difficult to fasten",
        "the seat belt is loose or does not provide adequate restraint."
      ],
      "odiNumbers": [
        "960485",
        "532438"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Loose Rack and Pinion Mounting Bolts",
      "impact": "Loose mounting bolts can cause the rack and pinion steering system to malfunction, leading to a loss of steering control, increased risk of accidents, and potential damage to other components.",
      "symptoms": [
        "Play or looseness in the steering",
        "uneven steering",
        "wandering or drifting while driving",
        "clunking or rattling noises from the steering system."
      ],
      "odiNumbers": [
        "958523"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Frame Damage and Alignment Issues",
      "impact": "The cracks on the inner side of the channel on the passenger's side, where the frame goes over the wheel, can cause the vehicle to pull to the right during acceleration and severe turning while making turns, leading to loss of control and increased risk of accidents.",
      "symptoms": [
        "The vehicle pulls to the right during acceleration",
        "severe turning while making turns",
        "uneven tire wear",
        "vibration while driving",
        "and difficulty steering."
      ],
      "odiNumbers": [
        "859784"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Intermittent Engine Stalling and Sputtering",
      "impact": "The intermittent engine stalling and sputtering can cause the vehicle to lose power and stall, potentially leading to accidents or leaving the driver stranded.",
      "symptoms": [
        "The engine starts to spit and choke",
        "the vehicle acts as if it's out of gas",
        "the engine stalls",
        "the vehicle loses power."
      ],
      "odiNumbers": [
        "856935"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Transmission Fluid Leaks",
      "impact": "Transmission fluid leaks can cause the transmission to overheat, leading to premature wear and failure, which can result in costly repairs, loss of vehicle function, and potential safety hazards.",
      "symptoms": [
        "Transmission fluid leaking from the transmission pan",
        "transmission lines",
        "or seals; low transmission fluid levels; transmission overheating; unusual noises or vibrations from the transmission; difficulty shifting gears or slipping between gears."
      ],
      "odiNumbers": [
        "543938",
        "10894359",
        "10790783",
        "10763771",
        "10650766",
        "10588926",
        "10585118",
        "10567062",
        "10561132"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Transmission Slipping or Hesitation",
      "impact": "Transmission slipping or hesitation can cause loss of power, difficulty accelerating, and decreased vehicle control, which can increase the risk of accidents.",
      "symptoms": [
        "Transmission hesitates or slips when shifting gears; difficulty accelerating or maintaining speed; unusual noises or vibrations from the transmission; feeling of the transmission \"slipping\" or \"hunting\" between gears."
      ],
      "odiNumbers": [
        "10876259",
        "10734988",
        "10621832",
        "10585118",
        "10567062",
        "10561132"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Transmission Failure to Engage",
      "impact": "Transmission failure to engage can cause the vehicle to stall or lose power, increasing the risk of accidents or leaving the driver stranded.",
      "symptoms": [
        "Transmission fails to engage into gear; vehicle stalls or loses power; difficulty shifting into gear; unusual noises or vibrations from the transmission."
      ],
      "odiNumbers": [
        "10966445",
        "10763771",
        "10734988",
        "10650766",
        "10588926",
        "10585118",
        "10567062",
        "10561132"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}