{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "STRUCTURE",
    "EXTERIOR LIGHTING",
    "SEATS",
    "SEAT BELTS",
    "EQUIPMENT"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Broken Glove Compartment Hinge",
      "impact": "A broken glove compartment hinge can cause the compartment door to fall or hang loose, which can be a distraction to the driver and potentially lead to accidents.",
      "symptoms": [
        "The glove compartment door falls or hangs loose",
        "the glove compartment door does not stay shut",
        "the glove compartment door is difficult to open or close."
      ],
      "odiNumbers": [
        "482321"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Faulty Door Seals",
      "impact": "Faulty door seals can cause water to enter the vehicle, leading to damage to electrical components, rust, and mold growth, which can compromise the vehicle's safety and performance.",
      "symptoms": [
        "Water enters the vehicle through the doors",
        "doors are difficult to open or close",
        "doors make a loud noise when opening or closing",
        "doors do not seal properly."
      ],
      "odiNumbers": [
        "482321"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Electrical System Malfunction - Interior Lighting",
      "impact": "A short in the lighting system can cause unexpected and uncontrolled activation of interior lights, which can be a distraction to the driver, leading to decreased safety on the road.",
      "symptoms": [
        "Interior lights come on unexpectedly",
        "interior lights remain on even when the vehicle is turned off",
        "battery drain or dead battery due to continuous lighting."
      ],
      "odiNumbers": [
        "482321"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Headlight Misalignment",
      "impact": "Improperly adjusted headlights can reduce visibility and compromise safety, especially at night or in low-light conditions.",
      "symptoms": [
        "Headlights are not aligned properly",
        "uneven or scattered light beam",
        "reduced visibility while driving at night."
      ],
      "odiNumbers": [
        "482321"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Driver's Side Seat Failure in Rear-End Collisions",
      "impact": "The failure of the driver's side seat can lead to increased risk of injury or fatality in the event of a rear-end collision, as the seat may not provide adequate support or protection to the driver.",
      "symptoms": [
        "The driver's side seat breaks or collapses during a rear-end collision",
        "the seatback fails to remain upright",
        "the seatbelt system fails to restrain the driver properly",
        "the driver experiences increased injury or discomfort during the collision."
      ],
      "odiNumbers": [
        "984132"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Frayed Seat Belt Material",
      "impact": "Frayed seat belt material can lead to a weakened seat belt, which can fail to restrain the occupant in the event of a crash, increasing the risk of injury or fatality.",
      "symptoms": [
        "Visible signs of wear or fraying on the seat belt material",
        "reduced seat belt functionality",
        "or a complete failure of the seat belt to restrain the occupant."
      ],
      "odiNumbers": [
        "482321"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Air Conditioning Condenser Failure",
      "impact": "The failure of the air conditioning condenser can cause the air conditioning system to malfunction, resulting in reduced cooling performance, increased engine load, and potentially leading to overheating issues.",
      "symptoms": [
        "The air conditioning blows warm air",
        "the air conditioning is not cooling properly",
        "the vehicle's engine temperature gauge is in the red zone",
        "the vehicle is overheating",
        "the air conditioning is making a loud noise."
      ],
      "odiNumbers": [
        "482321"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}