{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SEAT BELTS",
    "SERVICE BRAKES",
    "STEERING",
    "VISIBILITY",
    "VEHICLE SPEED CONTROL"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Inadequate Seat Belt Accommodation",
      "impact": "The rear seat belt may not fit properly, compromising the safety of passengers with larger waist sizes, which can increase the risk of injury or fatality in the event of an accident.",
      "symptoms": [
        "The rear seat belt is too small to accommodate a normal-sized person with a 34-inch waist",
        "making it difficult or impossible to wear the seat belt correctly."
      ],
      "odiNumbers": [
        "10018016"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Faulty Seat Belt Retracting Mechanism",
      "impact": "A malfunctioning seat belt retracting mechanism can cause the strap to not retract completely, which can lead to incorrect seat belt usage and increase the risk of injury or fatality in the event of an accident.",
      "symptoms": [
        "The driver's seat belt strap does not retract completely when released",
        "making it difficult to use the seat belt correctly."
      ],
      "odiNumbers": [
        "486764"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Cracked Seat Belt Buckle",
      "impact": "A cracked seat belt buckle can cause difficulty inserting the buckle, which can lead to incorrect seat belt usage and increase the risk of injury or fatality in the event of an accident.",
      "symptoms": [
        "The driver's seat belt buckle is cracked",
        "causing difficulty inserting the buckle without jamming",
        "and the buckle may not always go all the way in."
      ],
      "odiNumbers": [
        "486764"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Faulty Seat Belt Latch",
      "impact": "A malfunctioning seat belt latch can cause the driver to be unrestrained, increasing the risk of injury or fatality in the event of an accident.",
      "symptoms": [
        "The driver's seat belt latch will not remain engaged into the receiver",
        "leaving the driver unrestrained."
      ],
      "odiNumbers": [
        "960978"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Unintended Acceleration",
      "impact": "Unintended acceleration can cause loss of vehicle control, leading to accidents, injuries, and even fatalities.",
      "symptoms": [
        "The vehicle suddenly accelerates without input from the driver",
        "the vehicle bucks or jerks while driving",
        "the brakes are ineffective in stopping the vehicle",
        "the vehicle is difficult to control."
      ],
      "odiNumbers": [
        "8012311"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Windshield Wiper Arm Structure Failure",
      "impact": "The failure of the windshield wiper arm structure can cause the wipers to malfunction or stop working, reducing visibility during rainy or snowy conditions, which can increase the risk of accidents.",
      "symptoms": [
        "The windshield wiper arms break or bend",
        "the wiper blades do not move or move erratically",
        "the wiper motor is loud or produces a grinding noise",
        "the windshield wiper switch is unresponsive",
        "the windshield wipers do not turn on or shut off intermittently."
      ],
      "odiNumbers": [
        "805541"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unintended Vehicle Movement and Brake Failure",
      "impact": "The sudden and unintended movement of the vehicle can cause accidents, injuries, or fatalities, especially if the brakes fail to function properly. This can lead to a loss of control, collisions, or other hazardous situations.",
      "symptoms": [
        "The vehicle moves unexpectedly",
        "either forward or backward",
        "without driver input; the brakes do not respond or fail to stop the vehicle; the ignition system fails to turn off",
        "causing the vehicle to continue running."
      ],
      "odiNumbers": [
        "964747"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Ignition System Failure",
      "impact": "A malfunctioning ignition system can cause the vehicle to stall or continue running uncontrollably, leading to accidents, injuries, or fatalities. This can also lead to a loss of control, collisions, or other hazardous situations.",
      "symptoms": [
        "The ignition system fails to turn off",
        "causing the vehicle to continue running; the vehicle stalls or dies unexpectedly; the ignition system fails to respond to driver input."
      ],
      "odiNumbers": [
        "964747"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}