{
  "totalComplaints": 12,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "SEATS",
    "SEAT BELTS"
  ],
  "parsedComplaintsResultLength": 4,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Anti-Lock Braking System (ABS) Failure",
      "impact": "The failure of the ABS can cause the brakes to lock up, leading to loss of control, accidents, and potential injuries or fatalities.",
      "symptoms": [
        "The brakes hesitate or fail to engage",
        "the vehicle floats or slides before the brakes engage",
        "the brakes lock up",
        "the vehicle is difficult to control",
        "especially in rainy or slippery conditions."
      ],
      "odiNumbers": [
        "976506",
        "974256"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Power Seat Switch Electrical Fire",
      "impact": "The power seat switch catching fire can cause damage to the vehicle's electrical system, potentially leading to a larger electrical fire, and pose a risk to the occupants' safety.",
      "symptoms": [
        "Smoke or flames coming from the power seat switch",
        "burning smell",
        "melting or charring of the seat or surrounding components."
      ],
      "odiNumbers": [
        "973654"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Inadequate Front Seat Head Restraint",
      "impact": "The front seat head restraint not being high enough can increase the risk of neck or head injury in the event of a crash or sudden stop.",
      "symptoms": [
        "The head restraint does not provide adequate support or protection for the head or neck",
        "the head restraint is too low or does not adjust to a suitable height."
      ],
      "odiNumbers": [
        "962037"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Defective Seat Belt Design",
      "impact": "The defective seat belt design can lead to ejection from the vehicle in the event of an accident, resulting in serious injury or fatality.",
      "symptoms": [
        "The shoulder and lap belts are fastened to the same tongue",
        "allowing one person to get in or out of the vehicle when the door is open",
        "and potentially leading to ejection from the vehicle in an accident."
      ],
      "odiNumbers": [
        "970828",
        "962037"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}