{
  "totalComplaints": 14,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "ENGINE AND ENGINE COOLING",
    "STEERING",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Differential Pinion Bearing Failure",
      "impact": "The failure of the differential pinion bearing can cause the vehicle to lose power, making it difficult to control, and potentially leading to accidents or leaving the driver stranded.",
      "symptoms": [
        "The vehicle makes a loud grinding or whining noise",
        "the vehicle vibrates or shakes",
        "the vehicle loses power or acceleration",
        "the vehicle is difficult to control."
      ],
      "odiNumbers": [
        "528134"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Clutch Assembly Failure",
      "impact": "The failure of the clutch assembly can cause the clutch pedal to stick to the floor, making it difficult or impossible to shift gears, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The clutch pedal feels soft or spongy",
        "the clutch pedal sticks to the floor",
        "the clutch pedal does not return to its normal position",
        "the clutch pedal has a delayed return to its normal position",
        "the clutch pedal has a sudden loss of pressure",
        "the vehicle is unable to shift into gear."
      ],
      "odiNumbers": [
        "528134"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Transmission Slipping or Popping Out of Gear",
      "impact": "The transmission slipping or popping out of gear can cause the vehicle to lose power, making it difficult to control, and potentially leading to accidents or leaving the driver stranded.",
      "symptoms": [
        "The vehicle pops out of gear while driving",
        "the transmission slips or hesitates",
        "the vehicle loses power or acceleration",
        "the vehicle is difficult to control."
      ],
      "odiNumbers": [
        "971142"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Head Gasket Failure",
      "impact": "The failure of the head gasket can cause engine coolant and oil to leak, leading to overheating, engine damage, and potentially causing the engine to seize, resulting in a loss of vehicle control and increasing the risk of accidents.",
      "symptoms": [
        "Engine overheating",
        "coolant leak",
        "oil leak",
        "white smoke from the exhaust",
        "engine misfire",
        "engine stalling",
        "loss of engine power."
      ],
      "odiNumbers": [
        "485699",
        "963454",
        "528134"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Faulty Steering Relay Rod",
      "impact": "The failure of the steering relay rod can cause loss of steering control, leading to accidents, injuries, or fatalities.",
      "symptoms": [
        "No symptoms mentioned in the provided complaints",
        "but the recall notice indicates that the faulty relay rod can cause loss of steering control."
      ],
      "odiNumbers": [
        "10151938",
        "10149010"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Brake Failure",
      "impact": "The failure of the brakes can lead to a loss of control, accidents, and potentially serious injuries or fatalities.",
      "symptoms": [
        "The brakes do not respond or respond slowly",
        "the brake pedal feels soft or spongy",
        "the brake pedal travels to the floor",
        "the vehicle does not stop or slows down slowly",
        "unusual noises or vibrations when applying the brakes."
      ],
      "odiNumbers": [
        "528134",
        "504630"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}