{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "FUEL SYSTEM",
    "FUEL/PROPULSION SYSTEM",
    "EQUIPMENT"
  ],
  "parsedComplaintsResultLength": 3,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel Tank Seam Failure",
      "impact": "The failure of the fuel tank seam can cause gasoline to leak, resulting in a fire hazard, explosion risk, and exposure to harmful fumes, which can lead to health problems, accidents, and injuries.",
      "symptoms": [
        "Strong gas smell",
        "gas smell coming from the rear driver's side",
        "gas leaking from the seam of the tank",
        "fuel tank leaking",
        "fuel smell in the engine compartment."
      ],
      "odiNumbers": [
        "10237911",
        "10021326",
        "862132",
        "710713",
        "986067"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Fuel Tank Seam Failure",
      "impact": "The failure of the fuel tank seam can cause fuel leaks, which can lead to fires, explosions, or other accidents, posing a significant risk to vehicle occupants and other road users.",
      "symptoms": [
        "Fuel leaking from the seam of the fuel tank",
        "persistent fuel leaks",
        "fuel smell or odor inside or outside the vehicle."
      ],
      "odiNumbers": [
        "10872359",
        "10823106"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Air Conditioning Failure - Hot Air from Side Vents",
      "impact": "The failure of the air conditioning system can cause discomfort, distraction, and decreased visibility due to fogging of the windshield, which can lead to accidents.",
      "symptoms": [
        "Hot air blows out of the side vents instead of cool air",
        "the air conditioning system does not cool the air",
        "the air conditioning system blows warm air",
        "the air conditioning system is not functioning properly",
        "the air conditioning system is not blowing cold air."
      ],
      "odiNumbers": [
        "476876"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}