{
  "totalComplaints": 14,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "AIR BAGS",
    "FUEL SYSTEM",
    "TIRES"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Loss of Acceleration with Air Conditioner On",
      "impact": "The loss of acceleration when the air conditioner is on can cause unexpected slowing or stalling, increasing the risk of accidents or collisions.",
      "symptoms": [
        "The vehicle experiences a sudden loss of power or acceleration when the air conditioner is turned on",
        "the vehicle stalls or hesitates when accelerating",
        "the engine RPM drops or fluctuates when the air conditioner is on."
      ],
      "odiNumbers": [
        "10098293"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Brake Failure with ABS Activation",
      "impact": "The failure of the brakes when the ABS system is activated can cause accidents, injuries, or fatalities due to the loss of vehicle control.",
      "symptoms": [
        "The brake pedal goes to the floor",
        "the brakes fail to stop the vehicle",
        "the vehicle experiences extended stopping distances",
        "the ABS system malfunctions or activates unnecessarily."
      ],
      "odiNumbers": [
        "810154",
        "807515"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Premature Brake Wear and Failure",
      "impact": "The premature wear and failure of brakes can cause accidents, injuries, or fatalities due to the loss of vehicle control.",
      "symptoms": [
        "The brakes wear out quickly",
        "the brake pads or rotors need to be replaced frequently",
        "the brakes grind or make noise when applied",
        "the vehicle vibrates or pulls to one side when braking."
      ],
      "odiNumbers": [
        "10098293"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Airbag Module Failure",
      "impact": "The failure of the airbag module can prevent the airbags from deploying in the event of a crash, increasing the risk of injury or fatality to occupants.",
      "symptoms": [
        "The airbag warning light illuminates on the dashboard",
        "the airbag warning light blinks or flashes",
        "the airbag system malfunction indicator is displayed."
      ],
      "odiNumbers": [
        "538674",
        "605275",
        "604949"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Gas Tank Seam Failure",
      "impact": "The failure of the gas tank seam can cause gasoline to leak, resulting in a strong smell of gas, potential fire hazards, and environmental damage.",
      "symptoms": [
        "Strong smell of gasoline inside the vehicle",
        "gasoline dripping or leaking from the gas tank",
        "spotting on the driveway or garage floor."
      ],
      "odiNumbers": [
        "10386511",
        "10137347"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Tire Tread Separation",
      "impact": "Tire tread separation can cause loss of vehicle control, leading to accidents, damage to the vehicle, and potentially resulting in injuries or fatalities.",
      "symptoms": [
        "Wobbling or vibrating of the vehicle",
        "sudden loss of tire pressure",
        "uneven tire wear",
        "tire blowout",
        "and damage to the vehicle's body or wheels."
      ],
      "odiNumbers": [
        "895661",
        "746702"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}