{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "ENGINE AND ENGINE COOLING",
    "VEHICLE SPEED CONTROL",
    "STEERING",
    "TIRES",
    "SUSPENSION"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Throttle Lever Failure",
      "impact": "The failure of the throttle lever can cause the vehicle to lose power, making it difficult to accelerate, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The vehicle loses power when accelerating",
        "the accelerator pedal feels unresponsive",
        "the engine RPMs drop unexpectedly",
        "the vehicle hesitates or stumbles when accelerating."
      ],
      "odiNumbers": [
        "10055982"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Contaminated Brake Linings and Front Drive Axle Failure",
      "impact": "Contaminated brake linings and front drive axle failure can lead to brake fluid leakage, causing a loss of brake pressure, which can result in extended stopping distances, accidents, and potentially serious injuries or fatalities.",
      "symptoms": [
        "Spongy brake pedal",
        "brake fluid leakage",
        "uneven brake wear",
        "grinding or screeching noise when applying brakes",
        "vehicle pulling to one side when braking."
      ],
      "odiNumbers": [
        "10076034"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Steering Axle Air Leak and Brake Chamber Failure",
      "impact": "An air leak in the steering axle hose to brake chamber can cause a loss of brake pressure, leading to extended stopping distances, accidents, and potentially serious injuries or fatalities.",
      "symptoms": [
        "Spongy brake pedal",
        "brake fluid leakage",
        "uneven brake wear",
        "grinding or screeching noise when applying brakes",
        "vehicle pulling to one side when braking",
        "air hissing sound when applying brakes."
      ],
      "odiNumbers": [
        "10076034"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Tire Failure - Zipper Effect",
      "impact": "Sudden tire blowouts, particularly at high speeds, can lead to loss of vehicle control, accidents, and potential injuries or fatalities.",
      "symptoms": [
        "Tire blowout with a \"zipper effect\" (a rapid and catastrophic failure of the tire's sidewall)",
        "often accompanied by a loud noise",
        "loss of vehicle control",
        "and potential damage to the vehicle or surrounding property."
      ],
      "odiNumbers": [
        "8011909"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Suspension Spring Assembly Failure",
      "impact": "The failure of the rear suspension spring assembly can cause the springs to shift out of the center bushing, leading to uneven wear on the tires, reduced vehicle stability, and potential loss of control, which can increase the risk of accidents.",
      "symptoms": [
        "The rear suspension springs are shifting out of the center bushing",
        "the \"L\" shape guards are broken or missing",
        "the springs are making contact with the hanger",
        "the vehicle is experiencing uneven tire wear",
        "the vehicle is pulling to one side while driving."
      ],
      "odiNumbers": [
        "871394"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Improperly Designed or Missing \"L\" Shape Guards",
      "impact": "The absence or improper design of the \"L\" shape guards can cause the rear suspension springs to shift out of the center bushing, leading to uneven wear on the tires, reduced vehicle stability, and potential loss of control, which can increase the risk of accidents.",
      "symptoms": [
        "The \"L\" shape guards are broken or missing",
        "the springs are shifting out of the center bushing",
        "the vehicle is experiencing uneven tire wear",
        "the vehicle is pulling to one side while driving."
      ],
      "odiNumbers": [
        "871394"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}