{
  "totalComplaints": 17,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "VISIBILITY",
    "TIRES",
    "POWER TRAIN",
    "SUSPENSION",
    "EXTERIOR LIGHTING"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Window Regulator Failure",
      "impact": "The failure of the window regulator can cause the window to jam or fall into the door, potentially leading to egress issues in emergency situations, and resulting in costly repairs.",
      "symptoms": [
        "The window stops moving",
        "the window falls into the door",
        "the window glass plate comes out of the door channel",
        "loud cracking or crashing sounds when the window fails",
        "sudden and unexpected failure of the window regulator."
      ],
      "odiNumbers": [
        "10213133",
        "10186011",
        "10163835",
        "539120"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Tire Blowout",
      "impact": "Tire blowouts can cause loss of control, accidents, and serious injuries or fatalities, especially at high speeds.",
      "symptoms": [
        "Sudden loss of tire pressure",
        "loud noise",
        "loss of vehicle control",
        "tire fragments or debris on the road."
      ],
      "odiNumbers": [
        "10149701",
        "609295"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Spare Tire Mount Design Flaw",
      "impact": "The spare tire mount design flaw can cause the spare tire to wear down prematurely, leading to potential sidewall failure, which can cause accidents or injuries.",
      "symptoms": [
        "Pronounced marks and grooves on the spare tire sidewalls",
        "visible and palpable tire belts",
        "spare tire cannot be used."
      ],
      "odiNumbers": [
        "748180"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Loss of Traction and Rear Sliding",
      "impact": "The loss of tire road grip can cause the vehicle to lose control, leading to accidents or near-miss situations, especially when taking turns.",
      "symptoms": [
        "The vehicle's rear end slides out when taking turns",
        "the vehicle lacks traction on certain road surfaces",
        "the vehicle's tires lose grip on the road."
      ],
      "odiNumbers": [
        "544965"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Transmission Slipping or Harsh Shifting",
      "impact": "The transmission's failure to shift smoothly can cause the vehicle to jerk or hesitate, leading to loss of control, accidents, or increased wear on the transmission and other components.",
      "symptoms": [
        "The transmission shifts harshly",
        "the transmission slips or hesitates between gears",
        "the vehicle jerks or lurches when shifting gears."
      ],
      "odiNumbers": [
        "544965",
        "542966"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Suspension and Tire Issues",
      "impact": "The inadequate rear suspension and tire design can cause the vehicle to slide during turns, leading to a loss of control and increased risk of accidents. The poor suspension performance can also result in a bumpy ride, reducing comfort and potentially causing fatigue.",
      "symptoms": [
        "The vehicle's rear end slides or fishtails during turns",
        "the ride is excessively bumpy",
        "the suspension does not absorb bumps properly",
        "the vehicle hops or oscillates after hitting a bump."
      ],
      "odiNumbers": [
        "544965",
        "542966"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Insufficient Low Beam Headlight Illumination",
      "impact": "Inadequate low beam headlight illumination can reduce the driver's visibility, increasing the risk of accidents, especially at night or in low-light conditions.",
      "symptoms": [
        "Low beam headlights do not provide enough illumination",
        "low beam headlights do not illuminate the road properly",
        "difficulty seeing the road ahead",
        "reduced visibility at night or in low-light conditions."
      ],
      "odiNumbers": [
        "544965",
        "542966"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}