{
  "totalComplaints": 29,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SUSPENSION",
    "STEERING",
    "STRUCTURE",
    "FUEL SYSTEM",
    "VEHICLE SPEED CONTROL"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Bushing Failure",
      "impact": "The failure of the rear bushings can cause the vehicle to shake violently, making it difficult to control, and potentially leading to accidents or loss of life.",
      "symptoms": [
        "The rear end of the vehicle shakes violently",
        "the vehicle drifts from left to right",
        "the vehicle is difficult to control",
        "the steering wheel does not respond."
      ],
      "odiNumbers": [
        "11242762",
        "10424499"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Strut Tower Corrosion",
      "impact": "Corrosion of the strut tower can cause the strut tower to detach from the frame, leading to loss of control and potential accidents.",
      "symptoms": [
        "The vehicle has limited stability in the steering wheel",
        "the steering wheel does not respond",
        "the strut tower is corroded",
        "the strut tower detaches from the frame."
      ],
      "odiNumbers": [
        "10429872",
        "10286737",
        "10274509"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Rear Suspension and Steering System Failure",
      "impact": "Failure of the rear suspension and steering system can cause the vehicle to shake violently, making it difficult to control, and potentially leading to accidents or loss of life.",
      "symptoms": [
        "The vehicle has a distinct shimmy",
        "brake problems",
        "rapping in the steering shaft",
        "excessive wear in the suspension and steering system",
        "rear shock absorbers fail."
      ],
      "odiNumbers": [
        "708607",
        "606604"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Steering Column Failure",
      "impact": "The failure of the steering column can cause loss of control, making it difficult or impossible to steer the vehicle, which can lead to accidents.",
      "symptoms": [
        "The steering wheel fractures",
        "the vehicle is unable to steer",
        "the steering column fails",
        "the vehicle swerves or pulls to one side."
      ],
      "odiNumbers": [
        "10863087",
        "10409010",
        "10406610"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Strut Tower Housing Failure",
      "impact": "The failure of the strut tower housing can cause loss of control, making it difficult or impossible to steer the vehicle, which can lead to accidents.",
      "symptoms": [
        "The vehicle pulls to one side",
        "the vehicle swerves",
        "the rear of the vehicle loses traction",
        "the vehicle is unstable at high speeds."
      ],
      "odiNumbers": [
        "11128014",
        "10472477",
        "10403636"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Recall Repair Issues",
      "impact": "Failure to properly repair recalled vehicles can lead to ongoing safety issues, putting drivers and passengers at risk.",
      "symptoms": [
        "Dealerships fail to repair recalled vehicles",
        "dealerships claim pre-existing problems",
        "dealerships refuse to reimburse for repair expenses."
      ],
      "odiNumbers": [
        "11128014",
        "10409010",
        "10403636"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Frame Rust and Corrosion",
      "impact": "The rust and corrosion of the vehicle's frame can cause structural damage, leading to potential safety hazards, such as wheel separation, loss of control, and catastrophic failure, which can result in severe injuries or fatalities.",
      "symptoms": [
        "Excessive noise when turning the steering wheel",
        "frame rubbing on the steering shaft",
        "wheel well rusting and resting on the driveshaft",
        "visible signs of rust and corrosion on the frame."
      ],
      "odiNumbers": [
        "10629909",
        "10533854",
        "10396859"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Frame Failure and Corrosion",
      "impact": "The failure of the frame due to excessive corrosion and rot can cause catastrophic failure while driving, leading to loss of control, accidents, and potentially serious injuries or fatalities.",
      "symptoms": [
        "Excessive corrosion and rot on the frame",
        "undercarriage",
        "and mounting brackets",
        "particularly on the front apron and frame; broken frame above the left front axle; easily poked through by using a finger; vehicle deemed unsafe to operate by mechanics and body shop managers."
      ],
      "odiNumbers": [
        "10376467",
        "10267650",
        "10214767"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inadequate Repair and Reimbursement Process",
      "impact": "The manufacturer's inadequate repair and reimbursement process can cause frustration and financial burden for vehicle owners, potentially leading to delayed or neglected repairs, which can further compromise vehicle safety.",
      "symptoms": [
        "Difficulty in obtaining reimbursement for repairs; manufacturer's requirement for repairs to be performed at a specific dealership",
        "despite distance or inconvenience; lack of pre-authorization for repairs at a closer dealership."
      ],
      "odiNumbers": [
        "10267650",
        "10214767"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Sudden Unintended Acceleration (SUA) due to Gas Pedal Linkage Failure",
      "impact": "The sudden and unintended acceleration of the vehicle can lead to loss of control, accidents, and potentially serious injuries or fatalities.",
      "symptoms": [
        "The gas pedal does not respond to pressure",
        "suddenly accelerates when depressed with more force",
        "and may stick or hesitate. The vehicle may accelerate suddenly while braking",
        "and the driver may be unable to slow down or stop the vehicle."
      ],
      "odiNumbers": [
        "719452",
        "715301",
        "830349"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}