{
  "totalComplaints": 13,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "STRUCTURE",
    "TIRES",
    "EQUIPMENT"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Roof Structural Integrity Failure",
      "impact": "The failure of the roof structure can cause it to detach while driving, obstructing the view of following vehicles and potentially leading to accidents, injuries, or fatalities.",
      "symptoms": [
        "The roof comes loose or detaches while driving",
        "the roof membrane is loose or detached",
        "the roof structure is popping off",
        "the roof is not securely attached to the motorhome."
      ],
      "odiNumbers": [
        "10454923",
        "10021205",
        "547314"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Improper Installation of Fresh Water Tank Duct Connection",
      "impact": "The improper installation of the duct connection between the external fresh water tank and the motorhome can allow dirt, water, insects, and rodents to enter the interior of the motorhome, potentially causing damage and health hazards.",
      "symptoms": [
        "The opening on the underside of the motorhome allows unwanted access to the interior",
        "dirt",
        "water",
        "insects",
        "and rodents enter the motorhome through the duct connection."
      ],
      "odiNumbers": [
        "10083394"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Tire Blowouts",
      "impact": "Sudden tire blowouts can cause loss of vehicle control, accidents, and potentially result in injuries or fatalities.",
      "symptoms": [
        "Sudden loud noise",
        "loss of air pressure",
        "tire fragments scattered on the road",
        "vehicle vibration or wobbling",
        "difficulty steering or maintaining control."
      ],
      "odiNumbers": [
        "10004584",
        "10002327"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Plastic Mounting Brackets Failure",
      "impact": "The failure of the plastic mounting brackets can cause the handle to break, leading to falls and potential injuries.",
      "symptoms": [
        "The handle on the motorhome gives way",
        "causing the consumer to fall; the mounting brackets are made of plastic and appear to be under-designed."
      ],
      "odiNumbers": [
        "566404"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Gas Valve Sticking Due to Heat",
      "impact": "The sticking of the gas valve can cause a gas leak, leading to a fire hazard, and potentially resulting in injuries or fatalities.",
      "symptoms": [
        "The front burner on the Magic Chief cooktop range causes the gas valve to stick",
        "making it impossible to turn off the gas; the valve can only be turned off by shutting off the main valve from outside; the valve can be turned off from inside after it has cooled down."
      ],
      "odiNumbers": [
        "849332"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}