{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "VISIBILITY",
    "EXTERIOR LIGHTING",
    "STEERING",
    "EQUIPMENT",
    "POWER TRAIN"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Exterior Mirror Failure",
      "impact": "The sudden failure of the exterior mirror can cause a loss of visibility, increasing the risk of accidents, and may also lead to damage to the surrounding area or other vehicles.",
      "symptoms": [
        "The exterior mirror breaks off or falls off while driving",
        "the mirror shaft breaks at the point where it meets the signal light",
        "the mirror is left hanging by the cable",
        "the mirror is no longer securely attached to the handlebars."
      ],
      "odiNumbers": [
        "562710",
        "862113",
        "846238"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Turn Signal Light Mounting Failure",
      "impact": "The loose turn signal light can cause distraction or obstruction of the driver's view, leading to potential accidents or near-misses. Additionally, the dangling signal light can cause electrical issues or short circuits, which can further compromise vehicle safety.",
      "symptoms": [
        "The turn signal light is loose and slides out of position",
        "the turn signal light is dangling from the brake handle assembly",
        "the turn signal light is not securely mounted."
      ],
      "odiNumbers": [
        "562710"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Failure to Comply with Recall Notice",
      "impact": "The failure of the dealership to comply with the recall notice and repair the motorcycle can lead to accidents or injuries due to the hazardous condition of the handlebars, as stated in the recall notice.",
      "symptoms": [
        "The dealership refuses to repair the motorcycle",
        "citing lack of parts or uncertainty about when they will be available",
        "despite the recall notice indicating that it is dangerous to operate the motorcycle."
      ],
      "odiNumbers": [
        "719129"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Misleading Information from Service Department",
      "impact": "The service department's misleading information can lead to accidents or injuries by downplaying the severity of the recall and encouraging the rider to operate the motorcycle despite the hazardous condition.",
      "symptoms": [
        "The service department provides contradictory information",
        "stating that the handlebars are \"probably okay\" to ride",
        "despite the recall notice indicating that it is dangerous to operate the motorcycle."
      ],
      "odiNumbers": [
        "719129"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Delayed or Denied Recall Repairs",
      "impact": "The failure of dealerships to perform recall repairs in a timely manner can leave vehicles with safety-critical defects on the road, potentially causing accidents or injuries.",
      "symptoms": [
        "Dealerships deny or delay recall repairs",
        "citing unavailability of parts",
        "despite manufacturer claims that parts are available."
      ],
      "odiNumbers": [
        "718527"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Unavailability of Recall Parts",
      "impact": "The unavailability of recall parts can prevent dealerships from performing necessary repairs, leaving vehicles with safety-critical defects on the road, potentially causing accidents or injuries.",
      "symptoms": [
        "Dealerships claim that recall parts are unavailable",
        "despite manufacturer claims that parts have been sent or are available."
      ],
      "odiNumbers": [
        "718527"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Speedometer Gauge Failure",
      "impact": "The failure of the speedometer gauge can cause the driver to be unaware of their speed, which can lead to accidents, traffic violations, and difficulty maintaining a safe speed.",
      "symptoms": [
        "The speedometer needle does not move",
        "the speedometer displays an incorrect speed",
        "the speedometer is stuck on a specific speed",
        "the speedometer is blank or not illuminated."
      ],
      "odiNumbers": [
        "550330"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}