{
  "totalComplaints": 19,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "STEERING",
    "SERVICE BRAKES",
    "SUSPENSION"
  ],
  "parsedComplaintsResultLength": 3,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Incorrect Routing of Front Steering Lines",
      "impact": "The incorrect routing of the front steering lines can cause them to wear through due to rubbing, leading to a loss of steering fluid and potentially causing a loss of steering control, which can increase the risk of accidents.",
      "symptoms": [
        "The front steering lines are rubbing against other components",
        "the front steering lines are showing signs of wear",
        "the front steering lines are leaking fluid",
        "the steering system is making unusual noises."
      ],
      "odiNumbers": [
        "886752",
        "886753",
        "886754",
        "886756",
        "886663",
        "886664"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Uninsulated Air Lines Causing Wear and Damage",
      "impact": "The lack of insulation on the air lines can cause them to rub against the frame, leading to wear and damage, which can result in air leaks, reduced braking performance, and potentially cause accidents.",
      "symptoms": [
        "Air lines rubbing against the frame",
        "wear and damage to the air lines",
        "air leaks",
        "reduced braking performance."
      ],
      "odiNumbers": [
        "886767",
        "886769",
        "886771",
        "886773",
        "886776",
        "886779"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Inconsistent Front Shock Mounting Holes and Studs",
      "impact": "The mismatch between the front shock mounting holes and studs can cause instability and affect the vehicle's handling, leading to potential accidents or loss of control.",
      "symptoms": [
        "Front shock mounting holes are larger than the studs",
        "making it difficult or impossible to properly secure the shocks",
        "leading to uneven wear",
        "noise",
        "and vibration."
      ],
      "odiNumbers": [
        "886645",
        "886647",
        "886649",
        "886650",
        "886653",
        "886662"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}