{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "SUSPENSION",
    "STRUCTURE",
    "SERVICE BRAKES",
    "STEERING"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Bent Axle",
      "impact": "A bent axle can cause the vehicle to vibrate or shake at high speeds, leading to uneven tire wear, reduced traction, and potentially loss of control, which can increase the risk of accidents.",
      "symptoms": [
        "Vehicle shakes or vibrates at speeds of 40mph and higher",
        "uneven tire wear",
        "front end misalignment."
      ],
      "odiNumbers": [
        "877239",
        "551712"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Rear End Overheating",
      "impact": "Overheating of the rear end can cause premature wear on brake calipers, leading to reduced braking performance and increased stopping distances, which can increase the risk of accidents.",
      "symptoms": [
        "Rear end overheating",
        "brake calipers wear excessively."
      ],
      "odiNumbers": [
        "857351"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Excessive Gross Vehicle Weight Rating (GVWR) Exceeded",
      "impact": "Exceeding the Gross Vehicle Weight Rating (GVWR) can lead to reduced vehicle stability, increased stopping distances, and a higher risk of accidents, particularly when driving on inclines or in adverse weather conditions.",
      "symptoms": [
        "The vehicle's weight exceeds the manufacturer's specified GVWR",
        "especially when fully loaded with camping gear",
        "fuel",
        "and other items",
        "causing concerns about safety and stability."
      ],
      "odiNumbers": [
        "562443",
        "559657"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Inadequate Braking Performance with Excess Weight",
      "impact": "The inability to brake properly, especially when carrying excess weight, can increase the risk of accidents, injuries, and fatalities, as well as damage to the vehicle and other property.",
      "symptoms": [
        "The vehicle takes longer to stop than expected",
        "the brakes feel spongy or soft",
        "the vehicle pulls to one side when braking",
        "the brakes overheat",
        "the vehicle's stopping distance is increased."
      ],
      "odiNumbers": [
        "562443",
        "551712"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Steering Issues with Excess Weight",
      "impact": "Steering difficulties, especially when carrying excess weight, can increase the risk of accidents, injuries, and fatalities, as well as damage to the vehicle and other property.",
      "symptoms": [
        "The vehicle is difficult to steer",
        "the steering wheel feels heavy or hard to turn",
        "the vehicle wanders or drifts while driving",
        "the vehicle's tires wear unevenly",
        "the vehicle's steering system makes unusual noises."
      ],
      "odiNumbers": [
        "551712"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Power Steering Failure",
      "impact": "The failure of the power steering system can cause the vehicle to become difficult to steer, increasing the risk of accidents, especially when towing or hauling heavy loads.",
      "symptoms": [
        "The vehicle is hard to steer",
        "the steering wheel feels heavy or stiff",
        "the vehicle wanders or drifts while driving",
        "the power steering pump makes unusual noises",
        "the power steering fluid level is low."
      ],
      "odiNumbers": [
        "562443"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Towing-Related Power Steering Failure",
      "impact": "The failure of the power steering system while towing can cause the vehicle to become difficult to steer, increasing the risk of accidents, especially when towing or hauling heavy loads.",
      "symptoms": [
        "The vehicle is hard to steer while towing",
        "the steering wheel feels heavy or stiff while towing",
        "the vehicle wanders or drifts while towing",
        "the power steering pump makes unusual noises while towing."
      ],
      "odiNumbers": [
        "562443"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}