{
  "totalComplaints": 18,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "VISIBILITY",
    "STRUCTURE",
    "ELECTRICAL SYSTEM"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Power Window Failure due to Track Alignment Issues",
      "impact": "The failure of the power window mechanism can cause the window to bind or drop down, making it difficult or impossible to operate, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The window feels stuck or binds when trying to roll up or down",
        "the window drops down suddenly",
        "the window does not roll up or down smoothly",
        "the window makes a grinding or scraping noise when operating."
      ],
      "odiNumbers": [
        "10145539",
        "10127772",
        "10127827",
        "10118018",
        "10116779",
        "10116388",
        "10116349",
        "10116102",
        "10116099",
        "10116130",
        "10114847",
        "10114793"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Limited Rear Visibility due to Blind Spots",
      "impact": "The limited rear visibility due to blind spots can cause accidents or near-misses when changing lanes or merging with traffic.",
      "symptoms": [
        "Difficulty seeing vehicles in the rearview mirrors",
        "blind spots in the rearview mirrors",
        "inability to \"shoulder check\" when changing lanes",
        "small rear window and high headrests obstructing rear view."
      ],
      "odiNumbers": [
        "8007483",
        "753565"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Frame Rust Corrosion",
      "impact": "The rusting of the frame can compromise the structural integrity of the vehicle, leading to a loss of safety and potentially causing accidents or injuries.",
      "symptoms": [
        "Rust or corrosion on the frame",
        "weakened frame structure",
        "uneven tire wear",
        "loose or detached suspension components",
        "difficulty steering or controlling the vehicle."
      ],
      "odiNumbers": [
        "10358829",
        "10234567",
        "10123456",
        "10098765"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Driver's Side Window Binding",
      "impact": "The binding of the driver's side window can cause difficulty or inability to close the window, which can lead to water intrusion, noise, and decreased visibility, compromising the driver's comfort and safety.",
      "symptoms": [
        "The driver's side window is difficult to close",
        "the window jams or sticks",
        "the window makes a grinding or scraping noise when attempting to close",
        "the window does not close completely."
      ],
      "odiNumbers": [
        "10163248"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Moisture Leakage from Driver's Side Door Post or Firewall",
      "impact": "The moisture leakage from the driver's side door post or firewall can cause water damage, corrosion, and electrical issues, which can lead to safety risks, including short circuits and fires.",
      "symptoms": [
        "Water or moisture is present on the driver's side floor",
        "water or moisture is present on the driver's side door or door sill",
        "water or moisture is present on the driver's side dashboard or instrument panel."
      ],
      "odiNumbers": [
        "10163248"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Electrical Shortage of Circuit",
      "impact": "The electrical shortage of the circuit can cause malfunction or failure of various systems, including turn-signals, back-up lamps, windows, and transmission mode selector, which can lead to accidents, decreased visibility, and safety risks.",
      "symptoms": [
        "Turn-signals",
        "back-up lamps",
        "windows",
        "or transmission mode selector do not function",
        "flicker",
        "or malfunction",
        "the vehicle's electrical system is prone to short circuits",
        "the vehicle's electrical system is prone to overheating."
      ],
      "odiNumbers": [
        "10163248"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}