{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "WHEELS",
    "SEATS",
    "STRUCTURE",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Axle Hub Failure",
      "impact": "The failure of the rear axle hub can cause loss of control, accidents, and injuries, especially at low speeds.",
      "symptoms": [
        "The rear axle hub breaks off while driving",
        "causing the motorcycle to lose control or collide with other vehicles."
      ],
      "odiNumbers": [
        "10048789"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Defective 5th Gear Transmission",
      "impact": "The defective 5th gear transmission can cause the gear to fail, leading to costly repairs, and potentially causing accidents or loss of control.",
      "symptoms": [
        "A loud howling or chattering sound comes from the engine area",
        "particularly when cruising in 5th gear; the gear may become deformed",
        "and the transmission may need to be rebuilt."
      ],
      "odiNumbers": [
        "10039156",
        "10037124"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Wheel Spoke Failure",
      "impact": "The sudden failure of rear wheel spokes can cause the vehicle to wobble or vibrate, leading to a loss of control, accidents, or strandings.",
      "symptoms": [
        "Rear wheel spokes snap or break",
        "the vehicle wobbles or vibrates while driving",
        "the wheel becomes loose",
        "the vehicle is difficult to control."
      ],
      "odiNumbers": [
        "10157564",
        "10157570"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Loose Passenger Seat",
      "impact": "A loose passenger seat can cause the passenger to fall off the vehicle while in motion, resulting in serious injury or even death.",
      "symptoms": [
        "The passenger seat feels loose or unstable",
        "the passenger seat shifts or moves while the vehicle is in motion",
        "the passenger falls off the vehicle while traveling at high speeds."
      ],
      "odiNumbers": [
        "10249230"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Front Fender Crack due to Vibration",
      "impact": "The crack in the front fender can lead to further damage, potentially causing the fender to break off while riding, which can affect the vehicle's stability and increase the risk of accidents.",
      "symptoms": [
        "Squeaking noise from the front fender area",
        "visible crack on the right side of the fender behind the shock."
      ],
      "odiNumbers": [
        "10098028"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Brake Lockup and Failure to Release",
      "impact": "The sudden and unexpected lockup of the rear brake can cause the motorcycle to lose traction, leading to loss of control and potentially resulting in accidents, injuries, or fatalities.",
      "symptoms": [
        "The rear brake locks up and refuses to release",
        "causing the motorcycle to lose traction and control",
        "especially when slowing down or braking."
      ],
      "odiNumbers": [
        "10072323"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}