{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "ENGINE AND ENGINE COOLING",
    "AIR BAGS",
    "EQUIPMENT",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Engine Fire Due to Faulty Fuel System",
      "impact": "The engine fire can cause damage to the vehicle, potentially leading to accidents or injuries, and may result in costly repairs or even total loss of the vehicle.",
      "symptoms": [
        "The fuel gauge suddenly drops",
        "the vehicle loses power",
        "and a fire starts in the engine compartment or underneath the vehicle."
      ],
      "odiNumbers": [
        "10131039"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Failure to Complete Recall Repairs",
      "impact": "Failure to complete recall repairs can lead to continued safety risks, including engine fires, loss of power, and other issues that can cause accidents or injuries.",
      "symptoms": [
        "The dealership fails to perform recall repairs",
        "citing lack of time or other reasons",
        "despite the owner's attempts to schedule the repair."
      ],
      "odiNumbers": [
        "10159725",
        "10096786"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Timing Belt Failure",
      "impact": "Timing belt failure can cause engine damage, leading to costly repairs, and potentially causing accidents or injuries due to loss of power or stalling.",
      "symptoms": [
        "The timing belt breaks",
        "causing engine damage or failure."
      ],
      "odiNumbers": [
        "10115846"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Smoke from Engine and Check Engine Light Illumination",
      "impact": "Smoke from the engine can be a sign of a serious problem, potentially leading to engine failure, loss of power, or even a fire, which can cause accidents or injuries.",
      "symptoms": [
        "Smoke is observed coming from the engine",
        "and the check engine light illuminates."
      ],
      "odiNumbers": [
        "10163393"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Airbag Failure to Deploy",
      "impact": "The failure of airbags to deploy in the event of a crash can lead to serious injuries or fatalities, as the vehicle occupants may not receive the necessary protection.",
      "symptoms": [
        "Airbags fail to deploy in a crash",
        "resulting in injuries or fatalities."
      ],
      "odiNumbers": [
        "10188827"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Airbag Injuries due to Powder Emission",
      "impact": "The emission of powder from airbags during deployment can cause injuries, such as burns, to vehicle occupants.",
      "symptoms": [
        "Burns on the face and inside the mouth",
        "respiratory problems",
        "and other injuries caused by the powder emitted from the airbag."
      ],
      "odiNumbers": [
        "10100039"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Air Conditioning System Leak",
      "impact": "The constant leak of water from the air conditioning system can cause water accumulation in the passenger side wheel well, potentially leading to corrosion, electrical issues, and reduced vehicle safety.",
      "symptoms": [
        "Water leakage from the air conditioning system",
        "water accumulation in the passenger side wheel well",
        "musty or mildew odor inside the vehicle",
        "reduced air conditioning performance."
      ],
      "odiNumbers": [
        "10170576"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Inaccessible Recall Repair for Brake Hose",
      "impact": "The inability to access a dealership to perform the recall repair for the brake hose can lead to a increased risk of brake failure, which can cause accidents, injuries, or fatalities.",
      "symptoms": [
        "The consumer receives a recall notice but is unable to find a dealership to perform the repair",
        "the brake hose may be prone to failure",
        "the brakes may be spongy or soft",
        "the vehicle may take longer to stop."
      ],
      "odiNumbers": [
        "10097195"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}