{
  "totalComplaints": 13,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "ELECTRICAL SYSTEM",
    "SEATS"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Final Drive Shaft Failure",
      "impact": "The failure of the final drive shaft can cause the motorcycle to lose power, stall, or become stranded, leading to accidents or injuries, especially at high speeds.",
      "symptoms": [
        "The final drive shaft strips or seizes",
        "causing the motorcycle to lose speed or stall",
        "fluid leaks with metallic chips",
        "difficulty engaging the clutch",
        "and the motorcycle becomes difficult to control."
      ],
      "odiNumbers": [
        "10992985",
        "10641631",
        "10500854",
        "10053087",
        "10053099"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Insufficient Lubrication and Maintenance",
      "impact": "The lack of proper lubrication and maintenance of the final drive shaft can lead to premature wear, seizure, or failure, resulting in accidents or injuries.",
      "symptoms": [
        "The final drive shaft becomes dry or rusted",
        "leading to failure or seizure",
        "and the motorcycle may exhibit symptoms such as difficulty shifting",
        "loss of power",
        "or stalling."
      ],
      "odiNumbers": [
        "10091727",
        "10053087",
        "10053099"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Inadequate Design and Notification",
      "impact": "The design of the final drive shaft and the lack of notification to owners about necessary maintenance can lead to accidents or injuries due to premature failure.",
      "symptoms": [
        "The final drive shaft fails or seizes",
        "causing the motorcycle to lose power or stall",
        "and owners may not be aware of the necessary maintenance procedures to prevent this failure."
      ],
      "odiNumbers": [
        "10992985",
        "10053087",
        "10053099"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Starter Motor Failure",
      "impact": "The failure of the starter motor can leave the rider stranded, unable to start the motorcycle, which can be a safety concern, especially in traffic or emergency situations.",
      "symptoms": [
        "The starter motor fails to turn the engine",
        "the starter motor makes a clicking sound but does not turn the engine",
        "the starter motor is slow to turn the engine",
        "the starter motor overheats",
        "the motorcycle is difficult or impossible to start."
      ],
      "odiNumbers": [
        "10054770",
        "10047235"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Inadequate Recall Repair Process",
      "impact": "The inadequate recall repair process can lead to frustration and financial burden for vehicle owners, causing them to delay or forego necessary repairs, which can compromise vehicle safety.",
      "symptoms": [
        "Dealerships request payment for repairs or parts before performing recall-related work",
        "manufacturers' customer service is unresponsive or unhelpful",
        "owners are left on hold for extended periods",
        "owners are unclear about the repair process or costs."
      ],
      "odiNumbers": [
        "10198498"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Poor Manufacturer Customer Service",
      "impact": "Poor manufacturer customer service can lead to frustration and mistrust among vehicle owners, causing them to lose confidence in the manufacturer and potentially affecting their loyalty.",
      "symptoms": [
        "Long hold times",
        "unhelpful or unresponsive customer service representatives",
        "inability to resolve issues or answer questions",
        "lack of transparency about repair processes or costs."
      ],
      "odiNumbers": [
        "10198498"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}