{
  "totalComplaints": 32,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "SERVICE BRAKES",
    "ENGINE AND ENGINE COOLING"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "SMT Transmission Failure",
      "impact": "The failure of the SMT transmission can cause the vehicle to lurch, misshift, and lose momentum, increasing the risk of accidents and loss of control.",
      "symptoms": [
        "The transmission suddenly and without warning begins to lurch",
        "misshift",
        "and produce squealing noises",
        "making it difficult to control the vehicle."
      ],
      "odiNumbers": [
        "10305887",
        "10118218"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Gear Shift Bracket and Lever Failure",
      "impact": "The failure of the gear shift bracket and lever can prevent the gear from properly engaging, causing the vehicle to refuse to start or move.",
      "symptoms": [
        "The vehicle refuses to start",
        "and the gear shift bracket and lever are broken",
        "preventing the gear from properly engaging."
      ],
      "odiNumbers": [
        "10191237"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "SMT Transmission Creeping",
      "impact": "The SMT transmission creeping can cause the vehicle to move unexpectedly, increasing the risk of accidents and loss of control.",
      "symptoms": [
        "The SMT transmission creeps while in forward or reverse gear",
        "causing the vehicle to move unexpectedly."
      ],
      "odiNumbers": [
        "10118218"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Drive Shaft and Rear Wheel Drive Issues",
      "impact": "The abnormal spacing in the drive shaft with rear wheel drive can cause a \"thump\" or jolt when accelerating from a stop, potentially leading to loss of control.",
      "symptoms": [
        "A \"thump\" or jolt is felt when accelerating from a stop",
        "similar to being hit from the rear."
      ],
      "odiNumbers": [
        "10105724"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Transmission Downshifting Issues",
      "impact": "The abrupt downshifting of the transmission can cause the vehicle to lose momentum and control, increasing the risk of accidents.",
      "symptoms": [
        "The transmission abruptly downshifts to second gear while driving",
        "causing the vehicle to lose momentum and control."
      ],
      "odiNumbers": [
        "567810"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Brake System Failure (Undersized Brake Caliper and Associated Rotor and Brake Pad Quality Issues)",
      "impact": "The brake system failure can cause the vehicle to vibrate violently when applying the brakes, leading to a loss of control and increasing the risk of accidents. The warped rotors and excessive wear on brake pads can also lead to a failure of the brake system, compromising vehicle safety.",
      "symptoms": [
        "The vehicle shakes violently when applying the brakes",
        "the brake pads wear out excessively",
        "the rotors warp",
        "and the VSC system warning light comes on frequently."
      ],
      "odiNumbers": [
        "10121251",
        "10120968",
        "10107970",
        "10104251"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electronic Control Unit (ECU) Failure",
      "impact": "The failure of the ECU can cause the VSC TRAC, VSC OFF, ABS, and brake lights to come on, making it difficult or impossible to control the vehicle, which can lead to accidents.",
      "symptoms": [
        "The VSC TRAC",
        "VSC OFF",
        "ABS",
        "and brake lights come on",
        "the vehicle's traction control system is disabled",
        "and the vehicle's brake system is compromised."
      ],
      "odiNumbers": [
        "10209150"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Failure",
      "impact": "The failure of the transmission can cause the vehicle to become stuck in certain gears, stall sporadically, and illuminate the transmission warning light, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The vehicle becomes stuck in certain gears",
        "stalls sporadically",
        "transmission warning light is illuminated."
      ],
      "odiNumbers": [
        "10356100"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Catalytic Converter Failure",
      "impact": "The failure of the catalytic converter can cause the check engine light to illuminate, the vehicle to lose power, and prevent acceleration over a certain speed, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "Check engine light is illuminated",
        "vehicle loses power",
        "unable to accelerate over a certain speed."
      ],
      "odiNumbers": [
        "10326866"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Cracked Manifold",
      "impact": "A cracked manifold can cause a ticking noise, which can lead to engine failure and potentially cause accidents or leave the driver stranded.",
      "symptoms": [
        "Ticking noise from the engine."
      ],
      "odiNumbers": [
        "10129319"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}