{
  "totalComplaints": 16,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "STRUCTURE",
    "ENGINE AND ENGINE COOLING",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 4,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Frame Weld Failure and Cracking",
      "impact": "The failure of the frame welds can cause the frame to crack, leading to a loss of structural integrity, which can result in accidents, injuries, or fatalities.",
      "symptoms": [
        "Cracks in the frame",
        "particularly in the rear triangular area",
        "near welds",
        "and on both sides of the passenger floorboards; the frame may be deemed non-repairable by dealerships."
      ],
      "odiNumbers": [
        "10883175",
        "10610240",
        "10282059",
        "10244559",
        "10234852",
        "10134132",
        "10063569",
        "10056025",
        "10049800",
        "10047328"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Difficulty with Recall Repairs and Service",
      "impact": "The failure of dealerships to properly perform recall repairs and provide adequate service can lead to delays, inconvenience, and a lack of trust in the manufacturer and its representatives.",
      "symptoms": [
        "Dealerships refusing to perform recall repairs",
        "citing lack of certified welders or availability; dealerships providing inadequate or temporary fixes; manufacturers providing inadequate support and written assurances; and difficulties in getting recall work performed."
      ],
      "odiNumbers": [
        "10134132",
        "10056025",
        "10047328"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Cooling System Failure",
      "impact": "The failure of the cooling system can cause the engine to overheat, leading to damage to the engine and potentially causing a loss of coolant, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The temperature gauge enters the red danger zone",
        "the engine overheats",
        "coolant spills or leaks",
        "the cooling fan operation affects the temperature gauge",
        "the brake light operation affects the temperature gauge."
      ],
      "odiNumbers": [
        "10164505",
        "10041702"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Foot Pedal Brake Shudder and Diminished Braking Power",
      "impact": "The shudder and diminished braking power can cause the rider to lose control of the motorcycle, leading to accidents or injuries.",
      "symptoms": [
        "The motorcycle shudders violently when the rear foot pedal brake is applied without the front hand brake",
        "especially in high ambient temperatures (above 105°F); braking power is reduced; applying the front brake usually eliminates the shudder."
      ],
      "odiNumbers": [
        "10519662"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}