{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "EQUIPMENT",
    "SUSPENSION",
    "STRUCTURE",
    "ELECTRICAL SYSTEM",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Microwave Oven Circuit Short and Display Malfunction",
      "impact": "A circuit short in the microwave oven can cause spontaneous energization, which can lead to a fire hazard, especially when in close proximity to propane valves, pipes, and jets. The inoperable display can also make it difficult for users to operate the microwave safely.",
      "symptoms": [
        "The microwave oven display lights are not working",
        "the microwave oven is not functioning properly",
        "the consumer is unable to operate the microwave safely."
      ],
      "odiNumbers": [
        "10049810"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Trailer Entry Step Design Flaw",
      "impact": "The narrow entry step design can cause individuals to miss the step when exiting the trailer, leading to accidents and injuries.",
      "symptoms": [
        "The entry step is too narrow for the door width",
        "making it difficult to exit the trailer safely."
      ],
      "odiNumbers": [
        "10009451"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Trailer Sway and Suspension Issues",
      "impact": "The excessive sway of the trailer can cause loss of control, accidents, and potentially flip the vehicle over, posing a significant risk to the driver and passengers.",
      "symptoms": [
        "The trailer sways violently at speeds over 50 mph",
        "making it difficult to drive",
        "and the vehicle is prone to flipping over."
      ],
      "odiNumbers": [
        "8018316",
        "10042178"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Particle Board Flooring Deterioration in Travel Trailers",
      "impact": "The deterioration of the particle board flooring in travel trailers can cause moldings to fall off while on the road, leading to potential safety hazards, such as a person falling through the floor or walls collapsing while the trailer is in motion.",
      "symptoms": [
        "Moldings fall off while driving",
        "water retention and absorption by the particle board floor",
        "flooring deterioration",
        "softening of the floor",
        "pieces of flooring and moldings breaking off",
        "including long pieces up to 8 feet in length."
      ],
      "odiNumbers": [
        "10269783"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inadequate Water Resistance of Particle Board Flooring",
      "impact": "The lack of water resistance in particle board flooring can lead to water absorption and retention, causing the flooring to deteriorate and increasing the risk of moldings falling off, floor collapse, or wall failure while the trailer is in motion.",
      "symptoms": [
        "Water retention and absorption by the particle board floor",
        "flooring deterioration",
        "softening of the floor",
        "moldings falling off",
        "pieces of flooring and moldings breaking off."
      ],
      "odiNumbers": [
        "10269783"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Console Lighting Failure",
      "impact": "The failure of the console lighting can cause poor visibility, making it difficult for the driver to see the gearshift indicator, which can lead to improper shifting and potentially cause accidents or damage to the transmission.",
      "symptoms": [
        "The console lighting fails to illuminate",
        "the gearshift indicator is not visible",
        "the driver has difficulty seeing the console display",
        "the driver has difficulty shifting gears due to poor visibility."
      ],
      "odiNumbers": [
        "10115906"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Insufficient Pedal Spacing",
      "impact": "The close proximity of the brake and accelerator pedals can lead to accidental braking or acceleration, potentially causing accidents or loss of control.",
      "symptoms": [
        "Difficulty switching between brake and accelerator pedals",
        "accidental activation of brake or accelerator",
        "pedals are too close together",
        "making it difficult to operate safely."
      ],
      "odiNumbers": [
        "10080726"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}