{
  "totalComplaints": 28,
  "numberOfFilteredComplaintMapKeys": 2,
  "filteredComplaintMapKeys": [
    "FUEL SYSTEM",
    "FUEL/PROPULSION SYSTEM"
  ],
  "parsedComplaintsResultLength": 2,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Plastic Fuel Tank Expansion/Failure",
      "impact": "The expansion or failure of the plastic fuel tank can cause fuel leaks, fires, or accidents, posing a significant risk to the rider's safety.",
      "symptoms": [
        "The fuel tank is swelling or expanding",
        "causing it to rub against the ignition switch",
        "handlebars",
        "or frame; the tank no longer sits properly on the frame; the rubber mounts no longer contact the frame; the tank latch is difficult to open or close; the tank is warped or has ripples on its surface; the paint is cracking around the tank latch."
      ],
      "odiNumbers": [
        "10436804",
        "10399456",
        "10395964",
        "10372595",
        "10355018",
        "10342352",
        "10340511",
        "10339515",
        "10339318",
        "10339409",
        "10336846",
        "10336266",
        "10330989",
        "10315343",
        "10307132",
        "10305013",
        "10305128",
        "10302058",
        "10294583",
        "10282444",
        "10282307",
        "10279841",
        "10279748",
        "10279737"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Plastic Fuel Tank Expansion and Warping",
      "impact": "The expansion and warping of the plastic fuel tank can cause fuel leaks, sprays, and spills, leading to a fire hazard and making the vehicle unsafe to operate. The warped tank can also make it difficult to access the front tank release latch, and the constant presence of gasoline fumes can be hazardous.",
      "symptoms": [
        "The fuel tank expands and warps",
        "causing the tank vents to stop working effectively",
        "fuel leaks and sprays extensively from the top of the tank",
        "and fuel leaks from the overflow tube. The expansion also makes it difficult to access the front tank release latch",
        "and the tank does not sit firmly on the frame."
      ],
      "odiNumbers": [
        "10966646",
        "10822360",
        "10676839",
        "10509341"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}