{
  "totalComplaints": 59,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "FUEL SYSTEM",
    "ELECTRICAL SYSTEM",
    "EXTERIOR LIGHTING"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel Level Sensor Failure",
      "impact": "The failure of the fuel level sensor can cause the fuel gauge to malfunction, leading to inaccurate readings, stalling, and potentially leaving the driver stranded. This can increase the risk of accidents, especially if the vehicle stalls while driving.",
      "symptoms": [
        "The fuel gauge fluctuates between empty and full",
        "reads empty when the tank is full",
        "or reads full when the tank is empty. The gauge may also stick on empty or full",
        "making it difficult to determine the actual fuel level."
      ],
      "odiNumbers": [
        "10551938",
        "10521835",
        "10521517",
        "10446355",
        "10441984",
        "10437897",
        "10430774",
        "10421448",
        "10418239",
        "10411836",
        "10408976",
        "10408624",
        "10404162",
        "10404247",
        "10402769",
        "10401443",
        "10398831",
        "10398485",
        "10398560",
        "10398640",
        "10398651",
        "10383451",
        "10313430",
        "10260578"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Power Window Master Switch Failure",
      "impact": "The failure of the power window master switch can cause the windows to malfunction, leading to inconvenience and potential safety risks, especially if the windows become stuck in an open or closed position.",
      "symptoms": [
        "The driver-side front window will not go down",
        "all other windows work",
        "the power window master switch does not respond properly",
        "the windows open independently",
        "the driver-side door panel emits a burning smell",
        "and the lock and window mechanisms no longer work properly."
      ],
      "odiNumbers": [
        "11204467",
        "10995297",
        "10514246",
        "10575724",
        "10480618"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "HID Headlight Failure",
      "impact": "The failure of the HID headlights can cause reduced visibility, increasing the risk of accidents, especially at night or in low-light conditions.",
      "symptoms": [
        "The HID headlights flicker and then turn off",
        "the headlights will eventually flicker and turn off again",
        "the headlights can stay on for a few seconds or minutes before turning off",
        "and the voltage has been tested and is fine at 14 volts."
      ],
      "odiNumbers": [
        "10816298",
        "10671715",
        "11184163"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Electrical System Failure",
      "impact": "The failure of the electrical system can cause a multitude of electrical issues, including fire hazards, and can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The vehicle stalls or loses power while in motion",
        "electrical surges cause a multitude of electrical issues",
        "fire in the fuse box",
        "burning out the low-beam relay",
        "audio interference through the speakers",
        "remote access fails intermittently",
        "and electronics not working intermittently."
      ],
      "odiNumbers": [
        "10817632",
        "10671715",
        "10514246"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Air Bag Deployment",
      "impact": "The unintended deployment of airbags can cause accidents, injuries, or fatalities.",
      "symptoms": [
        "The passenger-side airbag inadvertedly deployed without warning",
        "and the airbag was repaired; however",
        "the diagnosis was unavailable."
      ],
      "odiNumbers": [
        "10870445"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Intermittent Headlight Failure",
      "impact": "The intermittent failure of the headlights can cause reduced visibility, increasing the risk of accidents, especially when driving at night or in low-light conditions.",
      "symptoms": [
        "Headlights flicker",
        "shut off",
        "or turn off suddenly while driving",
        "sometimes returning on their own; headlights may require high beams to be activated to view the road; passenger side headlight may go out while the driver side headlight remains on."
      ],
      "odiNumbers": [
        "11154638",
        "10863096",
        "10817138",
        "10701981",
        "10682363",
        "10679676",
        "10594699"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Headlight Driver Module (HDM) Failure",
      "impact": "The failure of the Headlight Driver Module (HDM) can cause the headlights to malfunction, leading to reduced visibility and increased risk of accidents.",
      "symptoms": [
        "Headlights flicker",
        "shut off",
        "or turn off suddenly while driving; headlights may require high beams to be activated to view the road; passenger side headlight may go out while the driver side headlight remains on."
      ],
      "odiNumbers": [
        "10817138",
        "10679676"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Electrical System Issues",
      "impact": "The electrical system issues can cause a range of problems, including intermittent headlight failure, stability control system malfunctions, and airbag system malfunctions, which can increase the risk of accidents and compromise vehicle safety.",
      "symptoms": [
        "Headlights flicker",
        "shut off",
        "or turn off suddenly while driving; stability control system light and airbag light come on and go off; steering locks up and jumps; windshield wipers and washer sprayers turn on and off on their own."
      ],
      "odiNumbers": [
        "10594699"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}