{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "POWER TRAIN",
    "SUSPENSION",
    "VISIBILITY",
    "STEERING"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Stuck Brake Caliper Failure",
      "impact": "The failure of the brake caliper can cause the brake pedal to go to the floor, leading to a loss of brakes, which can result in accidents, injuries, or fatalities.",
      "symptoms": [
        "The brake pedal feels soft or spongy",
        "the brake pedal goes to the floor",
        "the brakes overheat",
        "the brakes drag",
        "the brakes produce a burning smell",
        "the vehicle is unable to stop or slow down properly."
      ],
      "odiNumbers": [
        "11035792",
        "10461961"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Allison Automatic Transmission Shifting Issue",
      "impact": "The transmission's failure to shift from Neutral to Drive or Reverse without pressing the brake pedal can lead to unexpected vehicle behavior, potentially causing accidents or loss of control.",
      "symptoms": [
        "The transmission does not shift from Neutral to Drive or Reverse unless the brake pedal is pressed",
        "despite the seller's claim that it can shift without braking."
      ],
      "odiNumbers": [
        "11432993"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Front Wheel Bearing Failure",
      "impact": "The failure of the front wheel bearings can cause smoke to emanate from the wheel, leading to a loss of vehicle control, increased stopping distance, and potentially causing accidents or fires.",
      "symptoms": [
        "Smoke coming from the front wheel",
        "grinding or screeching noise from the wheel",
        "vibration or shaking of the steering wheel",
        "uneven tire wear",
        "wheel pulling to one side while driving."
      ],
      "odiNumbers": [
        "10350251"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Passenger Side Window Falling Off Track",
      "impact": "The passenger side window falling off its track can cause water intrusion, noise, and reduced visibility, which can lead to accidents or discomfort for the driver and passengers.",
      "symptoms": [
        "The passenger side window falls off its track when the door is shut",
        "the metal flexes and causes the window to fall off its track",
        "the window does not stay in its proper position",
        "water intrusion into the vehicle",
        "noise while driving."
      ],
      "odiNumbers": [
        "10207609"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Door Frame Flexing Causing Window Malfunction",
      "impact": "The flexing of the door frame can cause the window to fall off its track, leading to water intrusion, noise, and reduced visibility, which can lead to accidents or discomfort for the driver and passengers.",
      "symptoms": [
        "The door frame flexes when the door is shut",
        "the window falls off its track",
        "water intrusion into the vehicle",
        "noise while driving."
      ],
      "odiNumbers": [
        "10207609"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}