{
  "totalComplaints": 16,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "STRUCTURE",
    "UNKNOWN OR OTHER",
    "AIR BAGS",
    "FUEL SYSTEM"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Defective Aluminum Corner Panels",
      "impact": "The buckling or flaring of the aluminum corner panels can lead to them peeling off, causing the entire box to shift and bow out, which can result in a loss of structural integrity and potentially cause accidents or injuries.",
      "symptoms": [
        "The aluminum corner panels buckle or flare out from the bottom",
        "peel off",
        "and cause the entire box to shift and bow out."
      ],
      "odiNumbers": [
        "10460376"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Defective Cargo Door Hinges",
      "impact": "The binding of the cargo door hinges can make it difficult or impossible to open the doors, potentially trapping occupants inside the vehicle, which can lead to accidents or injuries.",
      "symptoms": [
        "The cargo door hinges bind",
        "making it difficult or impossible to open the doors",
        "and may require lubrication to operate properly."
      ],
      "odiNumbers": [
        "10429461",
        "10286227"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Intermittent Vehicle Security Light Issue",
      "impact": "The intermittent vehicle security light can cause the vehicle to not start, leaving the driver stranded, which can pose a safety hazard, especially in extreme weather conditions.",
      "symptoms": [
        "The vehicle security light comes on intermittently",
        "the vehicle will not start",
        "the light goes out after 10 minutes",
        "and the vehicle can be started after turning the key to the on position",
        "waiting 10 minutes",
        "turning off the ignition for 10 seconds",
        "and then restarting."
      ],
      "odiNumbers": [
        "11373786"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Defective Roof Bonding in Spartan Cargo Bodies",
      "impact": "The defective bonding of the roof skin to roof rail extrusion and roof rail extrusion to side wall can cause parts of the roof skin or roof to delaminate or dislodge while the vehicle is in operation, posing a risk of death or serious injury to other vehicles or the general public.",
      "symptoms": [
        "None reported",
        "as this is a safety recall notice."
      ],
      "odiNumbers": [
        "10284175"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Front Passenger Airbag Seat Sensor Failure",
      "impact": "The failure of the front passenger airbag seat sensor can prevent the airbag from deploying in the event of an accident, increasing the risk of injury or fatality to the passenger.",
      "symptoms": [
        "The airbag warning light is illuminated",
        "the passenger airbag is not enabled",
        "the airbag does not deploy in an accident",
        "the sensor does not detect the presence of a passenger."
      ],
      "odiNumbers": [
        "10592953"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Dual Airbag System Failure",
      "impact": "The failure of the dual airbag system can prevent the airbags from deploying in the event of an accident, increasing the risk of injury or fatality to the occupants.",
      "symptoms": [
        "The airbag warning light is illuminated",
        "the airbags do not deploy in an accident",
        "the system fails to detect the severity of the crash",
        "the airbags do not deploy despite meeting the deployment threshold."
      ],
      "odiNumbers": [
        "10441629"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Faulty Fuel Gauge Sensor",
      "impact": "A faulty fuel gauge sensor can cause the fuel gauge to read incorrectly, leading to unexpected fuel depletion, engine stalling, and potential safety risks, especially on highways.",
      "symptoms": [
        "Fuel gauge reads incorrectly",
        "fuel gauge does not show accurate fuel level",
        "low fuel light does not come on",
        "engine stalls or fails to start",
        "vehicle loses power while driving."
      ],
      "odiNumbers": [
        "10292562",
        "10254660"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}