{
  "totalComplaints": 11,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "SERVICE BRAKES",
    "ENGINE"
  ],
  "parsedComplaintsResultLength": 4,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Brake Light Switch Failure",
      "impact": "The failure of the rear brake light switch can cause the brake lights to malfunction, leading to increased risk of accidents, particularly rear-end collisions, and potentially causing brake fluid leaks, which can result in loss of brake function.",
      "symptoms": [
        "The brake lights stay on or do not turn on at all",
        "the brake lights malfunction after the bike warms up",
        "the brake lights return to normal function after the bike cools down",
        "brake fluid leaks onto the exhaust pipe."
      ],
      "odiNumbers": [
        "10525555",
        "10434889",
        "10433863"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Brake Light Switch Failure",
      "impact": "The failure of the rear brake light switch can cause the rear brake lights to malfunction, leading to reduced visibility and increased risk of accidents.",
      "symptoms": [
        "Rear brake lights do not illuminate when the brake pedal is applied",
        "rear brake pedal feels soft or spongy",
        "rear brake pedal travels all the way down to the floor",
        "rear brake fluid leaks."
      ],
      "odiNumbers": [
        "10723179",
        "10549005"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Rear Brake System Failure",
      "impact": "The failure of the rear brake system can cause the rear brake to malfunction, leading to reduced stopping power and increased risk of accidents.",
      "symptoms": [
        "Rear brake pedal feels soft or spongy",
        "rear brake pedal travels all the way down to the floor",
        "rear brake fluid leaks",
        "rear brake is unresponsive or fails to engage."
      ],
      "odiNumbers": [
        "10549005"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Compensator Spring Failure",
      "impact": "The failure of the compensator spring can cause an abnormal rumbling noise when starting the vehicle, which can lead to engine damage or failure if left unaddressed.",
      "symptoms": [
        "Abnormal rumbling noise when starting the vehicle",
        "no warning indicators illuminated."
      ],
      "odiNumbers": [
        "11269920"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}