{
  "totalComplaints": 17,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "ENGINE AND ENGINE COOLING",
    "SERVICE BRAKES",
    "FUEL SYSTEM",
    "TIRES"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Insufficient Heat Shielding on Exhaust System",
      "impact": "The inadequate heat shielding on the exhaust system can cause severe burns to the rider's legs, potentially leading to infections and other serious injuries.",
      "symptoms": [
        "Riders experience second-degree burns on their legs when contacting the exhaust pipe juncture",
        "even when wearing protective gear such as ankle-high leather boots. The heat shield provided by Harley-Davidson is insufficient",
        "and the exhaust pipe can reach temperatures of up to 1600-1800 degrees."
      ],
      "odiNumbers": [
        "10350424",
        "10295012",
        "10284116"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Excessive Engine Heat",
      "impact": "Excessive engine heat can cause burns to the rider, damage to clothing, and potentially lead to loss of vehicle control, resulting in accidents and injuries.",
      "symptoms": [
        "Engine oil temperatures reach up to 300 degrees",
        "and infrared temperature readings on the rider's pant leg can reach 140 degrees. Riders may experience burns",
        "and the heat can cause misfires",
        "leading to loss of vehicle control."
      ],
      "odiNumbers": [
        "10295012",
        "10290397"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Anti-Lock Braking System (ABS) Failure",
      "impact": "The failure of the ABS system can cause the brakes to malfunction, leading to loss of control, accidents, or injuries.",
      "symptoms": [
        "The ABS system activates unnecessarily",
        "causing the brakes to fail",
        "the rear brake pedal does not respond",
        "the motorcycle \"free wheels\" when braking",
        "the brakes do not engage even when the pedal is fully depressed."
      ],
      "odiNumbers": [
        "10293507",
        "10289465",
        "10281390"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Rear Brake Failure",
      "impact": "The failure of the rear brakes can cause the motorcycle to lose stopping power, leading to accidents or injuries.",
      "symptoms": [
        "The rear brakes do not properly stop the motorcycle",
        "the rear brake pads wear out prematurely",
        "the rear brakes do not lock up even when the pedal is fully depressed."
      ],
      "odiNumbers": [
        "10289465",
        "10281390"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Inadequate Braking Power",
      "impact": "Inadequate braking power can cause the motorcycle to lose control, leading to accidents or injuries.",
      "symptoms": [
        "The rear brakes lack adequate stopping power",
        "the motorcycle is difficult to stop",
        "the rear brakes do not respond as expected."
      ],
      "odiNumbers": [
        "10281390"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Faulty Fuel Gauge",
      "impact": "A faulty fuel gauge can lead to the rider being unaware of the actual fuel level, potentially causing the bike to run out of fuel, leaving the rider stranded, and potentially causing accidents.",
      "symptoms": [
        "The fuel gauge does not display the correct fuel level",
        "the fuel gauge does not move",
        "the fuel gauge is stuck on a specific level."
      ],
      "odiNumbers": [
        "10416764"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Throttle Sensor and ECM Issues",
      "impact": "The throttle sensor and ECM issues can cause the bike to accelerate on its own, leading to loss of control, accidents, and potentially serious injuries or fatalities.",
      "symptoms": [
        "The bike accelerates on its own",
        "the bike sets twist grip codes P2127 and 2138",
        "the check engine light is illuminated",
        "the bike has a slight or hard acceleration without input from the rider."
      ],
      "odiNumbers": [
        "10250496"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Dunlop 407F Tire Cupping",
      "impact": "The cupping of the Dunlop 407F tires can cause vibration at highway speeds and noise while cornering, leading to a potentially dangerous situation, especially during lane changes or cornering.",
      "symptoms": [
        "Uneven tire tread cupping",
        "vibration during cornering and lane changes",
        "abnormal wear on the bold angled lateral grooves",
        "unevenly worn areas near the bottom of the lateral grooves on the leading edge",
        "cupping on one side of the tire",
        "and normal wear on the center of the tread."
      ],
      "odiNumbers": [
        "10282813",
        "10274692"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}