{
  "totalComplaints": 24,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "POWER TRAIN",
    "STEERING"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Brake Master Cylinder Failure",
      "impact": "The failure of the rear brake master cylinder can cause the brakes to lock up, leading to loss of control, accidents, and injuries.",
      "symptoms": [
        "The rear brake pedal feels soft or spongy",
        "the rear brake pedal sticks to the floor",
        "the rear brake pedal does not return to its normal position",
        "the rear brake pedal has a delayed return to its normal position",
        "the rear brake pedal has a sudden loss of pressure",
        "the vehicle is unable to stop or slows down unexpectedly",
        "burning smell",
        "and high brake temperature."
      ],
      "odiNumbers": [
        "11143673",
        "10894909",
        "10734626",
        "10714004",
        "10653133",
        "10638435",
        "10554631",
        "10550312",
        "10471197",
        "10455819",
        "10449506"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Front Brake Master Cylinder Failure",
      "impact": "The failure of the front brake master cylinder can cause the brakes to wear out prematurely, leading to loss of control, accidents, and injuries.",
      "symptoms": [
        "The front brake pads wear out prematurely",
        "the front brake pedal feels soft or spongy",
        "the front brake pedal sticks to the floor",
        "the front brake pedal does not return to its normal position",
        "the front brake pedal has a delayed return to its normal position",
        "the front brake pedal has a sudden loss of pressure",
        "and the vehicle is unable to stop or slows down unexpectedly."
      ],
      "odiNumbers": [
        "10554631"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Brake Hydraulic System Failure",
      "impact": "The failure of the brake hydraulic system can cause the brakes to fail, leading to loss of control, accidents, and injuries.",
      "symptoms": [
        "The brakes feel soft or spongy",
        "the brakes stick to the floor",
        "the brakes do not return to their normal position",
        "the brakes have a delayed return to their normal position",
        "the brakes have a sudden loss of pressure",
        "the vehicle is unable to stop or slows down unexpectedly",
        "and burning smell."
      ],
      "odiNumbers": [
        "10471197",
        "10455819"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Slipping and Shifting Issues",
      "impact": "The transmission slipping and shifting issues can cause the vehicle to lose power, leading to a loss of control, accidents, or stranding the rider on the highway.",
      "symptoms": [
        "The transmission slips out of gear",
        "the transmission shifts gears independently",
        "the clutch makes a rattling sound when out of gear",
        "the transmission tries to slip back out of gear when shifted back into gear",
        "unexpected engine RPM changes."
      ],
      "odiNumbers": [
        "10851545",
        "10839912",
        "10451896",
        "10450035"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Deceleration Wobble",
      "impact": "The deceleration wobble can cause the motorcycle to become unstable, making it difficult to control, which can lead to accidents or loss of control.",
      "symptoms": [
        "The handlebars shake or wobble violently upon deceleration",
        "typically between 35-45 mph",
        "requiring both hands to be kept on the handlebars to avoid a crash",
        "and the wobble increases if one hand is let go. The wobble can also cause discomfort",
        "especially when going around corners",
        "and may contribute to increased wear on the front tire and damage to other components."
      ],
      "odiNumbers": [
        "10610589",
        "10481303",
        "10458538"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Handlebar Overheating",
      "impact": "The overheating of the handlebar grips can cause discomfort and potentially lead to loss of control, as the rider may be unable to maintain a secure grip on the handlebars.",
      "symptoms": [
        "The handlebar grips become extremely hot",
        "making it difficult or impossible to continue driving."
      ],
      "odiNumbers": [
        "10404165"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}