{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "ENGINE AND ENGINE COOLING",
    "ENGINE",
    "UNKNOWN OR OTHER",
    "SERVICE BRAKES",
    "ELECTRICAL SYSTEM"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Excessive Heat from Exhaust System",
      "impact": "The excessive heat from the exhaust system can cause severe burns to the rider's and passenger's legs, resulting in painful blistering, scarring, and potential infection. This can make riding impossible and poses a significant risk to safety.",
      "symptoms": [
        "Severe burns to the right thigh",
        "knee",
        "and calf",
        "painful blistering of the skin",
        "scarring",
        "and inability to ride due to burns."
      ],
      "odiNumbers": [
        "10432972",
        "10421848",
        "10325600"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Excessive Engine and Exhaust Heat",
      "impact": "The excessive heat generated by the engine and exhaust system can cause burns to drivers and passengers, and potentially lead to fires or other safety hazards.",
      "symptoms": [
        "Excessive heat emanating from the engine and exhaust system",
        "burning sensation or actual burns on skin or clothing",
        "overwhelming heat while driving or riding in the vehicle."
      ],
      "odiNumbers": [
        "10713538"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Inadequate Manufacturer Response",
      "impact": "The manufacturer's failure to acknowledge and address the issue can lead to continued safety risks for drivers and passengers, and may result in further incidents or accidents.",
      "symptoms": [
        "Manufacturer denies or downplays the existence of a problem",
        "fails to provide adequate support or solutions",
        "or attempts to dismiss or ignore customer complaints."
      ],
      "odiNumbers": [
        "10713538"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Insufficient Rear Brake Performance",
      "impact": "The inadequate rear brake performance can lead to accidents, injuries, and property damage, as the vehicle may not be able to stop in a timely manner, especially in emergency situations.",
      "symptoms": [
        "Rear brakes do not lock up or provide sufficient stopping power",
        "squealing or unusual noises when applying the brakes",
        "difficulty stopping the vehicle",
        "especially when carrying heavy loads or at high speeds."
      ],
      "odiNumbers": [
        "10362084"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unintended Reverse Gear Engagement",
      "impact": "The sudden and unintended engagement of the reverse gear while the vehicle is in motion can cause loss of control, accidents, and serious injuries or fatalities.",
      "symptoms": [
        "The vehicle suddenly experiences a tremendous drag or resistance",
        "the vehicle slows down or stalls",
        "the vehicle veers into oncoming traffic or off the road",
        "the rider or passenger is thrown off the vehicle."
      ],
      "odiNumbers": [
        "10342784"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}