{
  "totalComplaints": 35,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "STEERING",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Hesitation and Jerking",
      "impact": "The transmission hesitation and jerking can cause the vehicle to stall or lose power, leading to accidents or leaving the driver stranded. This issue can also cause hesitation when merging onto highways or accelerating from a stop, increasing the risk of accidents.",
      "symptoms": [
        "The transmission hesitates or jerks when accelerating",
        "slowing down",
        "or shifting gears; the vehicle stalls or loses power; the transmission takes a long time to downshift; the vehicle hesitates when merging onto highways or accelerating from a stop; the transmission slips or hesitates when climbing hills."
      ],
      "odiNumbers": [
        "11378150",
        "11353083",
        "11129723",
        "11065789",
        "10894472",
        "10820473",
        "10744921",
        "10628579",
        "10573299",
        "10568960",
        "10543962",
        "10488826",
        "10480192",
        "10460603",
        "10458945",
        "10427671"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Steering Wheel Rubbing Against Plastic Housing",
      "impact": "The rubbing of the steering wheel against the plastic housing can cause the steering wheel to become nearly impossible to steer, leading to a potential loss of control and increased risk of accidents.",
      "symptoms": [
        "The plastic cover that covers the steering wheel's rod cracks open when the steering wheel is tilted to a lower position",
        "causing the steering wheel to rub against the plastic behind it",
        "making the steering wheel difficult to steer."
      ],
      "odiNumbers": [
        "11311765"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "4WAS Motor Failure",
      "impact": "The failure of the 4WAS motor can cause the vehicle to jerk and become unstable, leading to a loss of control and increased risk of accidents. Additionally, the failure of the 4WAS motor can disable various safety features, including intelligent cruise control, blind spot detection, lane departure, stability control, and sport mode.",
      "symptoms": [
        "The vehicle jerks and becomes unstable",
        "the 4WAS warning light comes on",
        "the rear of the vehicle sways and jerks",
        "the steering wheel is off-center",
        "and the vehicle drifts in one direction."
      ],
      "odiNumbers": [
        "11206987",
        "11164711"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Steering Wheel Locking",
      "impact": "The sudden locking of the steering wheel can cause the driver to lose control of the vehicle, leading to a potential accident.",
      "symptoms": [
        "The steering wheel locks without warning",
        "making it difficult or impossible to steer the vehicle."
      ],
      "odiNumbers": [
        "11071733"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Steering Defect",
      "impact": "The steering defect can cause the vehicle to veer from side to side, making it difficult to control and increasing the risk of accidents, especially on narrow roads or in adverse weather conditions.",
      "symptoms": [
        "The vehicle veers from side to side",
        "requiring constant course corrections",
        "and is difficult to control",
        "especially on imperfect roads or in adverse weather conditions."
      ],
      "odiNumbers": [
        "10556106",
        "10379638"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Poor Quality Leather and Vinyl in Interior Components",
      "impact": "The use of poor quality leather and vinyl in interior components can lead to premature cracking and deterioration, affecting the overall appearance and durability of the vehicle's interior.",
      "symptoms": [
        "Cracking of leather and vinyl on door panels",
        "center console",
        "and seats",
        "premature wear and tear",
        "and deterioration of interior components."
      ],
      "odiNumbers": [
        "11183705",
        "11183706",
        "10958403"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}