{
  "totalComplaints": 21,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "AIR BAGS",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Electrical System Failure",
      "impact": "The failure of the electrical system can cause the vehicle to lose power, leading to accidents or injuries.",
      "symptoms": [
        "The vehicle randomly loses electrical power",
        "lights",
        "door locks",
        "and other electrical systems; the engine upshifts into second or third gear without driver input; the electronics go crazy",
        "causing a huge safety issue."
      ],
      "odiNumbers": [
        "11315838",
        "11024990",
        "10671762"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Engine Stalling and Low Power Mode",
      "impact": "The engine stalling and low power mode can cause the vehicle to lose power, leading to accidents or injuries.",
      "symptoms": [
        "The engine cuts off or goes into low power mode; the vehicle loses power while driving; the oil pressure sensor check engine light comes on; the low oil pressure message appears",
        "stating to shut off the engine."
      ],
      "odiNumbers": [
        "11269759"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Brake System Failure",
      "impact": "The failure of the brake system can cause the vehicle to accelerate instead of brake, leading to accidents or injuries.",
      "symptoms": [
        "The brakes are applied",
        "but the vehicle accelerates instead; the vehicle is unable to stop",
        "leading to crashes."
      ],
      "odiNumbers": [
        "10503189"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Door Locking System Failure",
      "impact": "The failure of the door locking system can cause the vehicle to randomly lock or unlock while parked or moving, creating a serious safety concern.",
      "symptoms": [
        "The vehicle randomly locks or unlocks while parked or moving; the door locks fail to function properly."
      ],
      "odiNumbers": [
        "10497630"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Ignition Switch Failure",
      "impact": "The failure of the ignition switch can cause the key to be removed from the ignition switch while the vehicle is in motion, leading to accidents or injuries.",
      "symptoms": [
        "The key can be removed from the ignition switch while the vehicle is in motion."
      ],
      "odiNumbers": [
        "10766400"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Airbag Warning Light Illumination and Recall Repair Delays",
      "impact": "The illumination of the airbag warning light can indicate a potential failure of the airbag system, which can increase the risk of injury or fatality in the event of a crash. Delays in recall repair can exacerbate this risk.",
      "symptoms": [
        "The airbag warning light is illuminated on the dashboard",
        "intermittent airbag warning light illumination",
        "inability to repair recalled airbag components due to part unavailability."
      ],
      "odiNumbers": [
        "11424063",
        "11404061",
        "10489117"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Dash Pad Lifting and Potential Airbag Issues",
      "impact": "The lifting of the dash pad can be a sign of a more serious underlying issue with the airbag system, which can increase the risk of injury or fatality in the event of a crash.",
      "symptoms": [
        "The dash pad is lifting or separating from the dashboard",
        "airbag warning light illumination",
        "potential airbag system failure."
      ],
      "odiNumbers": [
        "10489117"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Dashboard Cracking",
      "impact": "The cracking of the dashboard can lead to a hazardous situation for occupants, as sharp edges and broken pieces can cause injuries. Additionally, the cracking can also compromise the structural integrity of the dashboard, potentially affecting the deployment of airbags and other safety features.",
      "symptoms": [
        "Cracks appear on the dashboard",
        "often in multiple locations",
        "and can spread over time. The cracks can be small and hairline or large and deep",
        "and may be accompanied by a rough or brittle texture."
      ],
      "odiNumbers": [
        "11377143",
        "11123212"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}