{
  "totalComplaints": 14,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "VISIBILITY/WIPER",
    "STRUCTURE",
    "UNKNOWN OR OTHER",
    "STEERING"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Windshield Seal Failure",
      "impact": "The failure of the windshield seal can cause water to leak into the vehicle, affecting visibility and safety while driving, and potentially leading to airbag deployment issues.",
      "symptoms": [
        "Water drips or streaks on the inside of the windshield",
        "water pouring down onto the dashboard",
        "instrument cluster",
        "steering wheel",
        "and airbag",
        "reduced visibility while driving",
        "need to wipe and dry the windshield to maintain visibility."
      ],
      "odiNumbers": [
        "11442748",
        "10969292"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Windshield Bonding Issue",
      "impact": "The poor bonding of the windshield can cause it to move or detach during airbag deployment, compromising passenger safety and potentially leading to ejection from the vehicle.",
      "symptoms": [
        "Water streaking or dripping on the inside of the windshield",
        "windshield movement when pushed from the inside",
        "little resistance to movement",
        "potential airbag deployment issues."
      ],
      "odiNumbers": [
        "10969292"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Inadequate Windshield Wiper Performance",
      "impact": "The inadequate performance of the windshield wipers can reduce visibility during moderate to heavy rain, affecting vehicle safety and operation.",
      "symptoms": [
        "Windshield wipers unable to keep up with moderate to heavy rain",
        "reduced visibility while driving",
        "need to pull over or slow down to maintain safety."
      ],
      "odiNumbers": [
        "10492325"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Front Passenger Door Latch Failure",
      "impact": "The failure of the front passenger door latch can cause the door to open while driving, posing a significant risk to the safety of the occupants and other road users.",
      "symptoms": [
        "The front passenger door unlatches and opens slightly while driving",
        "the automatic locking system signals that the door is open",
        "the door handle is locked when inspected."
      ],
      "odiNumbers": [
        "11362518"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Windshield Seal Failure",
      "impact": "The failure of the windshield seal can cause water intrusion into the vehicle, reducing visibility and increasing the risk of accidents. Additionally, a compromised windshield seal can compromise the structural integrity of the windshield in the event of a front-end collision.",
      "symptoms": [
        "Water enters the vehicle through the windshield",
        "the windshield becomes unsecured",
        "the windshield separates from the frame along the top edge."
      ],
      "odiNumbers": [
        "11291627",
        "11053749"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Windshield Seal Failure",
      "impact": "The failure of the windshield seal can cause water to leak into the vehicle, leading to corrosive damage, safety hazards, and potentially costly repairs. Water intrusion can also compromise the vehicle's electrical systems, mechanical components, and interior materials, posing a risk to driver and passenger safety.",
      "symptoms": [
        "Water leaks into the vehicle",
        "typically through the top passenger side of the windshield",
        "causing water to accumulate on the floorboard",
        "seats",
        "and gear shifting mechanism. The windshield seal can be pushed in from the inside",
        "revealing a gap."
      ],
      "odiNumbers": [
        "11382865",
        "10968345"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Steering System Malfunction",
      "impact": "The malfunctioning steering system can cause the vehicle to lose control, leading to accidents or near-misses, especially on worn or grooved road surfaces.",
      "symptoms": [
        "The steering wheel sticks or hesitates",
        "making it difficult to turn; the vehicle wants to \"climb or steer\" into the high side of longitudinal grooves on the driving surface; considerable force is required to maintain control; the vehicle may drift or pull to one side."
      ],
      "odiNumbers": [
        "11318336",
        "10883457"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}