{
  "totalComplaints": 26,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ENGINE",
    "FUEL/PROPULSION SYSTEM",
    "ELECTRICAL SYSTEM"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Excessive Heat Generation",
      "impact": "The excessive heat generation can cause discomfort, burns, and potentially lead to fires, which can result in accidents, injuries, or fatalities.",
      "symptoms": [
        "The vehicle runs hot",
        "gas remaining in the tank is boiling",
        "steam blows out when refilling gas",
        "extreme heat can be felt on legs and feet",
        "heat builds up under fiberglass panels",
        "gas cap becomes too hot to touch",
        "radiator fan blows very hot air",
        "strong odor of raw gas",
        "overpowering gas fumes",
        "and air flow from the engine blows severely hot air onto the driver's crotch area."
      ],
      "odiNumbers": [
        "11551344",
        "10628314",
        "10620886",
        "10587401",
        "10587190",
        "10574592",
        "10549140",
        "10542059",
        "10541929"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Lack of Heat Dissipation",
      "impact": "The lack of heat dissipation can cause overheating, which can lead to engine damage, component failure, and potentially cause fires, resulting in accidents, injuries, or fatalities.",
      "symptoms": [
        "Heat trapped under plastic paneling when at low speeds or when the vehicle is stopped",
        "affecting other components",
        "such as the evaporator canister",
        "and rendering the vehicle unsafe."
      ],
      "odiNumbers": [
        "10587401",
        "10587190",
        "10541929"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Excessive Heat and Fuel Vapor Issues",
      "impact": "The excessive heat generated by the catalytic converter can cause the fuel in the tank to boil, leading to strong gas smells, difficulty filling the tank, and potential fires. This can pose a significant risk to the rider and others nearby.",
      "symptoms": [
        "Strong gas smell after riding",
        "heat around the seat and leg area",
        "difficulty filling the gas tank",
        "gas fumes when turning off the engine",
        "hot gas cap",
        "and excessive heat coming from the catalytic converter."
      ],
      "odiNumbers": [
        "10628178",
        "10627768",
        "10621062",
        "10616846"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inadequate Heat Shielding and Insulation",
      "impact": "The lack of adequate heat shielding and insulation can cause the bodywork around the leg and engine area to become extremely hot, making it uncomfortable and potentially dangerous for the rider.",
      "symptoms": [
        "Hot bodywork around the leg and engine area",
        "need for additional heat-resistant insulation to ride safely."
      ],
      "odiNumbers": [
        "10621062",
        "10616846"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Inadequate Manufacturer Response and Warranty Coverage",
      "impact": "The manufacturer's inadequate response to these issues and limited warranty coverage can leave riders without a solution, forcing them to take matters into their own hands and potentially putting themselves at risk.",
      "symptoms": [
        "Manufacturer's denial of the issue or lack of assistance",
        "limited warranty coverage",
        "and riders being forced to pay for repairs or modifications out of pocket."
      ],
      "odiNumbers": [
        "10621062",
        "10616846"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Left Handle Bar Control Switch Failure",
      "impact": "The failure of the left handle bar control switch can cause the turn signal to malfunction, leading to a safety risk as the driver needs to look down to check if the signal is off, taking their attention away from the road.",
      "symptoms": [
        "The left turn signal does not work",
        "the right turn signal cuts off after changing lanes",
        "the driver needs to look down to check if the signal is off."
      ],
      "odiNumbers": [
        "11458721"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Engine Oil Leak/Fire Hazard",
      "impact": "The engine oil leak can cause a fire hazard, which can lead to a serious accident or injury.",
      "symptoms": [
        "Dark black smoke coming out of the air intakes",
        "thick smoke while riding",
        "normal temperature range",
        "no stains on the garage floor after checking."
      ],
      "odiNumbers": [
        "11364201"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Check Engine Warning Indicator Malfunction",
      "impact": "The malfunctioning check engine warning indicator can be distracting to the driver, taking their attention away from the road and increasing the risk of an accident.",
      "symptoms": [
        "The check engine warning indicator illuminates in a bright orange color",
        "the indicator cannot be removed from the screen without turning off the vehicle and removing the key."
      ],
      "odiNumbers": [
        "10622081"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}