{
  "totalComplaints": 10,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "SUSPENSION",
    "POWER TRAIN",
    "ENGINE",
    "STRUCTURE"
  ],
  "parsedComplaintsResultLength": 9,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Refusal of Recall Due to Aftermarket Modifications",
      "impact": "The refusal of the dealership to perform the recall due to aftermarket modifications can lead to potential safety and performance issues, as the vehicle may not meet emissions standards.",
      "symptoms": [
        "The dealership refuses to perform the recall",
        "citing aftermarket modifications as the reason."
      ],
      "odiNumbers": [
        "11492177"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Sticking Horn Due to Worn \"O\" Rings",
      "impact": "The sticking horn can cause a distraction to the driver and other vehicles on the road, potentially leading to accidents.",
      "symptoms": [
        "The horn sticks and remains on for an extended period",
        "usually around 1 minute",
        "and can be triggered by certain events such as stopping at a stop sign."
      ],
      "odiNumbers": [
        "11054496"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Delayed or Unavailable Parts for Safety Recall 21V-679",
      "impact": "The delay or unavailability of parts for safety recall 21V-679 can lead to prolonged exposure to potential safety risks, including control arm mount failure on the rear suspension, which can affect vehicle stability and increase the risk of accidents.",
      "symptoms": [
        "The consumer receives a letter stating that parts are available",
        "but the dealer denies having the parts",
        "or the parts are unavailable for an extended period."
      ],
      "odiNumbers": [
        "11468315",
        "11455964"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Connection Bushing Failure",
      "impact": "The failure of the transmission connection bushing can cause the vehicle to roll when stopped, even when the transmission is in 'park', which can lead to accidents or injuries.",
      "symptoms": [
        "The vehicle rolls when stopped",
        "even when the transmission is in 'park'."
      ],
      "odiNumbers": [
        "11281902"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Vacuum Pump Failure",
      "impact": "The failure of the vacuum pump can cause the loss of power brakes, leading to extended stopping distances and increased risk of accidents.",
      "symptoms": [
        "Loss of power brakes",
        "extended stopping distances",
        "inability to stop in a timely manner."
      ],
      "odiNumbers": [
        "10899246"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rodent Damage to Wiring",
      "impact": "Rodent damage to wiring can cause electrical system failures, leading to faulty engine control systems, and potentially resulting in engine stalling, loss of power, or even accidents.",
      "symptoms": [
        "Dashboard warnings",
        "such as \"Fault of the Engine Control System\" or a yellow engine icon",
        "may appear. The vehicle may not start or may stall",
        "and the engine may lose power."
      ],
      "odiNumbers": [
        "10956470"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Engine Control System Failure",
      "impact": "Engine control system failure can cause the engine to stall or lose power, leading to accidents or leaving the driver stranded.",
      "symptoms": [
        "Dashboard warnings",
        "such as \"Fault of the Engine Control System\" or a yellow engine icon",
        "may appear. The vehicle may not start or may stall",
        "and the engine may lose power."
      ],
      "odiNumbers": [
        "10548514"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unexpected Engine Shut-Off with Auto Stop Feature",
      "impact": "The unexpected shut-off of the engine can cause the vehicle to lose power and potentially lead to accidents, especially in situations where the driver needs to maintain control of the vehicle, such as in heavy traffic or when approaching a crosswalk.",
      "symptoms": [
        "The engine shuts off unexpectedly",
        "the tachometer goes to zero",
        "the vehicle loses power",
        "and the accelerator pedal may cause the vehicle to lurch forward when pressed."
      ],
      "odiNumbers": [
        "10522174"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Exposed Tailpipe Causes Burns",
      "impact": "The exposed tailpipe can cause burns to drivers or passengers when they attempt to open the rear trunk, which can lead to injuries and potentially long-term health consequences.",
      "symptoms": [
        "The tailpipe is too long and extends too far from the bumper",
        "causing it to come into contact with the driver's or passenger's leg when opening the rear trunk",
        "resulting in burns."
      ],
      "odiNumbers": [
        "10511049"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}