{
  "totalComplaints": 14,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "STEERING",
    "VISIBILITY/WIPER",
    "SEATS"
  ],
  "parsedComplaintsResultLength": 4,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Intermittent Notchy Steering Feel at Highway Speeds",
      "impact": "The intermittent notchy steering feel can cause the vehicle to veer to the left or right, requiring quick correction, which can lead to accidents or loss of control.",
      "symptoms": [
        "The steering exhibits an intermittent non-binding",
        "notchy feeling",
        "the steering wheel does not self-center",
        "the vehicle veers to the left or right",
        "and requires quick correction."
      ],
      "odiNumbers": [
        "11510368",
        "11414773"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Windshield Wiper Failure",
      "impact": "The failure of the windshield wiper system can cause reduced visibility while driving, leading to accidents or near-misses, especially during heavy rain or extreme weather conditions.",
      "symptoms": [
        "Wiper blades get stuck in the up position",
        "do not work",
        "or malfunction",
        "blocking the windshield's view; wiper blades can get stuck in any position while wiping; rain sensor does not pick up rain at low",
        "medium",
        "or heavy rain and does not engage the wipers."
      ],
      "odiNumbers": [
        "11459058",
        "11362718"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Sunroof Explosion",
      "impact": "The sudden explosion of the sunroof can cause shards of glass to fall into the cabin, potentially injuring occupants or distracting the driver, leading to accidents or loss of control.",
      "symptoms": [
        "Loud explosion or gunshot-like sound from the sunroof area; sunroof glass shatters or explodes",
        "leaving a hole or fractured pieces; no apparent external cause or damage to the surrounding area."
      ],
      "odiNumbers": [
        "10927496"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Seat Heater Failure and Cracking",
      "impact": "The failure of the seat heater can cause burns to the skin, discomfort, and distraction while driving, which can lead to accidents.",
      "symptoms": [
        "The seat develops cracks",
        "a burning sensation is felt on the skin when using the seat heater",
        "the seat heater emits a burning smell",
        "the seat heater malfunctions",
        "and the seat material deteriorates."
      ],
      "odiNumbers": [
        "11591442"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}