{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "ENGINE",
    "SUSPENSION",
    "ENGINE AND ENGINE COOLING",
    "FUEL/PROPULSION SYSTEM"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Brake Rotor Warping",
      "impact": "Warped rear brake rotors can cause the brakes to lock up, leading to sudden slowing or loss of control, which can result in accidents or near-misses.",
      "symptoms": [
        "Rear brake rotor warping",
        "brake shuttering or vibrating when using the rear brakes",
        "brake pads wearing out prematurely."
      ],
      "odiNumbers": [
        "10893351"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Brake Fluid Leaks and Premature Brake Pad Wear",
      "impact": "Brake fluid leaks can cause brake pads to wear out prematurely, leading to reduced braking performance and increased risk of accidents.",
      "symptoms": [
        "Brake pads need to be replaced frequently",
        "brake fluid leaking onto brake pads and wheels",
        "poor gas mileage."
      ],
      "odiNumbers": [
        "10550202"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Low-Speed Stalling and Hesitation",
      "impact": "The stalling and hesitation of the motorcycle at low speeds can cause loss of control, accidents, and potentially lead to injuries or fatalities, especially when riding a heavy vehicle.",
      "symptoms": [
        "The motorcycle stalls or hesitates when accelerating from a low speed (1-10 mph)",
        "often requiring the rider to engage the clutch and throttle to regain power; the issue is more frequent when the engine is cold or after a short stop; the motorcycle may surge forward rapidly after hesitating."
      ],
      "odiNumbers": [
        "10781852",
        "10512486"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Anti-Dive Device Failure",
      "impact": "The failure of the anti-dive device can cause the motorcycle to experience uneven handling, leading to a loss of control, accidents, or injuries, especially during braking or sudden maneuvers.",
      "symptoms": [
        "The motorcycle experiences bumps or jolts while riding",
        "especially during braking or sudden turns",
        "the front end of the motorcycle dives or drops excessively",
        "the motorcycle's handling feels unstable or unresponsive."
      ],
      "odiNumbers": [
        "11535313"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Engine Stuttering and Stalling at Low Speeds",
      "impact": "The engine stuttering and stalling at low speeds can cause the vehicle to lose forward momentum, leading to a loss of control and potentially resulting in accidents or injuries.",
      "symptoms": [
        "The engine stutters or hesitates",
        "the engine stalls",
        "the vehicle is unable to maintain forward momentum",
        "the vehicle requires emergency action to regain control",
        "such as quickly disengaging the clutch to coast to a safe stop."
      ],
      "odiNumbers": [
        "10681256"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Engine Stalling While Warming Up",
      "impact": "The engine stalling while warming up can cause the motorcycle to lose power and potentially crash, especially if the rider is in the middle of a turn, which can lead to accidents and injuries.",
      "symptoms": [
        "The engine stalls while the motorcycle is being ridden during the warm-up period",
        "requiring the rider to pull the clutch to regain control",
        "the motorcycle loses power",
        "the motorcycle crashes if the stall occurs during a turn."
      ],
      "odiNumbers": [
        "10670092"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}