{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "ENGINE",
    "FUEL/PROPULSION SYSTEM",
    "STRUCTURE",
    "POWER TRAIN",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Engine Compartment Fire",
      "impact": "An engine compartment fire can cause significant damage to the vehicle, potentially leading to a total loss, and poses a risk to the safety of people and property nearby.",
      "symptoms": [
        "The vehicle catches fire while parked and unoccupied",
        "with the fire originating in the engine compartment."
      ],
      "odiNumbers": [
        "11252907",
        "11252912"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Fuel Tank Cracking and Leaking",
      "impact": "Cracking and leaking of the fuel tank can cause fuel to spill onto the road, creating a fire hazard and potentially leading to accidents or injuries. Additionally, repeated replacements of the fuel tank can be costly and inconvenient for the vehicle owner.",
      "symptoms": [
        "Fuel leaks",
        "fuel tank cracking",
        "fuel smell or odor",
        "fuel puddles under the vehicle."
      ],
      "odiNumbers": [
        "10881909",
        "10860895"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Front Cap Separation",
      "impact": "The separation of the front cap from the structure can cause structural integrity issues, potentially leading to accidents or injuries, and may also lead to water ingress and damage to the interior of the motorhome.",
      "symptoms": [
        "The front cap is separating from the structure",
        "visible gaps or cracks between the front cap and the motorhome's body",
        "water leaks or water damage inside the motorhome."
      ],
      "odiNumbers": [
        "11539737"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Transmission Coolant Line Fitting Failure",
      "impact": "The sudden failure of the transmission coolant line fitting can cause a loss of transmission fluid, leading to a potential fire hazard, and sudden disablement of the vehicle, which can increase the risk of accidents, especially on high-traffic roads.",
      "symptoms": [
        "Large volumes of smoke coming from the vehicle",
        "transmission fluid leaking onto the hot exhaust and underneath the vehicle",
        "sudden loss of vehicle mobility",
        "potential fire hazard."
      ],
      "odiNumbers": [
        "11220902"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Brake Master Cylinder Failure",
      "impact": "The failure of the brake master cylinder can cause the brake pedal to suddenly drop to the floor, leading to a loss of braking ability, which can result in accidents or injuries.",
      "symptoms": [
        "The brake pedal feels soft or spongy",
        "the brake pedal suddenly drops to the floor",
        "the brake pedal does not return to its normal position",
        "the vehicle's message center displays a \"Low Brake Fluid\" warning."
      ],
      "odiNumbers": [
        "10837547"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Relief Valve Failure in Brake Master Cylinder",
      "impact": "The failure of the relief valve in the brake master cylinder can cause the brake pedal to suddenly drop to the floor, leading to a loss of braking ability, which can result in accidents or injuries.",
      "symptoms": [
        "The brake pedal feels soft or spongy",
        "the brake pedal suddenly drops to the floor",
        "the brake pedal does not return to its normal position",
        "the vehicle's message center displays a \"Low Brake Fluid\" warning."
      ],
      "odiNumbers": [
        "10837547"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}