{
  "totalComplaints": 11,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "STRUCTURE",
    "AIR BAGS"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Air Conditioner Failure",
      "impact": "The failure of the rear air conditioner can cause discomfort, heat stress, and potentially life-threatening situations, especially for vulnerable passengers such as young children.",
      "symptoms": [
        "Little to no air coming out of the rear air vents",
        "rear air conditioner will not cool",
        "temperature inside the vehicle reaches extreme levels (e.g.",
        "104°F) even with the AC running on its highest setting in the front of the vehicle."
      ],
      "odiNumbers": [
        "11389860",
        "11327129",
        "11265316"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Rear AC Blower Motor Failure",
      "impact": "The failure of the rear AC blower motor can cause the rear air conditioner to malfunction, leading to discomfort, heat stress, and potentially life-threatening situations.",
      "symptoms": [
        "The rear AC blower motor dies",
        "little to no air coming out of the rear air vents",
        "rear air conditioner will not cool."
      ],
      "odiNumbers": [
        "11327129"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Dash Light Reflection on Driver Side Window",
      "impact": "The reflection of dash lights on the driver's left-side window can cause distraction, reduce visibility, and increase the risk of accidents, especially at night.",
      "symptoms": [
        "Dash lights reflect on the driver's left-side window",
        "interfering with the ability to see images in the left driver-side rearview mirror at night",
        "even when turning down the intensity of the dash lights."
      ],
      "odiNumbers": [
        "10638925"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Frozen Door Handle Linkage",
      "impact": "The frozen door handle linkage can cause the door handles to become non-operable, making it difficult or impossible to enter or exit the vehicle, which can be a safety concern, especially in emergency situations.",
      "symptoms": [
        "The door handles are non-operable",
        "the door handles must be banged hard to open or close",
        "the door handles are stuck",
        "the door handles are frozen."
      ],
      "odiNumbers": [
        "10680689"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inaccurate GPS System",
      "impact": "The inaccurate GPS system can cause the vehicle to be driven on roads with low clearance, which can lead to accidents or damage to the vehicle, especially for vehicles with high profiles.",
      "symptoms": [
        "The GPS system provides incorrect or misleading directions",
        "the GPS system fails to account for vehicle height",
        "the GPS system leads to near-miss accidents or close calls."
      ],
      "odiNumbers": [
        "10670485"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Brake System Failure",
      "impact": "The failure of the brake system can lead to increased stopping distances, which can cause accidents, injuries, or fatalities, especially in situations where sudden stops are necessary.",
      "symptoms": [
        "The vehicle takes a longer distance than normal to stop",
        "the brake pedal feels soft or spongy",
        "the brake pedal travels further than usual before the brakes engage",
        "the vehicle does not stop in time to avoid a collision."
      ],
      "odiNumbers": [
        "11071653"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Airbag System Failure",
      "impact": "The failure of the airbag system can lead to increased risk of injury or fatality in the event of a collision, as the airbag may not deploy to protect the occupants.",
      "symptoms": [
        "The airbag does not deploy in a collision",
        "the airbag warning light is illuminated on the dashboard",
        "the airbag system malfunctions or fails to function properly."
      ],
      "odiNumbers": [
        "11071653"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}