{
  "totalComplaints": 42,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "EXTERIOR LIGHTING",
    "AIR BAGS",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Headlight Malfunction",
      "impact": "The malfunctioning headlights can cause reduced visibility, accidents, and pose a significant safety risk to the driver and others on the road.",
      "symptoms": [
        "Headlights flicker",
        "turn off",
        "or point in the wrong direction",
        "reducing visibility and making it difficult to drive at night. The issue is often intermittent",
        "making it challenging to diagnose and repair."
      ],
      "odiNumbers": [
        "11550392",
        "11548206",
        "11537695",
        "11476321",
        "11352359",
        "11344304",
        "11221039",
        "11082681",
        "11078287",
        "10906375",
        "10865345",
        "10862289",
        "10747835"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Auto Headlight System Failure",
      "impact": "The failure of the auto headlight system can cause the headlights to shut off or malfunction, leading to reduced visibility and increased risk of accidents.",
      "symptoms": [
        "Headlights shut off or flicker while driving",
        "especially when using the turn signal or in low-light conditions. The issue is often intermittent and difficult to diagnose."
      ],
      "odiNumbers": [
        "11352359",
        "11221039",
        "10865345",
        "10862289"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "LED Progressive Lighting System Failure",
      "impact": "The failure of the LED progressive lighting system can cause reduced visibility, making it difficult to drive at night and increasing the risk of accidents.",
      "symptoms": [
        "Headlights only illuminate a short distance in front of the vehicle",
        "making it difficult to see the road ahead."
      ],
      "odiNumbers": [
        "11082681"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Dash Cover Defect",
      "impact": "The dash cover defect can cause the passenger airbag to malfunction, and the headlights to flash or shut off, leading to reduced visibility and increased risk of accidents.",
      "symptoms": [
        "The dash cover adhesive and securement come loose",
        "impeding the proper deployment of the passenger airbag and interfering with the proper function of the headlights."
      ],
      "odiNumbers": [
        "11476321"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Airbag Sensor Failure",
      "impact": "The failure of the airbag sensor can cause the airbag to not deploy in an accident, leading to serious injuries or death.",
      "symptoms": [
        "The front passenger seat belt light remains on even when the passenger is seated with the belt on",
        "indicating a failure of the airbag sensor."
      ],
      "odiNumbers": [
        "11534049"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Warped Dashboard Interfering with Airbag Deployment",
      "impact": "The warped dashboard can interfere with the deployment of the passenger-side airbag, leading to serious injuries or death in an accident.",
      "symptoms": [
        "The top dash from the driver to passenger side has warped and pulled back",
        "causing concern for airbag deployment and safety."
      ],
      "odiNumbers": [
        "11500196",
        "11497510",
        "11495350",
        "11490823",
        "11490888",
        "11483896",
        "11480038",
        "11479398"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Airbag Warning Light Malfunction",
      "impact": "The malfunctioning airbag warning light can cause uncertainty about the airbag system's functionality, leading to concerns about safety in an accident.",
      "symptoms": [
        "The driver's airbag warning light comes on for no reason",
        "sometimes while the vehicle is in motion",
        "indicating a potential problem with the airbag system."
      ],
      "odiNumbers": [
        "10735357"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Unavailability of Recall Repair Parts for Hydraulic Brake System",
      "impact": "The unavailability of recall repair parts for the hydraulic brake system can lead to delayed repairs, potentially causing accidents or injuries due to faulty brakes.",
      "symptoms": [
        "None reported",
        "as the issue is related to the unavailability of parts for a recall repair."
      ],
      "odiNumbers": [
        "11584680",
        "11583905",
        "11581992",
        "11581097",
        "11574728",
        "11561340"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}