{
  "totalComplaints": 10,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "ENGINE",
    "UNKNOWN OR OTHER",
    "POWER TRAIN",
    "ELECTRICAL SYSTEM"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Cam Chain Tensioner Failure",
      "impact": "The failure of the cam chain tensioner can cause metal on metal contact, leading to engine damage, oil contamination, and potentially blocking the oil filter, which can result in engine failure, injury, or even death.",
      "symptoms": [
        "Sudden onset of loud cam chain/cam chain tensioner noise",
        "metal on metal contact",
        "engine oil contaminated with metal filings",
        "abnormal noise coming from the timing chain of the tensioner."
      ],
      "odiNumbers": [
        "10735572",
        "10715704",
        "10701688"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Clutch Basket Failure",
      "impact": "The failure of the clutch basket can cause the clutch to malfunction, making it difficult or impossible to shift gears, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "Clutch basket failure",
        "clutch malfunction",
        "difficulty shifting gears."
      ],
      "odiNumbers": [
        "11219387"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Clutch Cable Failure",
      "impact": "The failure of the clutch cable can render the motorcycle undrivable, potentially causing accidents, especially for younger or less experienced riders who are unable to shift without a clutch.",
      "symptoms": [
        "The clutch cable breaks",
        "making it impossible to shift gears",
        "leaving the rider stranded."
      ],
      "odiNumbers": [
        "11075404"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Oil Pan Drain Plug Design Flaw",
      "impact": "The protruding fin protecting the oil pan drain plug can be pushed into the oil pan if it hits an object, causing the oil pan to rupture and release a large amount of oil, which can cover the back wheel and lead to accidents or even death.",
      "symptoms": [
        "Oil leakage",
        "oil covering the back wheel",
        "loss of vehicle control."
      ],
      "odiNumbers": [
        "10945266",
        "10824702"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Clutch Cable Failure",
      "impact": "The failure of the clutch cable can cause the clutch to slip, making it difficult or impossible to control the motorcycle, which can lead to accidents or loss of control.",
      "symptoms": [
        "The clutch pedal feels soft or spongy",
        "the clutch pedal sticks to the floor",
        "the clutch pedal does not return to its normal position",
        "the clutch pedal has a delayed return to its normal position",
        "the clutch pedal has a sudden loss of pressure",
        "the motorcycle begins to lurch forward from the slipping clutch."
      ],
      "odiNumbers": [
        "11052665"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Improper Final Drive Chain Tension Specification",
      "impact": "The improper final drive chain tension specification can lead to catastrophic failure of the drive chain and/or the rear sprocket and/or the front sprocket, which can cause accidents, injury, or death.",
      "symptoms": [
        "None reported",
        "as this is a design flaw rather than a failure."
      ],
      "odiNumbers": [
        "10820642"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Engine Stalling due to Faulty Electronic Control Unit (ECU)",
      "impact": "The failure of the ECU can cause the engine to stall while driving, leading to a loss of power and control, which can result in accidents, especially on busy roads or highways.",
      "symptoms": [
        "The engine shuts off while driving",
        "the vehicle will only idle for a few seconds before stalling again",
        "the vehicle may not restart after stalling."
      ],
      "odiNumbers": [
        "10735779"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Failure of Dealership to Diagnose and Repair Issues",
      "impact": "The inability of dealerships to diagnose and repair issues can lead to prolonged exposure to hazardous conditions, increased risk of accidents, and frustration for vehicle owners.",
      "symptoms": [
        "Vehicle is returned to the owner without proper diagnosis or repair",
        "the issue persists or recurs",
        "owners experience repeated incidents of the same problem."
      ],
      "odiNumbers": [
        "10735779"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}