{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SUSPENSION",
    "SERVICE BRAKES",
    "WHEELS",
    "STEERING",
    "VEHICLE SPEED CONTROL"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Faulty Control Buttons on Left Handlebar",
      "impact": "The failure of control buttons on the left handlebar can affect cruise control, suspension settings, and ride mode, which can impact engine performance and overall motorcycle operation.",
      "symptoms": [
        "Control buttons on the left handlebar fail to function",
        "affecting cruise control",
        "suspension settings",
        "and ride mode."
      ],
      "odiNumbers": [
        "11100023"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Delayed or Unavailable Recall Repair Parts",
      "impact": "The unavailability of recall repair parts can leave motorcycles with safety-critical issues unrepaired, potentially leading to accidents or injuries.",
      "symptoms": [
        "Dealerships are unable to complete recall repairs due to unavailable parts",
        "leaving motorcycles with safety issues unrepaired."
      ],
      "odiNumbers": [
        "11030033",
        "11021750"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Front Fork Suspension Issues (Recall 17V-438)",
      "impact": "The front fork suspension issue can affect the motorcycle's stability and handling, potentially leading to accidents or injuries.",
      "symptoms": [
        "Front fork suspension failure",
        "notification of recall",
        "but parts are unavailable for repair."
      ],
      "odiNumbers": [
        "11030033",
        "11021750"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Brake System Failure",
      "impact": "The failure of the rear brake system can cause a loss of braking performance, leading to increased stopping distances and potentially causing accidents.",
      "symptoms": [
        "The rear brake pedal feels soft",
        "the brake pedal requires more and more travel to engage",
        "the brake pedal eventually reaches the stop without engaging",
        "the vehicle experiences a loss of rear braking performance",
        "bleeding the brake system temporarily resolves the issue",
        "but the problem returns after a few thousand miles."
      ],
      "odiNumbers": [
        "11516417",
        "11110571"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Brake Caliper Failure",
      "impact": "The sudden detachment of the rear brake caliper can cause loss of braking ability, leading to a high risk of accidents, especially at high speeds. The caliper can get stuck in the wheel spokes, causing damage to the wheel and potentially leading to a loss of control or wheel lockup.",
      "symptoms": [
        "The rear brake caliper comes loose or falls off",
        "the brake caliper gets stuck in the wheel spokes",
        "the wheel is damaged or shattered",
        "the vehicle experiences a loss of braking ability",
        "the vehicle is difficult to control or steer."
      ],
      "odiNumbers": [
        "11537784"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Front Suspension Failure",
      "impact": "The sudden failure of the front suspension can cause the driver to lose control of the vehicle, leading to accidents, injuries, and potentially fatalities.",
      "symptoms": [
        "The front suspension collapses",
        "the vehicle's stability is compromised",
        "the driver loses control of the vehicle",
        "the vehicle crashes or becomes involved in an accident."
      ],
      "odiNumbers": [
        "11000810"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Unexplained Component Failure",
      "impact": "The unexplained failure of a component, such as the front suspension, can lead to unexpected and potentially catastrophic consequences, including accidents, injuries, and fatalities.",
      "symptoms": [
        "The component fails without warning",
        "the failure is not attributed to a specific cause or defect",
        "the failure occurs despite regular maintenance and inspection."
      ],
      "odiNumbers": [
        "11000810"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Cruise Control Malfunction",
      "impact": "The failure of the cruise control system to disengage when the clutch is operated can cause the engine to race and propel the vehicle forward in an uncontrolled manner, potentially leading to accidents or loss of control.",
      "symptoms": [
        "The cruise control remains engaged when the clutch is operated to downshift",
        "the engine races",
        "the vehicle propels forward in an uncontrolled manner",
        "the vehicle accelerates unexpectedly."
      ],
      "odiNumbers": [
        "10991957"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}