{
  "totalComplaints": 24,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ENGINE",
    "SEAT BELTS",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Excessive Oil Consumption and Piston Ring Failure",
      "impact": "Excessive oil consumption can lead to engine failure, causing the vehicle to stall or seize, which can result in accidents, especially when driving at high speeds. This can pose a significant safety risk to the driver and passengers.",
      "symptoms": [
        "The vehicle consumes excessive amounts of oil",
        "requiring frequent top-offs; the \"Low Oil\" message is displayed; a burning odor is present inside the vehicle; the engine may seize or stall",
        "leading to loss of power and control."
      ],
      "odiNumbers": [
        "11566100",
        "11547425",
        "11533429",
        "11512809",
        "11511748",
        "11510635",
        "11446234"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Delayed or Unavailable Recall Repairs for Seat Belt Safety",
      "impact": "The delay or unavailability of recall repairs for seat belt safety can increase the risk of injury or fatality in the event of an accident, as the faulty seat belts may not provide adequate protection.",
      "symptoms": [
        "Difficulty opening or using the seat belt",
        "inability to get the recall repair performed due to unavailable parts",
        "lack of communication from the manufacturer or dealer regarding the repair timeline",
        "incorrect information provided by the manufacturer."
      ],
      "odiNumbers": [
        "11453611",
        "11406905",
        "11390680",
        "11386490",
        "11383288"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Engine Compartment Fire",
      "impact": "The engine compartment fire can cause significant damage to the vehicle, potentially leading to a total loss, and poses a risk to the safety of the occupants and bystanders.",
      "symptoms": [
        "The vehicle starts shaking",
        "unable to accelerate",
        "and smoke emerges from the engine compartment",
        "followed by a fire."
      ],
      "odiNumbers": [
        "11544928"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Unstable Idle and Revving Engine",
      "impact": "The unstable idle and revving engine can cause the vehicle to move unexpectedly, potentially leading to accidents or loss of control.",
      "symptoms": [
        "The engine RPMs rev up and down when stopped at a stop light",
        "requiring the driver to hold the brake down to keep the vehicle from moving",
        "and the check engine light comes on."
      ],
      "odiNumbers": [
        "11450946"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Starter Failure",
      "impact": "The starter failure can cause the vehicle to stall or fail to start, potentially leaving the driver stranded or causing accidents.",
      "symptoms": [
        "The vehicle stops in the middle of the road",
        "and the starter motor fails to engage."
      ],
      "odiNumbers": [
        "11131164"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rearview Camera Malfunction",
      "impact": "The malfunctioning rearview camera can reduce visibility and increase the risk of accidents or injuries when reversing.",
      "symptoms": [
        "The rearview camera image becomes hazy or degraded",
        "even with slight rainfall",
        "making it difficult to see behind the vehicle."
      ],
      "odiNumbers": [
        "10943900"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}