{
  "totalComplaints": 22,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "FUEL/PROPULSION SYSTEM",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Door Actuator Failure",
      "impact": "The failure of the door actuator can cause the door to become stuck, making it difficult or impossible to lock or unlock the door, which can lead to safety risks and inconvenience.",
      "symptoms": [
        "The door actuator fails to respond",
        "the door cannot be locked or unlocked",
        "the door is stuck in a locked or unlocked position."
      ],
      "odiNumbers": [
        "11579273"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Engine Compartment Fire",
      "impact": "An unexpected engine compartment fire can cause damage to the vehicle, potentially leading to accidents or injuries.",
      "symptoms": [
        "The steering wheel light flashes on the dashboard",
        "a light appears from the engine bay",
        "a fire starts in the engine compartment."
      ],
      "odiNumbers": [
        "11572486"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Delayed Recall Resolution",
      "impact": "The failure of dealerships to resolve recalls in a timely manner can lead to safety risks and inconvenience for vehicle owners.",
      "symptoms": [
        "The dealership fails to respond to recall inquiries",
        "the recall is not resolved despite multiple attempts",
        "the vehicle owner is left without a resolution."
      ],
      "odiNumbers": [
        "11426005"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Defective Outside Air Temperature Sensor",
      "impact": "A faulty outside air temperature sensor can cause the air conditioning system to malfunction, leading to discomfort and potential safety risks.",
      "symptoms": [
        "The outside air temperature sensor reads incorrectly",
        "the air conditioning system fails to work",
        "the engine emission control warning light comes on and stays on."
      ],
      "odiNumbers": [
        "11110901"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel Odor and Leaking High Pressure Fuel Pump Seal",
      "impact": "The strong fuel odor can be a sign of a fuel leak, which can increase the risk of a fire or explosion, potentially causing serious injury or death.",
      "symptoms": [
        "Strong raw fuel odor after filling up fuel",
        "fuel smell emanating from the driver side or left side of the vehicle near the fuel door",
        "fuel smell remains until the tank is depleted to about half",
        "fuel smell returns immediately after the next fill-up."
      ],
      "odiNumbers": [
        "11571436",
        "11150022",
        "11047835"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Brake Pedal Failure",
      "impact": "The failure of the brake pedal can cause the vehicle to slow down or stop unexpectedly, leading to accidents or loss of control.",
      "symptoms": [
        "The brake pedal feels soft or spongy",
        "the brake pedal goes all the way to the floor suddenly",
        "the wheels lock up",
        "the vehicle slows down or stops unexpectedly."
      ],
      "odiNumbers": [
        "11166394",
        "11105339"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Autonomous Emergency Braking (AEB) System Malfunction",
      "impact": "The malfunction of the AEB system can cause the brakes to fail, leading to accidents or loss of control.",
      "symptoms": [
        "The AEB system confuses the control system",
        "causing the brakes to malfunction",
        "the vehicle slows down or stops unexpectedly",
        "the brake pedal feels soft or spongy."
      ],
      "odiNumbers": [
        "11105339"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Parts Distribution Disconnect",
      "impact": "The delay in receiving parts for recall repairs can leave vehicles with safety issues on the road, putting drivers and passengers at risk.",
      "symptoms": [
        "The part to do the recall repair is not yet available",
        "the manufacturer has exceeded a reasonable amount of time for the recall repair."
      ],
      "odiNumbers": [
        "11418007"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}