{
  "totalComplaints": 14,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "ENGINE",
    "BACK OVER PREVENTION"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Hybrid System Malfunction",
      "impact": "The malfunction of the hybrid system can cause the vehicle to lose power, leading to a loss of control, which can increase the risk of accidents.",
      "symptoms": [
        "The vehicle suddenly loses power",
        "the engine warning light comes on",
        "the vehicle's speed suddenly reduces",
        "the vehicle is unable to maintain speed",
        "the vehicle's electric motor turns off and the gas motor does not immediately turn on."
      ],
      "odiNumbers": [
        "11112581",
        "11105400",
        "11064175"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Voltage Indicator Malfunction",
      "impact": "The malfunction of the voltage indicator can cause the vehicle's electrical system to malfunction, leading to a loss of power, which can increase the risk of accidents.",
      "symptoms": [
        "The voltage indicator switches from normal voltage to high voltage",
        "the vehicle's electrical system malfunctions."
      ],
      "odiNumbers": [
        "11317509"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Failure to Turn Off Completely",
      "impact": "The failure of the vehicle to turn off completely can cause the vehicle's electrical system to remain active, leading to a risk of fire or electrical shock.",
      "symptoms": [
        "The vehicle will not turn off completely",
        "the engine still revs after the vehicle is turned off."
      ],
      "odiNumbers": [
        "11220808"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Electrical Loss Recall Issues",
      "impact": "The manufacturer's failure to service the electrical loss recall can cause the vehicle's electrical system to malfunction, leading to a loss of power, which can increase the risk of accidents.",
      "symptoms": [
        "The manufacturer refuses to service the electrical loss recall",
        "the vehicle's electrical system malfunctions."
      ],
      "odiNumbers": [
        "11192587"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Engine Failure Due to Oil Drain Bolt Issue",
      "impact": "The engine failure can cause the vehicle to stall or lose power, leading to accidents or leaving the driver stranded. The lack of oil in the engine can also cause significant damage to the engine, leading to costly repairs.",
      "symptoms": [
        "The dashboard displays a warning message to turn off the car",
        "the engine loses power",
        "the vehicle stalls",
        "the oil drain bolt is loose or missing",
        "the oil level is low or empty."
      ],
      "odiNumbers": [
        "11151743"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Transmission Error and Hybrid System Malfunction",
      "impact": "The transmission error and hybrid system malfunction can cause the vehicle to lose power, leading to accidents or leaving the driver stranded. The error can also cause the vehicle to become stuck in electric mode, making it difficult to drive.",
      "symptoms": [
        "The vehicle gets stuck in electric mode",
        "the transmission error message appears on the dashboard",
        "the vehicle loses power",
        "the vehicle must be turned off and on to reset",
        "the error message says \"Service Immediately\"."
      ],
      "odiNumbers": [
        "11072137"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rearview Camera System Malfunction",
      "impact": "The failure of the rearview camera system can reduce the driver's visibility while reversing, increasing the risk of accidents or injuries.",
      "symptoms": [
        "The rearview camera activates but displays a previous image instead of the current image behind the vehicle",
        "the display screen fails to display the current image behind the vehicle",
        "the rearview camera system does not function properly."
      ],
      "odiNumbers": [
        "11460659"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Infotainment System Glitch",
      "impact": "The malfunction of the infotainment system can distract the driver and cause accidents, as well as reduce the functionality of safety features such as the rearview camera.",
      "symptoms": [
        "The infotainment system displays incorrect or outdated information",
        "the system freezes or becomes unresponsive",
        "the system fails to display critical safety information such as the rearview camera feed."
      ],
      "odiNumbers": [
        "11460659"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}