{
  "totalComplaints": 15,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "ELECTRICAL SYSTEM",
    "SUSPENSION",
    "AIR BAGS"
  ],
  "parsedComplaintsResultLength": 9,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Brake Master Cylinder and Brake Booster Failure",
      "impact": "The failure of the brake master cylinder and brake booster can cause increased force to brake, a brake pedal that goes all the way to the floor, and increased distance to come to a full stop, which can lead to accidents or near-misses.",
      "symptoms": [
        "The brake pedal feels spongy or soft",
        "the brake pedal goes to the floor",
        "the vehicle takes longer to stop",
        "the \"Check Brakes\" warning light is illuminated",
        "white smoke comes from the tailpipe",
        "brake fluid leaks from the reservoir",
        "and the brake fluid warning light appears on the instrument panel."
      ],
      "odiNumbers": [
        "11567623",
        "11541972",
        "11468975",
        "11465945",
        "11434939"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Recall Parts Unavailability and VIN Exclusion",
      "impact": "The unavailability of recall parts and exclusion of certain VINs from the recall can leave vehicles with faulty brake systems on the road, putting drivers and passengers at risk.",
      "symptoms": [
        "Notification of recall received",
        "but parts are not available for repair",
        "VIN is not included in the recall despite experiencing similar issues."
      ],
      "odiNumbers": [
        "11515592",
        "11471356"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Sideview Mirror Electrical Fire",
      "impact": "The electrical fire in the sideview mirror can cause damage to the vehicle's electrical system, potentially leading to a larger fire, and may distract the driver, increasing the risk of an accident.",
      "symptoms": [
        "The sideview mirror catches on fire",
        "wires insulation melts inside the mirror."
      ],
      "odiNumbers": [
        "11537363"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Turn Signal Malfunction",
      "impact": "The malfunction of the turn signal can increase the risk of accidents, as other drivers may not be aware of the vehicle's intentions, and can lead to confusion and frustration for the driver.",
      "symptoms": [
        "The turn signals do not operate",
        "even when the control arm is in the fully locked position",
        "the turn signals are disabled when the control arm is moved partially in any direction and then immediately moved into the fully opposite direction",
        "the turn signals do not operate when the high beams are adjusted",
        "the turn signals do not operate when the wrong direction is selected first."
      ],
      "odiNumbers": [
        "11053580"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear End Noise and Rust-Related Issues",
      "impact": "The excessive noise from the rear end and rust-related problems can compromise the structural integrity of the vehicle, leading to safety concerns, and potentially causing accidents or injuries.",
      "symptoms": [
        "Unusual noises from the rear end",
        "rust holes in rocker panels",
        "rusted frame cross supports",
        "rusted hood latch",
        "possibility of hood opening while driving",
        "failure to pass state inspection."
      ],
      "odiNumbers": [
        "11490481",
        "11457972"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Frame Rust and Corrosion",
      "impact": "The rust and corrosion of the frame can weaken the vehicle's structural integrity, leading to safety concerns, and potentially causing accidents or injuries.",
      "symptoms": [
        "Rust holes in rocker panels",
        "rusted frame cross supports",
        "failure to pass state inspection."
      ],
      "odiNumbers": [
        "11457972"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Hood Latch Failure due to Rust",
      "impact": "The rusted hood latch can cause the hood to open while driving, obstructing the driver's view and potentially leading to accidents or injuries.",
      "symptoms": [
        "Rusted hood latch",
        "possibility of hood opening while driving."
      ],
      "odiNumbers": [
        "11457972"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Airbag Failure to Deploy",
      "impact": "The failure of the airbag to deploy in the event of a crash can increase the risk of injury or fatality to the occupants.",
      "symptoms": [
        "The airbag does not deploy despite the vehicle being involved in a crash",
        "the computer indicates that the airbag deployed when it did not",
        "the airbag warning light may be illuminated on the dashboard."
      ],
      "odiNumbers": [
        "11343220"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inadequate Occupant Detection and Airbag System Design",
      "impact": "The lack of a weight sensor in the front passenger seat and the airbag system's reliance on seatbelt fastening can lead to the deployment of the airbag even when a child or small adult is in the seat, increasing the risk of injury or fatality.",
      "symptoms": [
        "No notification that the seatbelt is not fastened",
        "airbag does not deploy if seatbelt is not fastened",
        "airbag may deploy even when a child or small adult is in the seat",
        "potentially causing injury or death."
      ],
      "odiNumbers": [
        "11253030"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}