{
  "totalComplaints": 28,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "TIRES",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Rollaway Accident due to Lack of Safety Feature",
      "impact": "The lack of a safety feature to prevent rollaway accidents when the vehicle is at full stop and the engine is turned off can cause the vehicle to roll, potentially leading to accidents or damage to the vehicle or surrounding property.",
      "symptoms": [
        "The vehicle starts rolling after the engine is turned off",
        "even when the transmission is in park."
      ],
      "odiNumbers": [
        "11494327"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Premature Cracking of Interior Trim",
      "impact": "The premature cracking of interior trim can lead to cosmetic damage and potentially affect the overall durability of the vehicle's interior components.",
      "symptoms": [
        "Cracking of the trim around the front center A/C vent",
        "cracking of the area around the cup holder."
      ],
      "odiNumbers": [
        "11324647"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Unattended Vehicle Self-Start",
      "impact": "The vehicle self-starting while unattended can lead to safety risks, such as carbon monoxide poisoning or accidents, and can also cause unnecessary fuel consumption.",
      "symptoms": [
        "The vehicle starts running while unattended",
        "with the engine running and dash lights on."
      ],
      "odiNumbers": [
        "11153650"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "VIN Information Error",
      "impact": "An error in the VIN information can lead to issues with vehicle registration, insurance, and warranty claims.",
      "symptoms": [
        "The VIN information displays an incorrect year of manufacture."
      ],
      "odiNumbers": [
        "10954406"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Yokohama Tire Sidewall Failure",
      "impact": "The sudden failure of the Yokohama tire sidewall can lead to a loss of vehicle control, accidents, and potentially serious injuries or fatalities, especially at high speeds.",
      "symptoms": [
        "The tire sidewall explodes or spits",
        "a crack or split appears on the tire sidewall",
        "the tire needs to be replaced due to manufacturing defect."
      ],
      "odiNumbers": [
        "11246539",
        "11088914",
        "11001220"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Brake Pedal Failure to Engage",
      "impact": "The failure of the brake pedal to engage can cause the vehicle to accelerate uncontrollably, leading to accidents, injuries, and fatalities.",
      "symptoms": [
        "The brake pedal travels to the floor",
        "the vehicle continues to accelerate despite repeated compression of the brakes",
        "the brakes fail to slow or stop the vehicle",
        "the driver has to pump the brake pedal to stop the vehicle."
      ],
      "odiNumbers": [
        "11244164",
        "11143027",
        "10945785"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}