{
  "totalComplaints": 14,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "WHEELS",
    "TIRES",
    "SUSPENSION",
    "UNKNOWN OR OTHER",
    "ELECTRICAL SYSTEM"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Castle Rock Tire Failure",
      "impact": "The sudden and catastrophic failure of Castle Rock tires can lead to loss of control, accidents, and potentially serious injuries or fatalities, especially when towing trailers or traveling at high speeds.",
      "symptoms": [
        "Tire blowouts",
        "tire explosions",
        "tire separation",
        "exposed rims",
        "and loss of tire pressure."
      ],
      "odiNumbers": [
        "11470151",
        "11361712",
        "11340570",
        "10992230"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Castle Rock ST Radial ST Tire Failure",
      "impact": "The sudden failure of the Castle Rock ST Radial ST tire can lead to loss of control, accidents, and potentially serious injuries or fatalities, especially when driving at high speeds.",
      "symptoms": [
        "The tire blows or explodes while in use or in storage",
        "causing damage to the surrounding area and potentially affecting the vehicle's brakes and other components."
      ],
      "odiNumbers": [
        "11552853",
        "11527144",
        "11321119"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Insufficient Axle Capacity",
      "impact": "The undersized axles can cause the trailer to fishtail, sway, and potentially flip over, leading to accidents and injuries. The inadequate axle capacity can also result in premature wear and damage to the trailer's components, compromising its structural integrity.",
      "symptoms": [
        "The trailer fishtails or sways while driving",
        "the tires rub against the wheel well",
        "the leaf springs are flattened or broken",
        "the frame is bent or warped",
        "and the doors may not latch properly."
      ],
      "odiNumbers": [
        "11488914",
        "11130421"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inadequate Leaf Spring Design",
      "impact": "The failure of the leaf springs can cause the trailer to sag, leading to uneven tire wear, reduced clearance, and increased risk of accidents.",
      "symptoms": [
        "The leaf springs are flattened or broken",
        "the tires rub against the wheel well",
        "and the trailer's ride height is uneven."
      ],
      "odiNumbers": [
        "11488914",
        "11130421"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Manufacturer's Failure to Address Safety Concerns",
      "impact": "The manufacturer's refusal to acknowledge and address the safety concerns can lead to continued use of the defective trailer, potentially causing accidents and injuries.",
      "symptoms": [
        "The manufacturer denies responsibility",
        "passes blame to other parties",
        "or fails to provide adequate repairs or upgrades to address the safety concerns."
      ],
      "odiNumbers": [
        "11488914",
        "11130421"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Cabinet Glass Panel Failure",
      "impact": "The sudden and unexpected detachment of glass panels from cabinet doors can cause injury from shattered glass, damage to the camper's interior, and create a hazardous environment.",
      "symptoms": [
        "Glass panels fall and break without warning",
        "cabinet doors open normally but glass panels suddenly detach",
        "shards and pieces of glass spread throughout the camper."
      ],
      "odiNumbers": [
        "11341812"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Awning Rain Guard Leaks",
      "impact": "Water leaks from the awning rain guard can cause damage to electrical components, such as LED lighting, and compromise the functionality of appliances like the fridge and outside stove.",
      "symptoms": [
        "Water drips from the middle of the rain guard",
        "water accumulates around LED lighting",
        "water enters the fridge and outside stove compartment."
      ],
      "odiNumbers": [
        "11090929"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "HVAC System Failure Leading to Fire",
      "impact": "The failure of the HVAC system can cause a fire to break out, potentially leading to destruction of property and loss of life.",
      "symptoms": [
        "Smoke emanating from the exterior of the HVAC unit",
        "smoke filling the interior of the RV",
        "flames engulfing the RV",
        "and potential ignition of surrounding objects."
      ],
      "odiNumbers": [
        "11289747",
        "11032015"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}