{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "VISIBILITY",
    "VISIBILITY/WIPER",
    "STRUCTURE"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "HERH Window Assembly Failure",
      "impact": "The faulty window adhesion can cause the window to separate from the vent bracket, potentially leading to a fatal hazard if the window smashes into a trailing driver's windshield or causes a distraction to the RV driver.",
      "symptoms": [
        "The window breaks free from the vent bracket",
        "the window falls off during travel",
        "the window flaps in the wind",
        "the window can slide off the top rail and become a projectile."
      ],
      "odiNumbers": [
        "11586377",
        "11554359",
        "11539433",
        "11311899"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Storage Area Floor Failure",
      "impact": "The failing floor of the storage area can cause items to fall out while driving, potentially leading to serious accidents or injuries if the items are hit by the tires of the motorhome or another vehicle.",
      "symptoms": [
        "The floor of the storage area is failing",
        "items in storage may fall out while driving."
      ],
      "odiNumbers": [
        "11465560"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Awning Window Glass Panel Detachment",
      "impact": "The detachment of the glass panel within the awning window can cause a loss of visibility, increasing the risk of accidents or injuries, especially if the driver is distracted by the sudden movement.",
      "symptoms": [
        "The awning window glass panel is detached",
        "visible movement of the driver's side awning window",
        "loss of visibility while driving."
      ],
      "odiNumbers": [
        "11568565"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Hehr-Lippert Window Defect",
      "impact": "The design flaw in the Hehr-Lippert windows can cause the outer glass to detach from the mounting frame while driving, potentially becoming a projectile and causing damage or injury. Additionally, the fogging between the glass can reduce visibility, increasing the risk of accidents.",
      "symptoms": [
        "The outer glass of the window detaches from the mounting frame",
        "the window fogs between the glass",
        "poor side and mirror visibility",
        "reduced visibility while driving."
      ],
      "odiNumbers": [
        "11419475"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Hehr-Lippert Window Fogging",
      "impact": "The fogging between the glass of the Hehr-Lippert windows can reduce visibility, increasing the risk of accidents.",
      "symptoms": [
        "Fogging between the glass of the window",
        "poor side and mirror visibility",
        "reduced visibility while driving."
      ],
      "odiNumbers": [
        "11419475"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Inadequate Fastening of Front Cabinet Above Dashboard",
      "impact": "The detachment of the front cabinet above the dashboard, including the steering wheel and other operator controls, can cause loss of control of the vehicle, leading to accidents or injuries.",
      "symptoms": [
        "The front cabinet above the dashboard begins to fall or detaches while the vehicle is in motion",
        "obstructing the driver's view and access to controls",
        "and potentially causing loss of control."
      ],
      "odiNumbers": [
        "11291907"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}