{
  "totalComplaints": 12,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "POWER TRAIN",
    "VISIBILITY/WIPER"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Unintended Acceleration",
      "impact": "The sudden and unintended acceleration of the vehicle can cause loss of control, accidents, and injuries.",
      "symptoms": [
        "The vehicle suddenly accelerates as if the gas pedal was floored",
        "even when the driver is actively braking."
      ],
      "odiNumbers": [
        "11194412"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inadequate Lane Departure Alert Volume",
      "impact": "The low volume of the lane departure alert can lead to accidents or near-misses, as the driver may not be aware of drifting out of their lane.",
      "symptoms": [
        "The lane departure alert is virtually inaudible",
        "making it difficult for the driver to hear the warning."
      ],
      "odiNumbers": [
        "11133067",
        "11112754"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Missing or Inadequate Safety Features",
      "impact": "The lack of a digital speedometer can lead to distracted driving, as the driver may need to take their eyes off the road to check their speed.",
      "symptoms": [
        "The vehicle is missing a digital speedometer",
        "making it difficult for the driver to quickly and accurately check their speed."
      ],
      "odiNumbers": [
        "11118651"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Vehicle Tracking and Key Management Issues",
      "impact": "The loss of tracking information and key management can lead to security risks and potential theft.",
      "symptoms": [
        "The manufacturer has lost track of the vehicle's location and key information",
        "requiring law enforcement investigation."
      ],
      "odiNumbers": [
        "11128454"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Hybrid System Malfunction",
      "impact": "The malfunction of the hybrid system can cause the vehicle to unexpectedly switch to electric mode, leading to loss of power and control, which can result in accidents or injuries.",
      "symptoms": [
        "The vehicle bucks and jerks while driving",
        "the EV light comes on",
        "the vehicle loses power",
        "the vehicle unexpectedly switches to electric mode."
      ],
      "odiNumbers": [
        "11210210"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Rollaway Risk due to Transmission and Ignition System Failure",
      "impact": "The failure of the transmission and ignition system can cause the vehicle to roll away unexpectedly, even when the driver believes the vehicle is in park and turned off, which can lead to accidents, injuries, or property damage.",
      "symptoms": [
        "The vehicle appears to be off and in park but is actually energized and in drive",
        "the vehicle rolls away unexpectedly",
        "the vehicle can be turned off without warning",
        "the vehicle does not require the transmission to be in park before re-energizing."
      ],
      "odiNumbers": [
        "11204012"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Windshield Crack/Defect",
      "impact": "A crack or defect in the windshield can obstruct the driver's view, potentially leading to accidents or injuries.",
      "symptoms": [
        "Cracks or defects in the windshield",
        "often starting at the top of the glass under the rubber seal",
        "without any visible chip or impact from an external object."
      ],
      "odiNumbers": [
        "11110621"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Windshield Wiper/Viper System Failure",
      "impact": "The failure of the windshield wiper/viper system can reduce visibility during inclement weather, increasing the risk of accidents or injuries.",
      "symptoms": [
        "Ice or snow buildup on the windshield",
        "particularly on the top section near the sensor box and at the bottom where the wiper blades reside",
        "reducing visibility to near zero; wiper blades failing to clear ice or snow effectively."
      ],
      "odiNumbers": [
        "11074413"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}