{
  "totalComplaints": 23,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "AIR BAGS",
    "STEERING",
    "FUEL/PROPULSION SYSTEM"
  ],
  "parsedComplaintsResultLength": 11,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Infotainment System Malfunction",
      "impact": "The malfunctioning infotainment system can cause distractions while driving, leading to accidents, and may also result in dropped phone calls, affecting the driver's ability to communicate in emergency situations.",
      "symptoms": [
        "The radio hangs up phone calls",
        "the system freezes or becomes unresponsive",
        "and the satellite radio ID is not recognized."
      ],
      "odiNumbers": [
        "11405151"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Backup Camera Distortion",
      "impact": "The distorted backup camera display can reduce visibility, increasing the risk of accidents or injuries when reversing.",
      "symptoms": [
        "The rear license plate is visible on the backup camera display",
        "and the camera lens appears to show a distorted view."
      ],
      "odiNumbers": [
        "11207521"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Pre-Collision Detection System Failure",
      "impact": "The failure of the pre-collision detection system can increase the risk of accidents, as the vehicle will not stop or warn the driver of potential dangers.",
      "symptoms": [
        "The system does not operate",
        "and the dealership or manufacturer refuses to test or acknowledge the issue."
      ],
      "odiNumbers": [
        "11132427"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Windshield Visibility Issues",
      "impact": "The reduced visibility due to glare or reflections on the rear windshield can cause distractions, increasing the risk of accidents.",
      "symptoms": [
        "Glare on the rear windshield during sunny days",
        "and vertical columns of dashed lines on the windshield at night",
        "obstructing the driver's view."
      ],
      "odiNumbers": [
        "11121781"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Lane Departure Warning System Volume Issues",
      "impact": "The weak lane departure warning signal can fail to alert the driver, increasing the risk of accidents or near-misses.",
      "symptoms": [
        "The lane departure beeping signal is too weak to be heard over normal driving noises."
      ],
      "odiNumbers": [
        "11065477"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Failure of Frontal Air Bags to Deploy",
      "impact": "The failure of frontal air bags to deploy in a crash can increase the risk of injury or death to occupants, as they are not provided with the necessary protection.",
      "symptoms": [
        "None",
        "as this issue is related to the failure of air bags to deploy in a crash",
        "rather than a specific symptom or warning."
      ],
      "odiNumbers": [
        "11497996",
        "11242028",
        "11233352"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Takata Air Bag Recall Issues",
      "impact": "The Takata air bag recall issues can cause the air bags to deploy improperly or not deploy at all, increasing the risk of injury or death to occupants.",
      "symptoms": [
        "None",
        "as this issue is related to a recall and the potential for air bag failure",
        "rather than a specific symptom or warning."
      ],
      "odiNumbers": [
        "11301611"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Torque Sensor Failure",
      "impact": "The failure of the torque sensor can cause the power steering system to malfunction, leading to a loss of steering control, which can result in accidents, injuries, or fatalities.",
      "symptoms": [
        "The power steering warning light and/or triangle warning light appear on the dashboard",
        "a sudden loss of power and response in the steering wheel",
        "the vehicle pulls to one side",
        "the steering wheel feels unresponsive or difficult to control."
      ],
      "odiNumbers": [
        "11430947",
        "11271236"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Airbag Failure",
      "impact": "The failure of the airbag system can result in injuries or fatalities in the event of an accident, as the airbags may not deploy properly or at all.",
      "symptoms": [
        "The airbag warning light appears on the dashboard",
        "the airbags do not deploy in an accident",
        "injuries or fatalities occur due to lack of airbag deployment."
      ],
      "odiNumbers": [
        "11323844"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Steering System Failure",
      "impact": "The failure of the steering system can cause the vehicle to become difficult to control, leading to accidents, injuries, or fatalities.",
      "symptoms": [
        "The vehicle pulls to one side",
        "the steering wheel feels unresponsive or difficult to control",
        "the vehicle is difficult to steer",
        "a rumbling noise is heard from underneath the vehicle when driving or braking."
      ],
      "odiNumbers": [
        "11323844",
        "11253690"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Fuel Pump Failure",
      "impact": "The failure of the fuel pump can cause the engine to lose power, stall, or quit, especially when accelerating, which can lead to accidents or create a safety hazard, particularly in heavy traffic.",
      "symptoms": [
        "The engine almost quits or loses power",
        "especially when accelerating",
        "the engine recovers to normal operation after a few seconds",
        "no instrumental warning or notification is displayed."
      ],
      "odiNumbers": [
        "11495198",
        "11350749",
        "11341599"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}