{
  "totalComplaints": 37,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "STEERING",
    "SUSPENSION"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Power Train Failure (Recall 19V692000)",
      "impact": "The power train failure can cause the motorcycle to stall or lose power, increasing the risk of a crash.",
      "symptoms": [
        "The motorcycle stalls",
        "loses power",
        "or has difficulty shifting gears; the check engine warning indicator illuminates; unknown red triangle icon illuminates; the vehicle spontaneously accelerates; the RPMS fail to increase or decrease from 2",
        "000."
      ],
      "odiNumbers": [
        "11376177",
        "11323069",
        "11319317",
        "11315532",
        "11312046",
        "11309599",
        "11308833",
        "11307033",
        "11306752",
        "11302862",
        "11301639",
        "11301357",
        "11301441",
        "11300747",
        "11286398",
        "11280161",
        "11278329",
        "11243334"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Transmission Failure",
      "impact": "The transmission failure can cause the motorcycle to lose power or stall, increasing the risk of a crash.",
      "symptoms": [
        "The motorcycle loses power or stalls; the transmission fails to engage properly; the gears do not properly engage when switched."
      ],
      "odiNumbers": [
        "11315532",
        "11286398"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Speedometer Inaccuracy",
      "impact": "An inaccurate speedometer can cause the rider to misjudge their speed, increasing the risk of a crash.",
      "symptoms": [
        "The speedometer reading is off by 4 miles per hour."
      ],
      "odiNumbers": [
        "11376177"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "High-Speed Instability",
      "impact": "The high-speed instability of the motorcycle can cause loss of control, accidents, and potentially lead to serious injuries or fatalities.",
      "symptoms": [
        "The motorcycle wobbles or shakes violently at speeds above 60 mph",
        "especially when passing other vehicles or driving in turbulent air; the handlebars move erratically; the motorcycle pulls to one side; the rider feels unsafe and may lose control."
      ],
      "odiNumbers": [
        "11315959",
        "11281911",
        "11271619",
        "11194573",
        "11191569",
        "11166420",
        "11149745",
        "11128491",
        "11111232",
        "11111044",
        "11098821"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Speed Regulator Installation",
      "impact": "The installation of a speed regulator, which limits the motorcycle's speed to 101 mph, may be a attempt to hide the instability defect, and can lead to a loss of trust in the manufacturer.",
      "symptoms": [
        "The motorcycle's speed is limited to 101 mph; the speed regulator was not disclosed at the time of purchase."
      ],
      "odiNumbers": [
        "11281911"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Manufacturer's Response",
      "impact": "The manufacturer's lack of response or inadequate response to the complaints can lead to frustration and a sense of abandonment among customers.",
      "symptoms": [
        "The manufacturer does not respond to complaints or fails to provide a satisfactory solution; the manufacturer claims that the issue is inherent to the bike or that it is working as designed."
      ],
      "odiNumbers": [
        "11281911",
        "11149745",
        "11111044",
        "11098821"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Unstable Handling and Vibration Issues",
      "impact": "The unstable handling and vibration issues can cause loss of control, accidents, or near-miss situations, potentially leading to injuries or fatalities.",
      "symptoms": [
        "The motorcycle becomes unstable while driving at high speeds",
        "especially when driving behind a semi-truck or in windy conditions; the front end of the vehicle shakes without warning; abnormal vibration from the motorcycle; the rear of the motorcycle shimmies and sways abnormally back and forth."
      ],
      "odiNumbers": [
        "11321900",
        "11246011",
        "11219239"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}