{
  "totalComplaints": 35,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ENGINE",
    "UNKNOWN OR OTHER",
    "ELECTRICAL SYSTEM"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Coolant Leaks and Cracked Cylinder Heads",
      "impact": "The coolant leaks and cracked cylinder heads can cause significant overheating, engine damage, and potentially lead to a catastrophic failure, which can result in accidents, fires, or leave the driver stranded.",
      "symptoms": [
        "Coolant leaks",
        "overheating",
        "engine warning light",
        "abnormal noise",
        "coolant leaking onto the oil filter and exhaust",
        "engine failure",
        "and inability to start the vehicle."
      ],
      "odiNumbers": [
        "11592579",
        "11575086",
        "11564776",
        "11561805",
        "11541917",
        "11524109",
        "11508779",
        "11428967"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Internal Cracks in Infotainment Screen",
      "impact": "The internal cracks in the infotainment screen can cause distractions while driving, obstruct the view of the backup camera, and affect the overall usability of the screen.",
      "symptoms": [
        "Internal cracks or spider cracks on the infotainment screen",
        "often appearing in the top left corner or edges",
        "which can spread over time; inability to use certain features like GPS or backup camera due to cracks."
      ],
      "odiNumbers": [
        "11569260",
        "11558783",
        "11543662",
        "11520328",
        "11486695"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Mazda Smart Braking System Malfunction",
      "impact": "The malfunction of the Mazda Smart Braking System can cause false warnings, prevent the use of cruise control, and potentially lead to unexpected braking or loss of control.",
      "symptoms": [
        "Front radar warning lights come on after starting the car",
        "even when the windshield and front emblem are clean; funny brake pedal feel when applied; inability to set cruise control."
      ],
      "odiNumbers": [
        "11375991"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Infotainment Screen Failure (Cracking/Spidering)",
      "impact": "The failure of the infotainment screen can cause difficulty in viewing important information, which can lead to driver distraction and potentially cause accidents.",
      "symptoms": [
        "The infotainment screen develops cracks or spidering",
        "making it difficult to see information on the screen."
      ],
      "odiNumbers": [
        "11521684",
        "11481981",
        "11469053"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electrical System Failure (Power Liftgate Module)",
      "impact": "The failure of the electrical system can cause the vehicle to not start, leading to inconvenience and potentially stranding the driver.",
      "symptoms": [
        "The vehicle will not start after sitting for 24 hours",
        "multiple batteries have been replaced."
      ],
      "odiNumbers": [
        "11448619"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Advanced Safety Feature Failure (Lane Assist, Emergency Brake, Lane Departure)",
      "impact": "The failure of advanced safety features can increase the risk of accidents, as the vehicle may not respond as intended in emergency situations.",
      "symptoms": [
        "The emergency brake does not engage",
        "lane assist disengages and steers the vehicle into oncoming traffic",
        "lane departure feature fails to alert the driver when a vehicle is in their blind spot."
      ],
      "odiNumbers": [
        "11280204"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Vehicle Fire (Rear Passenger Side)",
      "impact": "A vehicle fire can cause damage to the vehicle and potentially harm occupants or bystanders.",
      "symptoms": [
        "Flames and smoke appear from the rear passenger side of the vehicle",
        "dashboard warning lights suddenly activate and illuminate."
      ],
      "odiNumbers": [
        "11477407"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}