{
  "totalComplaints": 67,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "SERVICE BRAKES",
    "FORWARD COLLISION AVOIDANCE",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 21,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Electrical System Failure (Key Fob and Ignition Issues)",
      "impact": "The failure of the electrical system can cause the vehicle to shut off inadvertently, making it difficult or impossible to start the vehicle, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The vehicle shuts off inadvertently",
        "multiple attempts are needed to start the vehicle",
        "the key fob fails to unlock the doors",
        "an unknown warning light is illuminated."
      ],
      "odiNumbers": [
        "11525403",
        "11516009",
        "11582447"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Recall Repair Delay (Electrical System)",
      "impact": "The delay in recall repair can cause the vehicle to be driven in an unsafe condition, potentially leading to accidents or injuries.",
      "symptoms": [
        "No symptoms reported",
        "but the delay in recall repair can cause the vehicle to be driven in an unsafe condition."
      ],
      "odiNumbers": [
        "11515207",
        "11512878"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Alarm and Lighting Issues",
      "impact": "The malfunctioning alarm and lighting system can cause distractions while driving, potentially leading to accidents.",
      "symptoms": [
        "The alarm comes on by itself",
        "the lights inside the car keep coming on while driving",
        "a red triangle warning light appears on the dashboard."
      ],
      "odiNumbers": [
        "11492890"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Data Not Available and Crash Warning Light",
      "impact": "The malfunctioning data system and crash warning light can cause distractions while driving, potentially leading to accidents.",
      "symptoms": [
        "A message center says \"data not available\"",
        "a crash warning light illuminates and stays on for about 10 minutes",
        "the warning light appears only when it rains."
      ],
      "odiNumbers": [
        "11432364"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Radiator Fan Assembly Failure",
      "impact": "The failure of the radiator fan assembly can cause the engine to overheat, potentially leading to engine damage or failure.",
      "symptoms": [
        "The air conditioning shuts down",
        "the radiator overheats",
        "the check engine light appears briefly."
      ],
      "odiNumbers": [
        "11422173"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Gas Level Registration and Electronic Dash Issues",
      "impact": "The malfunctioning gas level registration and electronic dash can cause distractions while driving, potentially leading to accidents.",
      "symptoms": [
        "The gas level is not registered electronically",
        "random flashes of bright light appear on the electronic dash",
        "the climate control and entertainment controller malfunction."
      ],
      "odiNumbers": [
        "11421649"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 7,
      "issueCategory": "Gear Shift and Neutral Safety Switch Issues",
      "impact": "The malfunctioning gear shift and neutral safety switch can cause the vehicle to roll unexpectedly, potentially leading to accidents or injuries.",
      "symptoms": [
        "The gear shift may slide to neutral without pressing the button",
        "the vehicle may roll in an incline direction."
      ],
      "odiNumbers": [
        "11407526"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 8,
      "issueCategory": "Power Loss and Malfunction Warning",
      "impact": "The power loss and malfunction warning can cause the vehicle to stall or lose power, potentially leading to accidents or injuries.",
      "symptoms": [
        "The vehicle loses power",
        "a malfunction warning appears",
        "the vehicle dies and gets towed."
      ],
      "odiNumbers": [
        "11384320"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 9,
      "issueCategory": "Rear Cross Track System Failure",
      "impact": "The malfunctioning rear cross track system can cause the vehicle to fail to detect objects, potentially leading to accidents or injuries.",
      "symptoms": [
        "The rear cross track system fails to operate as designed",
        "the system fails to detect objects."
      ],
      "odiNumbers": [
        "11360515"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 10,
      "issueCategory": "Loud Noise and Vibration When Using Heat or A/C",
      "impact": "The loud noise and vibration can cause distractions while driving, potentially leading to accidents.",
      "symptoms": [
        "A loud noise is heard when the heat or A/C is turned on",
        "the entire front of the car vibrates."
      ],
      "odiNumbers": [
        "11324307"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 11,
      "issueCategory": "Emergency Braking System Malfunction",
      "impact": "The malfunctioning emergency braking system can cause the vehicle to unexpectedly apply the brakes, potentially leading to accidents or injuries.",
      "symptoms": [
        "The emergency braking light is lit on the screen",
        "the vehicle won't move when put in gear."
      ],
      "odiNumbers": [
        "11281196"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Unintended Activation of Automatic Emergency Braking (AEB) System",
      "impact": "The unintended activation of the AEB system can cause the vehicle to suddenly stop or slow down, which can lead to accidents, injuries, or fatalities, especially if there are vehicles behind the affected vehicle.",
      "symptoms": [
        "The AEB system activates without any apparent reason",
        "the vehicle suddenly stops or slows down",
        "the brake pedal feels stiff or unresponsive",
        "the ABS rumbles and slows the vehicle",
        "warning lights and beeps on the dashboard",
        "and the vehicle may come to a sudden halt even when there are no obstacles or vehicles in front."
      ],
      "odiNumbers": [
        "11570460",
        "11436156",
        "11429721",
        "11419163",
        "11389526",
        "11375315",
        "11374971",
        "11350877",
        "11330854",
        "11323611",
        "11290753",
        "11286811",
        "11286411"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Error Code P0304 and Mass Air Flow Sensor Issues",
      "impact": "The error code P0304 and mass air flow sensor issues can cause the vehicle's engine to malfunction, leading to reduced performance, decreased fuel efficiency, and potentially causing accidents or stalling.",
      "symptoms": [
        "Error code P0304 appears on the dashboard",
        "the vehicle's engine misfires or runs rough",
        "the vehicle's performance is reduced",
        "and the mass air flow sensor may need to be replaced."
      ],
      "odiNumbers": [
        "11413842"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Brake Pedal Stiffness and Clicking Noise",
      "impact": "The brake pedal stiffness and clicking noise can cause the vehicle to be difficult to start, and the brake system may malfunction, leading to accidents or injuries.",
      "symptoms": [
        "The brake pedal feels stiff or unresponsive",
        "the brake pedal makes a clicking noise when tapped",
        "and the vehicle may be difficult to start."
      ],
      "odiNumbers": [
        "11406966"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Key Fob Interference",
      "impact": "The key fob can interfere with the driver's ability to control the vehicle, leading to accidents or loss of control.",
      "symptoms": [
        "The driver may experience sudden loss of control",
        "the vehicle may swerve or jerk",
        "or the driver may feel like they are hitting an invisible wall."
      ],
      "odiNumbers": [
        "11566681"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Transmission Issues",
      "impact": "The transmission failure can cause the vehicle to stall or lose power, leading to accidents or stranding the driver.",
      "symptoms": [
        "The transmission may stop changing gears",
        "the vehicle may stall or hesitate",
        "or the driver may need to stop and restart the engine to regain power."
      ],
      "odiNumbers": [
        "11548973"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Cooling Fan Failure",
      "impact": "The cooling fan failure can cause the engine to overheat, leading to damage or failure, and potentially causing accidents.",
      "symptoms": [
        "The cooling fan may stop working",
        "the AC may stop functioning",
        "or the engine may overheat."
      ],
      "odiNumbers": [
        "11514964",
        "11473837"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Sudden Power Loss",
      "impact": "The sudden power loss can cause the vehicle to stall or lose control, leading to accidents or stranding the driver.",
      "symptoms": [
        "The vehicle may suddenly lose power",
        "the driver may experience a sudden loss of acceleration",
        "or the vehicle may stall without warning."
      ],
      "odiNumbers": [
        "11509605"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Advanced Emergency Braking (AEB) System Failure",
      "impact": "The AEB system failure can cause the vehicle to fail to stop or slow down in emergency situations, leading to accidents or injuries.",
      "symptoms": [
        "The AEB system may malfunction",
        "causing the vehicle to fail to stop or slow down",
        "or the system may give false warnings or alerts."
      ],
      "odiNumbers": [
        "11464972"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Water Leak into Cabin",
      "impact": "The water leak can cause damage to the vehicle's electrical systems, leading to malfunctions or failures, and potentially causing accidents.",
      "symptoms": [
        "Water may leak into the cabin above the brake and gas pedals after rain or car wash."
      ],
      "odiNumbers": [
        "11362180"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 7,
      "issueCategory": "Navigation System Failure",
      "impact": "The navigation system failure can cause the driver to become distracted or disoriented, leading to accidents or near-misses.",
      "symptoms": [
        "The navigation system may stop working",
        "the system may freeze or crash",
        "or the driver may be unable to access map features or navigation functions."
      ],
      "odiNumbers": [
        "11351438"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}