{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SUSPENSION",
    "EQUIPMENT",
    "POWER TRAIN",
    "STRUCTURE",
    "PARKING BRAKE"
  ],
  "parsedComplaintsResultLength": 11,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Axle Misalignment and Welding Failure",
      "impact": "The misalignment of the axle and welding failure can cause the tires to move closer together, leading to loss of control and increasing the risk of accidents, which can result in injuries or fatalities.",
      "symptoms": [
        "The RV leans to one side",
        "the tires on one side are not touching the roadway",
        "the axle has moved",
        "and the tires on one side have moved closer together."
      ],
      "odiNumbers": [
        "11472738",
        "11376928",
        "11240550"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Fiberglass Cracking and Structural Issues",
      "impact": "The cracking of the fiberglass exterior and structural issues can lead to water damage, electrical system failures, and compromise the overall safety of the RV, which can result in accidents or injuries.",
      "symptoms": [
        "Cracking of the fiberglass exterior",
        "particularly on the rear slides."
      ],
      "odiNumbers": [
        "11426127"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Dexter Axle Failure and Wheel Detachment",
      "impact": "The failure of the Dexter axle can cause the wheel to detach, leading to loss of control and increasing the risk of accidents, which can result in injuries or fatalities.",
      "symptoms": [
        "The rear passenger-side wheel detaches",
        "the axle fails",
        "and the trailer pulls to one side while towing."
      ],
      "odiNumbers": [
        "11240550"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Antenna Missing or Not Installed",
      "impact": "The absence of an antenna can affect the vehicle's communication and navigation systems, potentially leading to safety issues or inconvenience.",
      "symptoms": [
        "No antenna is present on the vehicle",
        "antenna is missing",
        "antenna not installed."
      ],
      "odiNumbers": [
        "11454523"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Draining Tank Hose Failure",
      "impact": "The failure of the draining tank hose can cause leakage, damage to surrounding components, and potentially lead to accidents or safety hazards.",
      "symptoms": [
        "The draining tank hose fractures",
        "the draining tank hose detaches from the RV",
        "no warning light is illuminated."
      ],
      "odiNumbers": [
        "11421160"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Safety Recall 21V-380: Failure to Comply with Federal Motor Vehicle Safety Standards",
      "impact": "The failure to comply with Federal Motor Vehicle Safety Standards can lead to a higher risk of accidents, injuries, and fatalities.",
      "symptoms": [
        "None reported",
        "as this is a safety recall issue."
      ],
      "odiNumbers": [
        "11494390"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Dealer and Manufacturer Responsibility: Failure to Address Safety Recall",
      "impact": "The failure of dealers and manufacturers to address safety recalls can lead to a higher risk of accidents, injuries, and fatalities, as well as financial losses for consumers.",
      "symptoms": [
        "Consumers experience frustration",
        "financial losses",
        "and potential safety risks due to the dealer's and manufacturer's failure to address safety recalls."
      ],
      "odiNumbers": [
        "11494390"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Roof Mount Screw Failure on RV Ladder",
      "impact": "The failure of the roof mount screws on the RV ladder can cause the ladder to detach from the roof, leading to a potential fall hazard and risk of injury or death.",
      "symptoms": [
        "The ladder becomes unsecured",
        "the ladder detaches from the roof",
        "the screws fail to hold the ladder in place."
      ],
      "odiNumbers": [
        "11471503"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Emergency Brake Release Cable Failure",
      "impact": "The failure of the emergency brake release cable can cause the trailer brakes to seize, leading to loss of control, accidents, and potential damage to the trailer and towing vehicle.",
      "symptoms": [
        "The trailer brakes seize",
        "the trailer is dragged behind the towing vehicle",
        "the wheels on the trailer smoke",
        "the brake release cable becomes caught underneath the towing vehicle",
        "the brake release cable detaches from the trailer at the switch."
      ],
      "odiNumbers": [
        "11220036"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Brake Controller Settings Issue",
      "impact": "Incorrect brake controller settings can cause the trailer brakes to malfunction, leading to loss of control, accidents, and potential damage to the trailer and towing vehicle.",
      "symptoms": [
        "The trailer brakes do not release properly",
        "the brake controller settings are not functioning correctly."
      ],
      "odiNumbers": [
        "11220036"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Breakaway Cable Disengagement",
      "impact": "The disengagement of the breakaway cable can cause the trailer brakes to seize, leading to loss of control, accidents, and potential damage to the trailer and towing vehicle.",
      "symptoms": [
        "The breakaway cable disengages from the trailer at the switch",
        "the cable becomes pinched under the bracket of the glider hitch."
      ],
      "odiNumbers": [
        "11220036"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}