{
  "totalComplaints": 22,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "STEERING",
    "AIR BAGS",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Thermostat Failure Causing Engine Temperature and Steering Issues",
      "impact": "The failure of the thermostat can cause the engine temperature to malfunction, leading to reduced power steering assist, loss of air conditioning, and potential engine damage. This can compromise vehicle safety, especially when driving.",
      "symptoms": [
        "The engine temperature gauge is stuck on cold",
        "loss of power steering",
        "loss of air conditioning",
        "\"Steering Assist is Reduced - Drive With Care\" message displayed on the dashboard."
      ],
      "odiNumbers": [
        "11571297",
        "11562723",
        "11551573",
        "11524476"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Faulty Safety Restraint System Warning",
      "impact": "The persistent warning to service the Safety Restraint System can be a distraction to the driver, potentially leading to accidents or near-misses. Additionally, if the system is not functioning properly, it may fail to deploy airbags in the event of a crash, putting occupants at risk of injury or death.",
      "symptoms": [
        "Repeated warnings to service the Safety Restraint System",
        "despite multiple dealership visits and repairs."
      ],
      "odiNumbers": [
        "11587791"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Failure of Side Airbags to Deploy",
      "impact": "The failure of side airbags to deploy in a crash can result in serious injury or death to occupants, particularly to the head and torso.",
      "symptoms": [
        "Side airbags do not deploy in a crash",
        "even when the vehicle is struck at a significant speed."
      ],
      "odiNumbers": [
        "11402680"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Takata Airbag Recall Concerns",
      "impact": "The recall of Takata airbags is a critical safety issue, as these airbags can rupture and send shrapnel into the passenger compartment, causing serious injury or death.",
      "symptoms": [
        "Concerns about the potential for Takata airbag recall",
        "which can lead to anxiety and uncertainty about the safety of the vehicle."
      ],
      "odiNumbers": [
        "11221934"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Missing Reinforced Jacking Points",
      "impact": "The absence of reinforced jacking points can cause the vehicle to fall off the jack, resulting in injury or death, and makes it difficult or impossible to change a tire or perform routine maintenance.",
      "symptoms": [
        "No visible reinforced jacking points on the vehicle",
        "inability to safely jack up the vehicle",
        "potential for the vehicle to fall off the jack."
      ],
      "odiNumbers": [
        "11516855"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Spontaneous Sunroof Shattering",
      "impact": "The sudden shattering of the sunroof can cause injury from flying glass, distract the driver, and potentially lead to accidents.",
      "symptoms": [
        "Sudden and unexpected shattering of the sunroof",
        "no apparent cause or warning signs",
        "glass debris inside the vehicle."
      ],
      "odiNumbers": [
        "11443433"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Sunroof Wind Noise and Pressure",
      "impact": "The excessive wind noise and pressure caused by the sunroof can be painful and potentially harmful to occupants, especially those with sensitive hearing, such as service dogs or elderly passengers.",
      "symptoms": [
        "Extremely loud wind noise and pressure when the sunroof is open",
        "typically between 40-45 mph",
        "painful or uncomfortable for occupants",
        "potential harm to sensitive hearing."
      ],
      "odiNumbers": [
        "11182597"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}