{
  "totalComplaints": 11,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "WHEELS",
    "EXTERIOR LIGHTING"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Brake Light Failure",
      "impact": "The failure of the brake light to illuminate during normal braking can cause other motorists to be unaware of the motorcycle's braking, increasing the risk of accidents.",
      "symptoms": [
        "The brake light does not illuminate during normal braking",
        "only illuminating when excessive brake pressure is used."
      ],
      "odiNumbers": [
        "11495399"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Front Brake Lever Inconsistency and Unwanted Brake Application",
      "impact": "The inconsistent front brake lever and unwanted brake application can cause unexpected reduction of speed, overheating of the front brake, and loss of control, increasing the risk of accidents.",
      "symptoms": [
        "The front brake lever is inconsistent",
        "the front brake applies itself without input",
        "and the brake can only be released by pulling the brake lever very hard and suddenly multiple times."
      ],
      "odiNumbers": [
        "11378689"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Warped Front Rotors and Brake Fluid Reservoir Leaks",
      "impact": "Warped front rotors and brake fluid reservoir leaks can cause uneven brake performance, overheating, and loss of brake function, increasing the risk of accidents.",
      "symptoms": [
        "The front rotors are warped",
        "the brake fluid reservoir is leaking",
        "and the brakes may pulse or grab unevenly."
      ],
      "odiNumbers": [
        "11364463",
        "11350508"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Uneven Front Brake Rotor Wear",
      "impact": "Uneven front brake rotor wear can cause the motorcycle to pulse severely when the front brake is applied, making it difficult to come to a smooth stop and increasing the risk of accidents.",
      "symptoms": [
        "The motorcycle pulses severely when the front brake is applied",
        "especially at low speeds",
        "and the problem becomes worse over time."
      ],
      "odiNumbers": [
        "11350508"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Rear Brake Issues",
      "impact": "Rear brake issues, such as overheating and sticky brake pins, can cause loss of brake function and increase the risk of accidents.",
      "symptoms": [
        "The rear brake pedal is hot",
        "and there may be a sticky white substance on the brake pins."
      ],
      "odiNumbers": [
        "11258178"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Warped Front Brake Rotors",
      "impact": "Warped front brake rotors can cause the motorcycle to lurch severely when the front brake is applied, leading to loss of control and increased stopping distance, which can result in accidents or injuries.",
      "symptoms": [
        "The motorcycle experiences a pulsing sensation or vibration when slowing down with the front brake",
        "especially at lower speeds; the front wheel and suspension lurch severely when the front brake is applied; the motorcycle is difficult to stop effectively without losing control."
      ],
      "odiNumbers": [
        "11384998",
        "11289506"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Failed Brake Light Switch",
      "impact": "A failed brake light switch can cause the brake lights to malfunction, increasing the risk of rear-end collisions and accidents, as well as failing state safety inspections.",
      "symptoms": [
        "Brake lights do not illuminate when the brake pedal is pressed",
        "brake lights remain illuminated even when the brake pedal is released",
        "brake lights flicker or malfunction intermittently."
      ],
      "odiNumbers": [
        "11591382"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}