{
  "totalComplaints": 29,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "ELECTRICAL SYSTEM",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 9,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Propulsion Power Reduction and Loss of Acceleration",
      "impact": "The sudden loss of propulsion power and acceleration can cause the vehicle to stall or lose power while in motion, increasing the risk of accidents or leaving the driver stranded.",
      "symptoms": [
        "Error messages \"Propulsion Power Reduced\" or \"Shift to Park\" appear on the dashboard",
        "sudden loss of acceleration",
        "inability to shift gears",
        "vehicle stalls or loses power while in motion."
      ],
      "odiNumbers": [
        "11592645",
        "11253876",
        "11163841",
        "11419273"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Intermittent Shift to Park Message and Failure to Recognize Park Gear",
      "impact": "The failure to recognize the park gear can cause the vehicle to remain running and energized after the driver thinks they have turned it off, increasing the risk of accidents or injuries.",
      "symptoms": [
        "Error message \"Shift to Park\" appears on the dashboard",
        "vehicle fails to recognize park gear",
        "vehicle remains running and energized after driver thinks they have turned it off",
        "difficulty turning off the vehicle."
      ],
      "odiNumbers": [
        "11481237",
        "11480860",
        "11477609",
        "11476249",
        "11475855",
        "11470514",
        "11430986",
        "11383858"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Transmission Failure and Loss of Power",
      "impact": "The failure of the transmission can cause the vehicle to lose power and acceleration, increasing the risk of accidents or leaving the driver stranded.",
      "symptoms": [
        "Sudden loss of acceleration",
        "inability to shift gears",
        "vehicle stalls or loses power while in motion",
        "error messages related to transmission failure."
      ],
      "odiNumbers": [
        "11558106",
        "11253876"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Shift to Park Issue",
      "impact": "The failure to properly shift into park can cause the vehicle to remain in a running state, posing a risk of accidents, injuries, or fires. Additionally, the inability to turn off the vehicle can lead to inconvenience, frustration, and potential safety risks.",
      "symptoms": [
        "The vehicle displays a message \"Attention Needed: Shift to Park\" or \"Shift to Park\" accompanied by audio alerts",
        "the vehicle cannot be turned off reliably",
        "the vehicle requires multiple attempts to shift into park",
        "the vehicle will not shut off until the shift handle is jiggled or the vehicle is restarted and re-set to park."
      ],
      "odiNumbers": [
        "11544689",
        "11461871",
        "11456829",
        "11413280"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Battery Control Module Failure",
      "impact": "The failure of the battery control module can cause the vehicle to stop running, leaving the driver stranded in traffic, which can lead to accidents or injuries.",
      "symptoms": [
        "The vehicle stops running",
        "the battery control module is defective",
        "the vehicle is unable to start or shut down properly."
      ],
      "odiNumbers": [
        "11487388"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Intermittent Remote Detection Issue",
      "impact": "The intermittent failure of remote detection can cause inconvenience and frustration, potentially leading to safety risks if the vehicle is not properly secured.",
      "symptoms": [
        "The vehicle displays a \"NO REMOTE DETECTED\" message",
        "even when the remote is present in the vehicle."
      ],
      "odiNumbers": [
        "11469129"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Brake System Failure",
      "impact": "The failure of the brake system can cause accidents, injuries, or fatalities, as the vehicle may not respond properly to braking inputs.",
      "symptoms": [
        "The vehicle slows down only slightly when the brake pedal is applied",
        "despite the wheels still rotating",
        "the vehicle does not stop properly",
        "the airbags deploy."
      ],
      "odiNumbers": [
        "11464877"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Transmission Shift to Park Error",
      "impact": "The transmission shift to park error can cause the vehicle to not shut off, leading to safety concerns and inconvenience to the driver.",
      "symptoms": [
        "The \"shift to park\" error message appears on the dashboard",
        "the vehicle does not shut off even when the shift lever is in park",
        "the error message persists despite wiggling the shift lever",
        "the error message clears after restarting the vehicle and shifting in and out of park."
      ],
      "odiNumbers": [
        "11557660",
        "11542776",
        "11528326",
        "11504523"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Brake System Fastener Non-Compliance",
      "impact": "The non-compliance with brake system fastener protocols can lead to safety risks, including brake failure, and compromise the reliability of the vehicle.",
      "symptoms": [
        "None reported",
        "as this is a concern about dealer service compliance with factory service manuals and potential safety risks."
      ],
      "odiNumbers": [
        "11532276"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}