{
  "totalComplaints": 19,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "ELECTRICAL SYSTEM",
    "VEHICLE SPEED CONTROL"
  ],
  "parsedComplaintsResultLength": 9,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Backup Camera Failure",
      "impact": "The failure of the rear backup camera can cause reduced visibility, increasing the risk of accidents, injuries, or fatalities, especially when reversing.",
      "symptoms": [
        "The rear backup camera displays a pink or multicolored screen",
        "the camera image is blurry or distorted",
        "the camera fails to display an image",
        "the camera only works intermittently",
        "the camera fails to work after opening and shutting the rear hatch."
      ],
      "odiNumbers": [
        "11571778",
        "11531755",
        "11502632",
        "11434735",
        "11434729"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Unexpected Acceleration and Cruise Control Issues",
      "impact": "Unexpected acceleration and cruise control malfunctions can cause loss of vehicle control, increasing the risk of accidents, injuries, or fatalities.",
      "symptoms": [
        "The vehicle accelerates unexpectedly",
        "the cruise control does not work correctly",
        "the vehicle speeds up after taking foot off the accelerator",
        "the vehicle accelerates between foot pedal braking."
      ],
      "odiNumbers": [
        "11545658"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "GPS and Charging Station Navigation Issues",
      "impact": "Malfunctioning GPS and charging station navigation can cause inconvenience, delay, and potentially strand drivers, especially those relying on electric vehicles.",
      "symptoms": [
        "The GPS system provides incorrect or outdated information",
        "the charging station navigation system is not dynamic",
        "the system displays \"out of range\" status despite being within range."
      ],
      "odiNumbers": [
        "11545658"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Sudden Battery Drain",
      "impact": "A sudden drop in battery percentage can cause the vehicle to lose power, leading to a loss of control, accidents, or stranding the driver.",
      "symptoms": [
        "The battery gauge suddenly drops from a normal level to a low level",
        "often accompanied by a warning light."
      ],
      "odiNumbers": [
        "11557509",
        "11428439"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Backup Camera Failure",
      "impact": "The failure of the backup camera can increase the risk of accidents or injuries, especially when reversing.",
      "symptoms": [
        "The backup camera image is intermittent or not working",
        "often accompanied by an error code (e.g.",
        "U111A-00)."
      ],
      "odiNumbers": [
        "11549490"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Sudden Unintended Braking",
      "impact": "Sudden unintended braking can cause accidents, loss of control, or injuries.",
      "symptoms": [
        "The vehicle applies sudden braking",
        "often accompanied by a warning light or symbol (e.g.",
        "a yellow warning and two cars crashing)."
      ],
      "odiNumbers": [
        "11520616"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Airbag Deployment and Loss of Vehicle Control",
      "impact": "The unexpected deployment of airbags can cause loss of control, accidents, or injuries.",
      "symptoms": [
        "The airbags deploy unexpectedly",
        "often accompanied by a loss of steering and braking functionality."
      ],
      "odiNumbers": [
        "11451220"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Forward Camera Overheating and Collision Avoidance System Failure",
      "impact": "The failure of the forward camera and collision avoidance system can increase the risk of accidents or injuries.",
      "symptoms": [
        "The vehicle reports that the forward camera is overheating",
        "rendering the collision avoidance system and ProPilot inoperative."
      ],
      "odiNumbers": [
        "11355182"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unintended Acceleration while using Adaptive Cruise Control",
      "impact": "The unintended acceleration of the vehicle while using adaptive cruise control can lead to accidents, injuries, or fatalities, especially in stop-and-go traffic or when following another vehicle closely.",
      "symptoms": [
        "The vehicle suddenly accelerates without input from the driver",
        "often when using adaptive cruise control in specific conditions such as light rain or intermittent wiper use",
        "and may require manual braking to avoid a collision."
      ],
      "odiNumbers": [
        "11561110"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}