{
  "totalComplaints": 12,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "POWER TRAIN",
    "VISIBILITY"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel Evaporator and Emission Control System Failure",
      "impact": "The failure of the fuel evaporator and emission control system can cause the vehicle to stall, hesitate, and have problems starting, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The vehicle stalls",
        "hesitates",
        "and has problems starting shortly after filling up the gas tank",
        "especially when the fuel level is low; the vehicle hesitates",
        "stalls",
        "and misfires when going uphill",
        "steep hills",
        "and when coming to a full stop; the vehicle hesitates and misfires during acceleration."
      ],
      "odiNumbers": [
        "11588190",
        "11548946"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electrical System Failure",
      "impact": "The failure of the electrical system can cause the horn to malfunction, leading to a distraction while driving, and can also cause other systems to malfunction, such as the dash radio, phone, and cruise control.",
      "symptoms": [
        "The horn goes off automatically when the car is started; the dash radio and phone are not working properly; the cruise control is not working."
      ],
      "odiNumbers": [
        "11457922"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Cruise Control System Failure",
      "impact": "The failure of the cruise control system can cause the vehicle to accelerate or decelerate unexpectedly, leading to loss of control and potential accidents.",
      "symptoms": [
        "The cruise control accelerates or decelerates unexpectedly; the vehicle lurches or surges while in cruise control; the engine throttles up and accelerates when the brake is applied."
      ],
      "odiNumbers": [
        "11353102"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Battery or Electrical System Failure",
      "impact": "The failure of the battery or electrical system can cause the vehicle to require frequent jump-starting, leading to inconvenience and potential safety risks.",
      "symptoms": [
        "The vehicle requires frequent jump-starting; the dealer is unable to diagnose the problem."
      ],
      "odiNumbers": [
        "11544897"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Turbocharger Failure",
      "impact": "Turbocharger failure can cause the vehicle to lose power, leading to difficulty accelerating, especially on hills and in traffic, which can increase the risk of accidents.",
      "symptoms": [
        "Engine light is on",
        "vehicle is sluggish",
        "RPMs run high",
        "error code P0299 (turbo under boost)",
        "difficulty accelerating",
        "loss of power."
      ],
      "odiNumbers": [
        "11584659"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Engine Performance Issues",
      "impact": "Engine performance issues can cause the vehicle to lose power, leading to difficulty accelerating, which can increase the risk of accidents.",
      "symptoms": [
        "Check engine light is on",
        "vehicle doesn't speed up past 75 mph",
        "gears change and jerk when trying to accelerate",
        "loss of power."
      ],
      "odiNumbers": [
        "11541919",
        "11367020"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Air Induction System Failure",
      "impact": "Air induction system failure can cause the engine and transmission system to malfunction, leading to a loss of power and increasing the risk of accidents.",
      "symptoms": [
        "Engine and transmission system not performing as expected",
        "issue detected in the air induction system",
        "loss of power",
        "difficulty accelerating."
      ],
      "odiNumbers": [
        "11367020"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Spontaneous Sunroof Shattering",
      "impact": "The sudden and unexpected shattering of the sunroof can cause a loud noise, distraction, and potentially lead to accidents or injuries from shattered glass.",
      "symptoms": [
        "Abnormal sound coming from the vehicle",
        "sudden and unexplained shattering of the sunroof",
        "glass debris inside the vehicle."
      ],
      "odiNumbers": [
        "11591408"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}