{
  "totalComplaints": 10,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "STRUCTURE",
    "SUSPENSION",
    "EQUIPMENT"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Propane Tank Mounting Bracket Failure",
      "impact": "The failure of the propane tank mounting bracket can cause the propane tank to become dislodged, leading to a potential explosion or fire hazard, which can result in serious injury or death.",
      "symptoms": [
        "Cracks or breaks in the propane tank mounting bracket",
        "particularly at the rear outer mount",
        "rust in the cracks",
        "and the propane tank becoming dislodged or angled while driving."
      ],
      "odiNumbers": [
        "11570186",
        "11556235",
        "11555667"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Windshield Stress Crack",
      "impact": "The stress crack in the windshield can cause the windshield to shatter or break, obstructing the driver's view and increasing the risk of accidents.",
      "symptoms": [
        "A vertical stress crack starting at the bottom-center of the windshield",
        "growing in length over time",
        "and originating from the same exact spot in multiple cases."
      ],
      "odiNumbers": [
        "11475083"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Propane Tank Mounting Bracket Failure",
      "impact": "The failure of the propane tank mounting bracket can cause the tank to detach, leading to a potential explosion or fire hazard, which can result in serious injury or death.",
      "symptoms": [
        "The propane tank is visible from the outside",
        "the tank is bouncing up and down while driving",
        "the tank is detached from its mounting bracket."
      ],
      "odiNumbers": [
        "11524335",
        "11524154"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Battery Shelf Weld Seam Failure",
      "impact": "The failure of the battery shelf weld seams can cause the batteries to fall off, potentially causing injury or damage to surrounding components.",
      "symptoms": [
        "Broken weld seams on the battery shelf",
        "batteries are loose or detached from the shelf."
      ],
      "odiNumbers": [
        "11482191"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Sway Bar Bolts Failure on Ford F-53 Chassis",
      "impact": "The failure of the sway bar bolts can cause the sway bar to detach, leading to damage to the brake line, potentially resulting in loss of braking ability, and increasing the risk of accidents.",
      "symptoms": [
        "Sway bar bolts come loose or fall out",
        "sway bar detaches",
        "brake line is damaged or torn",
        "ABS line is damaged or torn",
        "vehicle exhibits unstable or uneven handling."
      ],
      "odiNumbers": [
        "11416799",
        "11434734"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Parts Distribution Disconnect and Delayed Recall Repairs",
      "impact": "The delay in receiving recall repair parts can leave vehicles in an unsafe condition, potentially leading to accidents or injuries, and causing inconvenience to vehicle owners.",
      "symptoms": [
        "Vehicle owners are notified of a recall but parts are not available",
        "dealerships are unable to perform recall repairs due to lack of parts",
        "manufacturers fail to provide timely assistance or resolution."
      ],
      "odiNumbers": [
        "11434734"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Delayed Recall Repair for Equipment Issue",
      "impact": "The delayed repair of the equipment issue may lead to potential safety risks, as the contact is unaware of the exact nature of the problem, and the manufacturer has exceeded a reasonable amount of time for the recall repair.",
      "symptoms": [
        "No symptoms reported",
        "as the contact has not experienced a failure."
      ],
      "odiNumbers": [
        "11582989"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}