{
  "totalComplaints": 12,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "STRUCTURE",
    "TIRES",
    "SUSPENSION"
  ],
  "parsedComplaintsResultLength": 3,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Frame Failure and Structural Integrity Issues in RV Trailers",
      "impact": "The catastrophic failure of the frame or structural components can lead to a loss of control, accidents, or separation of the trailer from the towing vehicle, posing a significant risk to the safety of occupants and other road users.",
      "symptoms": [
        "Sudden and unexpected collapse or bending of the trailer's frame or structural components",
        "such as the tongue or crossmember",
        "while in motion or stationary."
      ],
      "odiNumbers": [
        "11572497",
        "11487728",
        "11426518"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Westlake Tires Tread Separation Failure",
      "impact": "The sudden and unexpected tread separation of the Westlake tires can cause loss of control, accidents, and potentially lead to injuries or fatalities. Additionally, the damage to the trailer and surrounding vehicles can result in significant financial losses.",
      "symptoms": [
        "The tire tread suddenly and completely separates from the casing",
        "often without warning",
        "while driving at moderate to high speeds (60-72 MPH). The tire may appear normal before the failure",
        "with no warning lights or signs of damage."
      ],
      "odiNumbers": [
        "11517675",
        "11513237",
        "11476853"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Frame Failure and Suspension Hanger Issues",
      "impact": "The failure of the frame and suspension hangers can cause the trailer to lose stability, potentially leading to accidents, injuries, or even tip-overs, especially when driving or towing.",
      "symptoms": [
        "Cracked frame",
        "broken frame section",
        "suspension hanger flipping over",
        "suspension failure",
        "bent or buckled front end of the A-Frame."
      ],
      "odiNumbers": [
        "11583201",
        "11425375"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}