{
  "totalComplaints": 16,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SEATS",
    "UNKNOWN OR OTHER",
    "ELECTRICAL SYSTEM",
    "VISIBILITY/WIPER",
    "FORWARD COLLISION AVOIDANCE"
  ],
  "parsedComplaintsResultLength": 11,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Driver Seat Lateral Movement/Looseness",
      "impact": "The excessive lateral movement or looseness of the driver seat can cause the driver to lose control of the vehicle, especially during sudden stops or turns, which can lead to accidents and potentially serious injuries.",
      "symptoms": [
        "The driver seat rocks back and forth",
        "has excessive play",
        "shifts back and forth when brakes are applied or the accelerator pedal is pressed",
        "feels loose or unstable."
      ],
      "odiNumbers": [
        "11576948",
        "11574117",
        "11491083",
        "11485072"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Sunroof/Moonroof Spontaneous Shattering",
      "impact": "The sudden shattering of the sunroof/moonroof can cause driver distraction, injury from shattered glass, and potentially lead to accidents.",
      "symptoms": [
        "The sunroof/moonroof suddenly shatters or explodes while driving",
        "without any apparent reason or warning."
      ],
      "odiNumbers": [
        "11586983"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Defective Air Conditioning (AC) Drain Design",
      "impact": "The inadequate design of the AC drain can cause electrical issues, water accumulation, and potentially lead to safety hazards, such as short circuits or fires.",
      "symptoms": [
        "The AC drain is missing or poorly designed",
        "causing water to accumulate and potentially leading to electrical issues",
        "water damage",
        "or other safety concerns."
      ],
      "odiNumbers": [
        "11511879"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Unknown/Unspecified Issue",
      "impact": "The lack of information about the issue makes it difficult to determine the potential impact on vehicle safety and performance.",
      "symptoms": [
        "No specific symptoms or details are provided about the issue."
      ],
      "odiNumbers": [
        "11435272"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Combination Meter Electronic Control Instrument Panel LCD Display Failure",
      "impact": "The frequent blanking of the LCD display can cause the driver to lose critical information about the vehicle's speed, fuel level, and other vital systems, which can lead to accidents or other safety issues.",
      "symptoms": [
        "The Instrument Panel LCD display frequently goes blank",
        "displaying no information to the driver."
      ],
      "odiNumbers": [
        "11510734"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "LED Light Assembly Failure (TRD Pro Tundra with Factory Rigid Lights)",
      "impact": "The loose and rattling LED lights can cause a distraction to the driver, potentially leading to accidents, and may also trigger Photosensitive Epilepsy seizures, which can cause serious injuries or death.",
      "symptoms": [
        "The LED lights rattle and flash erratically while driving over 40+mph or going over bumps",
        "causing a distraction to the driver."
      ],
      "odiNumbers": [
        "11471047"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Electrical System Fire (Dash and Electrical Components)",
      "impact": "The unexpected electrical fire can cause damage to the vehicle's electrical systems, potentially leading to accidents, injuries, or fatalities.",
      "symptoms": [
        "The hazard lights turn on unexpectedly",
        "and the cab of the truck fills with black smoke",
        "indicating an electrical fire."
      ],
      "odiNumbers": [
        "11450576"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Windshield Wiper Arm Failure",
      "impact": "The failure of the windshield wiper arm can cause reduced visibility while driving, especially during inclement weather, which can lead to accidents and safety issues.",
      "symptoms": [
        "The windshield wiper arm stops working",
        "the arm strips out",
        "the wiper arm does not move",
        "the wiper arm does not clear the windshield effectively."
      ],
      "odiNumbers": [
        "11510463",
        "11467015"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Windshield Material Failure",
      "impact": "The failure of the windshield material can cause cracks and breaks, reducing visibility and potentially leading to accidents, especially during inclement weather.",
      "symptoms": [
        "Small chips or pebbles cause large cracks in the windshield",
        "the windshield material seems prone to failure",
        "the windshield cracks or breaks easily."
      ],
      "odiNumbers": [
        "11471227"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Erroneous Pre-Collision Warning System Activation",
      "impact": "The unnecessary activation of the pre-collision warning system can cause driver distraction, potentially leading to accidents or near-misses.",
      "symptoms": [
        "The pre-collision warning system activates without any apparent reason",
        "such as the presence of other vehicles",
        "pedestrians",
        "or animals",
        "and may occur repeatedly in the same location."
      ],
      "odiNumbers": [
        "11576943"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Failure of Rear Brake Lights to Illuminate during Adaptive Cruise Control",
      "impact": "The failure of the rear brake lights to illuminate during adaptive cruise control can increase the risk of rear-end collisions, as following vehicles may not be aware of the slowing or stopping of the subject vehicle.",
      "symptoms": [
        "The rear brake lights do not illuminate when the vehicle slows down or stops independently while using adaptive cruise control",
        "despite the vehicle's deceleration."
      ],
      "odiNumbers": [
        "11452427"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}