{
  "totalComplaints": 24,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ENGINE",
    "ELECTRICAL SYSTEM",
    "POWER TRAIN"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Delayed Recall Repair for Engine and Back Over Prevention",
      "impact": "The delay in recall repair can lead to potential safety risks, including engine failure and increased risk of accidents, as well as reduced visibility and increased risk of injury or death due to back over prevention system malfunction.",
      "symptoms": [
        "None reported",
        "as the issue is related to the delay in recall repair rather than a specific symptom."
      ],
      "odiNumbers": [
        "11566528",
        "11558315",
        "11554905",
        "11551644",
        "11550668",
        "11533980",
        "11532733"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Engine Stalling or Shutting Off While in Motion",
      "impact": "The engine stalling or shutting off while in motion can increase the risk of accidents, including rear-end collisions, and potentially cause injuries or fatalities.",
      "symptoms": [
        "The engine stops randomly and without warning while the vehicle is in motion",
        "with no warning signs or symptoms prior to the failure."
      ],
      "odiNumbers": [
        "11532864"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Electrical System Failure",
      "impact": "The failure of the electrical system can cause the vehicle to stall or shut down while driving, leading to accidents or leaving the driver stranded.",
      "symptoms": [
        "The vehicle stops without warning",
        "the power shuts off",
        "the battery light comes on",
        "the Start/Stop light blinks",
        "the vehicle cannot start or switch gears to neutral",
        "the wheels lock up",
        "the vehicle is unable to move."
      ],
      "odiNumbers": [
        "11512303",
        "11498720",
        "11515053"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Memory Seat Failure",
      "impact": "The failure of the memory seat system can cause distractions while driving, leading to accidents.",
      "symptoms": [
        "The memory seat moves on its own while driving",
        "the seat fails to retain memory settings",
        "the seat motor must be replaced multiple times",
        "the seat pushes the driver forward onto the dashboard while driving."
      ],
      "odiNumbers": [
        "11571059"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Wiring Harness Failure",
      "impact": "The failure of the wiring harness can cause intermittent electrical issues, leading to accidents or leaving the driver stranded.",
      "symptoms": [
        "The electrical connector and wiring harness melt due to close proximity to the exhaust pipe",
        "intermittent parking brake fault messages appear",
        "the check engine light comes on",
        "the wiring harness is damaged due to heat exposure."
      ],
      "odiNumbers": [
        "11553328"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}