{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "ELECTRICAL SYSTEM",
    "STRUCTURE",
    "SUSPENSION"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Gel Coat Stress Crack under Kitchen Slide",
      "impact": "The stress crack in the gel coat under the kitchen slide can lead to water intrusion, damage to the RV's interior, and potentially cause safety hazards.",
      "symptoms": [
        "Visible crack in the gel coat under the kitchen slide."
      ],
      "odiNumbers": [
        "11587317"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Failure to Disclose and Remediate Open Recalls",
      "impact": "Selling an RV with unremedied recalls can lead to safety risks for the occupants, and failure to disclose open recalls can result in buyers being unaware of potential hazards.",
      "symptoms": [
        "Keystone RV Company and General RV provided different recall remedy dates",
        "and the customer was not informed of the open recall at delivery."
      ],
      "odiNumbers": [
        "11572434"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Insignia Stove Oven Failure to Shut Off",
      "impact": "The inability to shut off the oven can cause a safety hazard, as it can lead to overheating, gas leaks, and potential fires.",
      "symptoms": [
        "The oven knob cannot be turned lower than 250°F",
        "and the oven cannot be shut off; the pilot light remains lit even after attempting to shut off the oven."
      ],
      "odiNumbers": [
        "11529681"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Defective 50-Amp Cord Reel",
      "impact": "The defective cord reel can cause electrical power issues, potentially leading to electrical fires, which can result in damage to the RV and pose a risk to the occupants' safety.",
      "symptoms": [
        "No power or intermittent power supply to the internal fuse panel",
        "arcing or corrosion at the power connection",
        "only one leg of power making it to the fuse panel."
      ],
      "odiNumbers": [
        "11587096"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Battery Overheating and Hydrogen Sulfide Fume Emission",
      "impact": "The overheating battery can cause hydrogen sulfide fumes to enter the RV coach, posing a risk to the occupants' health and safety.",
      "symptoms": [
        "Overheating battery",
        "hydrogen sulfide fumes entering the RV coach",
        "potentially causing respiratory issues or other health problems."
      ],
      "odiNumbers": [
        "11585951"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Frame Flex and Aluminum Frame Weld Failure",
      "impact": "The failure of the aluminum frame welds can cause cracks to form, leading to structural integrity issues, which can result in catastrophic failure of the trailer while in motion, potentially causing accidents and fatalities.",
      "symptoms": [
        "Cracks forming diagonally from the lower corner of the outside of the slide out",
        "frame flexing",
        "and potential collapse of the trailer's structure."
      ],
      "odiNumbers": [
        "11585968",
        "11569762"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Stress Crack under Kitchen Slideout",
      "impact": "The stress crack under the kitchen slideout can lead to water intrusion, damage to the interior, and potentially cause structural integrity issues, compromising the overall safety and performance of the vehicle.",
      "symptoms": [
        "Visible cracks or damage under the kitchen slideout",
        "water leakage",
        "interior damage",
        "and potential structural issues."
      ],
      "odiNumbers": [
        "11585717"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}