{
  "totalComplaints": 16,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "ELECTRICAL SYSTEM",
    "WHEELS",
    "VISIBILITY/WIPER"
  ],
  "parsedComplaintsResultLength": 12,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Infotainment System Glitch",
      "impact": "The infotainment system glitch can cause a distracting screen to appear, covering all vehicle information, which can lead to accidents or near-misses due to driver distraction.",
      "symptoms": [
        "The screen appears 10 minutes after starting the car",
        "covering all vehicle information",
        "and can only be closed by repeatedly tapping the X and left bar."
      ],
      "odiNumbers": [
        "11581900"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Frozen Door Sensor",
      "impact": "The frozen door sensor can prevent the driver's door from opening, making it difficult or impossible to exit the vehicle, which can lead to hazardous situations, especially in strong winds.",
      "symptoms": [
        "The driver's door refuses to open when the temperature drops below freezing",
        "and the sensor appears to freeze",
        "preventing the door from opening externally."
      ],
      "odiNumbers": [
        "11557308"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Spontaneous Shattering of Panoramic Roof",
      "impact": "The spontaneous shattering of the panoramic roof can cause sudden and unexpected noise, startling the driver and potentially leading to accidents or near-misses.",
      "symptoms": [
        "The rear section of the panoramic roof shatters suddenly",
        "without apparent cause",
        "and can be held together temporarily with masking tape."
      ],
      "odiNumbers": [
        "11545044"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unintended Acceleration",
      "impact": "The unintended acceleration can cause accidents or near-misses, especially in situations where the vehicle is stopped or moving slowly.",
      "symptoms": [
        "The vehicle accelerates suddenly",
        "even when the brake pedal is being held",
        "and can cause collisions or other accidents."
      ],
      "odiNumbers": [
        "11527971"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Infotainment System Connectivity Issues",
      "impact": "The infotainment system connectivity issues can cause frustration and distraction for the driver, potentially leading to accidents or near-misses.",
      "symptoms": [
        "The infotainment system fails to connect to the phone or CarPlay",
        "requiring the driver to turn the screen off and on multiple times or restart the car."
      ],
      "odiNumbers": [
        "11527610"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Inadequate Side Mirror Visibility",
      "impact": "The inadequate side mirror visibility can cause accidents or near-misses, especially when reversing, due to the lack of visibility of small children, pedestrians, or pets.",
      "symptoms": [
        "The driver-side mirror does not articulate inward enough",
        "preventing the driver from seeing the side of the vehicle or an area near the side of the vehicle",
        "especially for shorter drivers."
      ],
      "odiNumbers": [
        "11496648"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Safety Recall with No Remedy",
      "impact": "The lack of a remedy for the safety recall can leave the vehicle unusable, causing inconvenience and potentially putting the driver and passengers at risk.",
      "symptoms": [
        "No symptoms are reported",
        "as the issue is related to the recall itself."
      ],
      "odiNumbers": [
        "11577482"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electrical System Failure",
      "impact": "The electrical system failure can cause the vehicle to become inoperable, potentially trapping occupants inside, and may lead to accidents or other safety risks.",
      "symptoms": [
        "The vehicle fails to start",
        "doors lock automatically",
        "and cannot be opened manually",
        "requiring a manual release or external tools."
      ],
      "odiNumbers": [
        "11554781",
        "11495096"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Auxiliary Battery Failure",
      "impact": "The failure of the auxiliary battery can cause the electric door locks to malfunction, potentially trapping occupants inside, and may lead to accidents or other safety risks.",
      "symptoms": [
        "The vehicle locks occupants out",
        "the electric door locks do not operate",
        "and the vehicle requires a manual procedure to unlock the driver door."
      ],
      "odiNumbers": [
        "11554781",
        "11495096"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Lock System Failure",
      "impact": "The lock system failure can cause the vehicle to become inoperable, potentially trapping occupants inside, and may lead to accidents or other safety risks.",
      "symptoms": [
        "The doors automatically lock",
        "and the vehicle does not allow opening even with the key card inside",
        "requiring an external hard key to gain access."
      ],
      "odiNumbers": [
        "11511252"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Lug Bolt Failure/Loss of Wheel",
      "impact": "The failure of the lug bolts or improper installation can cause the wheel to come loose and separate from the vehicle while in motion, leading to accidents, injuries, or fatalities.",
      "symptoms": [
        "The wheel and tire suddenly detach from the vehicle",
        "the vehicle pulls to one side",
        "unusual noises or vibrations while driving",
        "loss of control or stability."
      ],
      "odiNumbers": [
        "11547533",
        "11543722"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Excessive Vibration of Driver-Side Mirror",
      "impact": "The excessive vibration of the driver-side mirror can cause a distorted view, leading to a serious safety concern, particularly at night when blurry lights can make it difficult to see approaching cars. This can increase the risk of collision and put the driver and others at risk. Additionally, the vibration can cause carsickness and discomfort while driving.",
      "symptoms": [
        "The driver-side mirror shakes excessively",
        "vibrates constantly",
        "and causes a blurry view",
        "making it difficult to see cars or objects at a distance",
        "especially at night. The vibration can also cause carsickness and discomfort while driving."
      ],
      "odiNumbers": [
        "11495710",
        "11486471"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}