{
  "totalComplaints": 13,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "UNKNOWN OR OTHER",
    "STRUCTURE",
    "POWER TRAIN"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Delayed Recall Repair for Electrical System (NHTSA Campaign Number: 23V478000)",
      "impact": "The delay in recall repair for the electrical system can lead to potential safety risks, as the issue may cause electrical system failures, which can increase the risk of accidents or fires.",
      "symptoms": [
        "None reported",
        "as the issue is related to a recall notification and the contact has not experienced a failure."
      ],
      "odiNumbers": [
        "11579753",
        "11575861",
        "11563548",
        "11559943"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Unintended Acceleration",
      "impact": "Unintended acceleration can cause loss of control, accidents, and damage to the vehicle and surrounding property, posing a significant safety risk to the driver and others.",
      "symptoms": [
        "Sudden and unexpected acceleration",
        "vehicle crashes into objects",
        "inability to stop the vehicle",
        "feeling of loss of control."
      ],
      "odiNumbers": [
        "11586064"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Brake System Failure",
      "impact": "The failure of the brake system can cause loss of control, accidents, and damage to the vehicle and surrounding property, posing a significant safety risk to the driver and others.",
      "symptoms": [
        "Vehicle does not stop when expected",
        "skids forward",
        "jumps forward",
        "traction control light illuminates",
        "loss of braking power for a short period."
      ],
      "odiNumbers": [
        "11568304"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Remote Start System Failure",
      "impact": "The failure of the remote start system can cause inconvenience, especially in rural areas with limited internet service, and can lead to safety issues, such as being unable to start the vehicle in extreme weather conditions, making it difficult to access the vehicle.",
      "symptoms": [
        "Remote start feature does not work",
        "requires internet service and cell phone coverage",
        "owner's manual does not provide clear instructions",
        "no warning lights or messages indicate the feature is not functioning."
      ],
      "odiNumbers": [
        "11567083"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Spontaneous Sunroof/Moonroof Shattering",
      "impact": "The sudden and unexpected shattering of the sunroof/moonroof can cause a loud noise, potentially startling the driver and leading to loss of control, and may also result in debris falling into the vehicle, creating a distraction or obstructing the driver's view.",
      "symptoms": [
        "The sunroof/moonroof suddenly shatters or explodes without any apparent reason or warning",
        "often accompanied by a loud noise and a sudden increase in pressure inside the vehicle."
      ],
      "odiNumbers": [
        "11547608",
        "11484488"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unintended Vehicle Movement in Reverse",
      "impact": "The vehicle moving unexpectedly in reverse can cause accidents, injuries, or fatalities, especially if the driver is not prepared or if there are pedestrians or obstacles behind the vehicle.",
      "symptoms": [
        "The vehicle starts moving in reverse with the foot on the brake pedal",
        "the vehicle moves unexpectedly in reverse without driver input",
        "the vehicle fails to respond to brake pedal input."
      ],
      "odiNumbers": [
        "11500714"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Pre-Collision Braking System Malfunction",
      "impact": "The malfunctioning pre-collision braking system can cause unexpected vehicle behavior, leading to accidents or near-misses, especially in heavy traffic or when turning onto busy streets.",
      "symptoms": [
        "The vehicle slows down or fails to accelerate when trying to turn onto a busy street",
        "the vehicle \"gently rolls\" into oncoming traffic",
        "the driver is unable to override the system",
        "the vehicle behaves as if the engine has died",
        "the vehicle fails to respond to driver input."
      ],
      "odiNumbers": [
        "11463453"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}