{
  "totalComplaints": 23,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "ELECTRICAL SYSTEM",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Transfer Case Failure",
      "impact": "The failure of the transfer case can cause the vehicle to not operate properly in any mode of 4-wheel drive, leading to loss of control and increased risk of accidents.",
      "symptoms": [
        "The vehicle violently jerks at slow speed while turning",
        "the transfer case fails during hard braking in wet conditions",
        "the vehicle is unable to operate properly in any mode of 4-wheel drive."
      ],
      "odiNumbers": [
        "11581203",
        "11570813"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Brake System Failure",
      "impact": "The failure of the brake system can cause the vehicle to be unable to stop in an emergency braking situation, leading to accidents and injuries.",
      "symptoms": [
        "Soft brake pedal pressure",
        "the brakes have to be pumped to get enough braking power to stop the vehicle",
        "the rear brakes wear at a much greater rate than the front brakes",
        "the rear rotors are warped",
        "the rear brakes stick at a stop and release when the throttle is applied."
      ],
      "odiNumbers": [
        "11578755"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Front Differential Failure",
      "impact": "The failure of the front differential can cause the vehicle to surge and leak fluid, leading to loss of control and increased risk of accidents.",
      "symptoms": [
        "The vehicle surges",
        "an abnormal sound comes from the vehicle",
        "fluid leaks from the engine compartment."
      ],
      "odiNumbers": [
        "11570813"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Transmission Oil Cooler Line Failure",
      "impact": "The failure of the transmission oil cooler line can cause the vehicle to stop accelerating, leading to loss of control and increased risk of accidents.",
      "symptoms": [
        "The transmission oil coolant rubs against the engine oil coolant line",
        "causing one or both lines to leak out",
        "the vehicle will just stop accelerating."
      ],
      "odiNumbers": [
        "11485953"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Shifter Malfunction",
      "impact": "The malfunction of the transmission shifter can cause the vehicle to not allow the driver to lock the vehicle, and may lead to unexpected shifting or loss of control, which can increase the risk of accidents or injuries.",
      "symptoms": [
        "Receiving \"Shift to Park\" messages",
        "inability to lock the vehicle",
        "having to wiggle the shifter to clear the message",
        "unexpected engagement of the electronic parking brake."
      ],
      "odiNumbers": [
        "11584393",
        "11574133"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electronic Parking Brake Malfunction",
      "impact": "The malfunction of the electronic parking brake can cause the brake to engage unexpectedly, which can lead to loss of vehicle control, accidents, or injuries, especially if it occurs while driving at speed.",
      "symptoms": [
        "Electronic parking brake engages unexpectedly",
        "vehicle feels and sounds as though the parking brake has been applied",
        "intermittent occurrence of the issue."
      ],
      "odiNumbers": [
        "11574133"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Intentional Power Reduction by Onboard Computer",
      "impact": "The intentional power reduction by the onboard computer can cause a loss of power, which can increase the risk of accidents, especially when merging onto a busy road or highway.",
      "symptoms": [
        "Sudden loss of power",
        "inability to accelerate",
        "warning messages or lights indicating a repair is needed."
      ],
      "odiNumbers": [
        "11563849"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Tailgate Open Message and Unintended Tailgate Opening",
      "impact": "The unintended opening of the tailgate can cause damage to the vehicle and potentially lead to loss of cargo or trailer detachment, which can result in accidents or injuries.",
      "symptoms": [
        "Receiving tailgate open messages despite the tailgate being closed",
        "tailgate opening unexpectedly while towing a trailer",
        "damage to the tailgate or surrounding components."
      ],
      "odiNumbers": [
        "11581193"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Backup Camera Misalignment",
      "impact": "The misalignment of the backup camera guidelines can cause difficulty when reversing, potentially leading to accidents or injuries.",
      "symptoms": [
        "Backup camera guidelines do not line up center with the vehicle",
        "making it difficult to judge distances and reversing trajectory."
      ],
      "odiNumbers": [
        "11579406"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Unprotected Framing Piece in Truck Bed",
      "impact": "The unprotected framing piece in the truck bed can cause damage to the vehicle, lead to rust, and potentially compromise the security of the vehicle.",
      "symptoms": [
        "Small objects",
        "such as keys",
        "can fall into the framing piece and become lodged",
        "potentially causing damage or rust; debris",
        "moisture",
        "or water can enter the framing piece",
        "increasing the likelihood of rust."
      ],
      "odiNumbers": [
        "11535022"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}