{
  "totalComplaints": 22,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "STEERING",
    "UNKNOWN OR OTHER",
    "ELECTRICAL SYSTEM",
    "AIR BAGS"
  ],
  "parsedComplaintsResultLength": 12,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Power Steering System Failure",
      "impact": "The failure of the power steering system can cause unintended speed increases, loss of control, and accidents, especially when reversing or turning at low speeds.",
      "symptoms": [
        "The engine surges or revs up when turning the steering wheel",
        "especially when idling in gear",
        "the steering wheel vibrates or shakes at certain speeds",
        "the vehicle experiences unintended speed increases when turning."
      ],
      "odiNumbers": [
        "11591263",
        "11584324",
        "11536202"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Steering System Leak",
      "impact": "A leak in the steering system can cause loss of power steering assist, making it difficult to steer the vehicle, which can lead to accidents or loss of control.",
      "symptoms": [
        "A leak is noticed coming from the steering wheel",
        "the power steering system fails to function properly."
      ],
      "odiNumbers": [
        "11592382"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Recall Repair Delay",
      "impact": "The delay in recall repair can leave vehicles on the road with known safety issues, increasing the risk of accidents or injuries.",
      "symptoms": [
        "The contact receives notification of a recall but the necessary parts are not available",
        "the manufacturer exceeds a reasonable amount of time for the recall repair."
      ],
      "odiNumbers": [
        "11545975"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Poor Backup Camera Quality",
      "impact": "The poor quality of the backup camera can reduce visibility, increasing the risk of accidents or injuries when reversing.",
      "symptoms": [
        "The camera display is gritty and grainy",
        "making it difficult to see objects behind the vehicle."
      ],
      "odiNumbers": [
        "11580912"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Axle Separation Recall with No Remedy",
      "impact": "The potential axle separation can cause loss of vehicle control, increasing the risk of accidents or injuries.",
      "symptoms": [
        "None reported",
        "as the issue is related to a recall with no current remedy."
      ],
      "odiNumbers": [
        "11577169"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Door Not Holding in Open Position",
      "impact": "The door not holding in the open position can cause injury to the driver or passengers, especially on inclined surfaces.",
      "symptoms": [
        "The driver-side door closes suddenly on the driver's legs when parked on an inclined surface",
        "causing bruises and discomfort."
      ],
      "odiNumbers": [
        "11540191"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unwanted Vehicle Stability Control Engagement",
      "impact": "The unwanted engagement of the Vehicle Stability Control system can cause loss of vehicle control, increasing the risk of accidents or injuries.",
      "symptoms": [
        "The Vehicle Stability Control system engages unexpectedly when cornering and braking on dry pavement",
        "causing a startling event that can be hazardous."
      ],
      "odiNumbers": [
        "11537882"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rodent Damage to Wiring Harness",
      "impact": "Rodent damage to the wiring harness can cause electrical system failures, which can lead to a loss of critical vehicle functions, such as power steering, brakes, or airbags, increasing the risk of accidents.",
      "symptoms": [
        "None",
        "as the damage may not be apparent until a system failure occurs; however",
        "signs of rodent infestation",
        "such as chewed wires or droppings",
        "may be present."
      ],
      "odiNumbers": [
        "11572480",
        "11558608"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Heater Blower Motor Failure",
      "impact": "Failure of the heater blower motor can cause a fire hazard, filling the cabin with toxic electrical smoke, which can lead to respiratory problems or even fatalities.",
      "symptoms": [
        "The heater blower motor produces a burning smell",
        "the cabin fills with smoke",
        "the fan motor is inoperable",
        "the heating system is malfunctioning."
      ],
      "odiNumbers": [
        "11566373"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Airbag Failure to Deploy",
      "impact": "The failure of the airbag to deploy in the event of a crash can lead to serious injury or even death, as it compromises the safety of the driver and passengers.",
      "symptoms": [
        "Airbags fail to deploy in a crash",
        "despite meeting the deployment criteria",
        "potentially resulting in injuries or fatalities."
      ],
      "odiNumbers": [
        "11542736",
        "11519541"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Delayed Recall Remedy for Airbag Defect",
      "impact": "The delay in providing a remedy for a known airbag defect can put drivers and passengers at risk of injury or death, as they continue to operate their vehicles without a functioning airbag.",
      "symptoms": [
        "Owners are notified of an airbag recall but are unable to schedule a repair due to a lack of available remedy",
        "causing anxiety and fear of driving the vehicle."
      ],
      "odiNumbers": [
        "11552104"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Brake Failure",
      "impact": "The sudden failure of the brakes can lead to accidents, injuries, or fatalities, as the driver loses control of the vehicle.",
      "symptoms": [
        "The brakes fail to engage or respond to pedal input",
        "causing the vehicle to continue moving without slowing down",
        "even when the emergency brake is applied."
      ],
      "odiNumbers": [
        "11519541"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}