{
  "totalComplaints": 22,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "ELECTRICAL SYSTEM",
    "FUEL/PROPULSION SYSTEM"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Exhaust System Failure",
      "impact": "The failure of the exhaust system can cause carbon monoxide to leak into the vehicle, posing a significant risk to the health and safety of the occupants.",
      "symptoms": [
        "The exhaust pipe",
        "gaskets",
        "and muffler are faulty",
        "causing a loud sound from the engine and a strong smell of exhaust inside the vehicle."
      ],
      "odiNumbers": [
        "11579788"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Transmission Failure",
      "impact": "The failure of the transmission can cause the vehicle to become stuck in a single gear, leading to loss of control and increasing the risk of accidents.",
      "symptoms": [
        "The transmission and valve box stop functioning",
        "causing the vehicle to become stuck in 1st gear",
        "and the vehicle may not respond to gear shifts."
      ],
      "odiNumbers": [
        "11568174",
        "11529115"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Unintended Vehicle Movement",
      "impact": "The unintended movement of the vehicle can cause accidents, injuries, and damage to property.",
      "symptoms": [
        "The vehicle moves forward or backward without the driver's input",
        "even when the transmission is in park or neutral",
        "and the driver may not be able to stop the vehicle using the brakes."
      ],
      "odiNumbers": [
        "11555218"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Power Train Recall Issues",
      "impact": "The delay in repairing the power train recall can increase the risk of accidents and injuries due to transmission failures.",
      "symptoms": [
        "The vehicle is subject to a power train recall",
        "but the parts are not available",
        "and the manufacturer has exceeded a reasonable amount of time for the recall repair."
      ],
      "odiNumbers": [
        "11550554",
        "11540762",
        "11526005",
        "11525616"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Unusual Alarm Sounds",
      "impact": "The unusual alarm sounds can be a symptom of a larger system malfunction, which can increase the risk of accidents and injuries.",
      "symptoms": [
        "The vehicle produces a strange alarm sound at random times",
        "which is louder and faster than normal warnings",
        "and there is no warning on the display indicating the cause of the alarm."
      ],
      "odiNumbers": [
        "11555218"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Infotainment System Failure",
      "impact": "The failure of the infotainment system can cause distractions while driving, leading to potential accidents, and can also result in the loss of important safety features such as the rearview camera.",
      "symptoms": [
        "The rearview camera display switches to a globe view",
        "noise in the vehicle when driving over 40 mph",
        "stereo screen glitches",
        "and Apple CarPlay connectivity issues."
      ],
      "odiNumbers": [
        "11556522"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Alternator Failure",
      "impact": "The failure of the alternator can cause the vehicle to stall, leading to potential accidents, especially on busy highways with limited access to services.",
      "symptoms": [
        "The \"Battery Saver Mode Activated\" message appears",
        "low battery voltage",
        "and the battery light comes on with a warning message \"Charging system low. Vehicle could stall anytime.\""
      ],
      "odiNumbers": [
        "11539607"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Electrical Wiring Issue",
      "impact": "The electrical wiring issue can cause the check engine light to come on, leading to potential safety issues if ignored, and can also cause damage to the vehicle's electrical system.",
      "symptoms": [
        "The check engine light comes on",
        "and inspection reveals that wires from the computer are rubbing/melting against a hot surface in the engine/transmission."
      ],
      "odiNumbers": [
        "11532899"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unidentified Noise from Front Area",
      "impact": "The unidentified noise from the front area may indicate a potential issue with the vehicle's plumbing or exhaust system, which can lead to a loss of propulsion or other safety-critical failures.",
      "symptoms": [
        "A strong",
        "unknown sound is heard coming from the pipes in the front area of the vehicle when starting the engine."
      ],
      "odiNumbers": [
        "11588130"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Loss of Propulsion and/or Mechanical Park",
      "impact": "The sudden loss of propulsion and/or mechanical park can increase the risk of a crash or roll-away, potentially causing injuries or fatalities.",
      "symptoms": [
        "The vehicle unexpectedly loses power or the ability to engage park",
        "making it difficult or impossible to control the vehicle."
      ],
      "odiNumbers": [
        "11547774"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}