{
  "totalComplaints": 10,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "UNKNOWN OR OTHER",
    "SERVICE BRAKES",
    "VEHICLE SPEED CONTROL",
    "ENGINE"
  ],
  "parsedComplaintsResultLength": 11,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Unintended Engine Shut-Off",
      "impact": "The sudden and unexpected shut-off of the engine while driving can cause loss of control, accidents, and potentially life-threatening situations, especially when occurring in intersections or while merging with traffic.",
      "symptoms": [
        "The engine cuts off while driving",
        "often without warning",
        "and may occur at random times",
        "such as when accelerating from a stop",
        "backing out of a parking spot",
        "or while idling in neutral. The vehicle may also experience a sudden loss of power",
        "stalling",
        "or failure to restart."
      ],
      "odiNumbers": [
        "11573794",
        "11572589"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electrical System Malfunctions",
      "impact": "The various electrical system malfunctions can cause a range of safety issues, including unexpected movements, loss of control, and distractions while driving.",
      "symptoms": [
        "The vehicle may experience unexpected events",
        "such as windows rolling down on their own",
        "the tailgate opening or closing unexpectedly",
        "or the vehicle \"bucking\" or jerking while in motion. Other symptoms include loud",
        "unexplained noises",
        "flickering dashboard lights",
        "and loss of audio or navigation functionality."
      ],
      "odiNumbers": [
        "11514836"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Infotainment System Glitches",
      "impact": "The infotainment system malfunctions can cause distractions while driving, lead to navigation errors, and potentially cause accidents.",
      "symptoms": [
        "The navigation system may become stuck or lost",
        "failing to provide accurate directions. The audio system may experience sudden volume loss or unexpected changes in volume. Apple CarPlay may also fail to connect to the vehicle's system."
      ],
      "odiNumbers": [
        "11514836"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Inaccurate Navigation System",
      "impact": "The navigation system's incorrect location display can cause confusion, disorientation, and potentially lead to accidents, especially when driving in unfamiliar areas.",
      "symptoms": [
        "The navigation system shows the vehicle's location 5 to 100+ miles from its actual location",
        "often in the middle of a field or off-road",
        "and affects the maps on connected devices like iPhones."
      ],
      "odiNumbers": [
        "11562174"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Unintended Vehicle Stopping",
      "impact": "The sudden and unexpected stopping of the vehicle can increase the risk of accidents, especially when driving in heavy traffic or at high speeds.",
      "symptoms": [
        "The vehicle stops suddenly at red lights or when slowing in traffic without warning",
        "requiring the driver to stop the car",
        "put it in park",
        "and restart the engine."
      ],
      "odiNumbers": [
        "11546246"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Spontaneous Sunroof Shattering",
      "impact": "The sudden shattering of the sunroof can cause injuries to occupants, especially if the glass fragments enter the cabin, and potentially affect other drivers on the road.",
      "symptoms": [
        "The panoramic sunroof explodes without warning",
        "even when the sunroof cover is closed",
        "and can be caused by excessive heat."
      ],
      "odiNumbers": [
        "11543181"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Sudden Engine Shutdown While Driving",
      "impact": "The sudden shutdown of the engine while driving can cause loss of power steering and braking, leading to a loss of control, and increasing the risk of accidents, especially when driving at high speeds.",
      "symptoms": [
        "The engine shuts off randomly while driving",
        "the vehicle stalls while driving",
        "the vehicle loses power while driving",
        "the vehicle shuts off without warning."
      ],
      "odiNumbers": [
        "11590253"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Abnormal Brake Noise and Performance",
      "impact": "The loud brake noise and abnormal brake performance can indicate a potential safety risk, as it may lead to reduced stopping power, increased stopping distance, and increased risk of accidents.",
      "symptoms": [
        "Loud grinding or screeching noise when applying the brakes",
        "vibrations or shaking when braking",
        "brake pads wear out prematurely",
        "uneven brake rotor wear."
      ],
      "odiNumbers": [
        "11590253",
        "11563187"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Brake Rotor Warping or Failure",
      "impact": "Warped or failed brake rotors can cause the vehicle to vibrate or shake when braking, leading to reduced stopping power, increased stopping distance, and increased risk of accidents.",
      "symptoms": [
        "Vibrations or shaking when braking",
        "uneven brake rotor wear",
        "loud grinding or screeching noise when applying the brakes."
      ],
      "odiNumbers": [
        "11590253"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Intermittent Engine Stalling",
      "impact": "The intermittent engine stalling can cause the vehicle to suddenly lose power, leading to a loss of control, increased risk of accidents, and potential safety hazards, especially when driving in heavy traffic or at high speeds.",
      "symptoms": [
        "The engine stalls suddenly",
        "often when accelerating from a stop",
        "the vehicle loses power and comes to a complete stop",
        "the vehicle may need to be restarted",
        "the stalling may occur intermittently",
        "and the dealership may downplay the issue or attribute it to normal behavior."
      ],
      "odiNumbers": [
        "11573270"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Fuel Pump and Fuel System Component Failure",
      "impact": "The failure of the fuel pump and fuel system components can cause sudden loss of acceleration, stalling, and gasoline vapors to leak into the cabin, posing a significant risk to the occupants' safety and potentially leading to accidents.",
      "symptoms": [
        "Sudden loss of acceleration",
        "inability to start the engine",
        "strong smell of gasoline vapors inside and outside the cabin",
        "warning lights illuminating (EPC and check engine light)",
        "vehicle stalling or unable to maintain speed."
      ],
      "odiNumbers": [
        "11546921"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}