{
  "totalComplaints": 33,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "STEERING",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 12,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Slipping and Jerking",
      "impact": "The transmission slipping and jerking can cause loss of control, accidents, and leave the driver stranded.",
      "symptoms": [
        "The transmission slips and unexpectedly downshifts",
        "causing the vehicle to jerk; the vehicle loses motive power while driving; the transmission has a hard time shifting gears",
        "causing the engine to rev up and struggle to accelerate; the transmission holds gears",
        "chugs",
        "and slips",
        "making the vehicle feel lazy; the RPMs fluctuate wildly."
      ],
      "odiNumbers": [
        "11592173",
        "11583793",
        "11513768"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Engine Shut Down While Driving",
      "impact": "The engine shutting down while driving can cause loss of control, accidents, and leave the driver stranded.",
      "symptoms": [
        "The engine shuts down suddenly while driving",
        "causing the vehicle to lose power and potentially leading to accidents; the vehicle may need to be towed to a nearby dealership for repair."
      ],
      "odiNumbers": [
        "11561829",
        "11557544"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Delayed and Rough Shifting in Sport Mode",
      "impact": "The delayed and rough shifting in sport mode can cause loss of control, accidents, and distractions while driving.",
      "symptoms": [
        "The transmission shifts delayed and roughly in sport mode",
        "causing the vehicle to jerk and hesitate; the vehicle may produce a burning smell from the engine; the electrical system may malfunction",
        "causing the wrench light to come on; the vehicle may have difficulty accelerating or decelerating properly."
      ],
      "odiNumbers": [
        "11557544"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Vibration at Specific Speeds",
      "impact": "The vibration at specific speeds can cause discomfort, distraction, and potentially lead to accidents.",
      "symptoms": [
        "The vehicle vibrates underneath at specific speeds (36-42 mph)",
        "causing discomfort and distraction; the vibration goes away at higher speeds (43 mph)."
      ],
      "odiNumbers": [
        "11535307"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Lane Assist System Failure",
      "impact": "The failure of the lane assist system can cause the vehicle to jerk or swerve, leading to accidents or loss of control, especially in construction zones, back roads, and during rainy weather.",
      "symptoms": [
        "The vehicle jerks or swerves to one side",
        "the lane keeping assist feature does not function properly",
        "the system automatically turns on despite being shut off",
        "the screen displaying lane assist activity goes blank randomly",
        "and the vehicle may automatically brake or slow down unexpectedly."
      ],
      "odiNumbers": [
        "11580558",
        "11517340"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Steering System Issues",
      "impact": "The steering system issues can cause the vehicle to jerk or swerve, leading to accidents or loss of control, and may also cause concerns about the vehicle's stability and safety.",
      "symptoms": [
        "The steering wheel feels jerky or unsmooth during lane changes",
        "the vehicle feels like it may flip over when braking",
        "and there may be unusual noises or sounds when turning the steering wheel."
      ],
      "odiNumbers": [
        "11564190",
        "11536377"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Braking System Issues",
      "impact": "The braking system issues can cause the vehicle to malfunction, leading to accidents or loss of control, and may also cause concerns about the vehicle's safety.",
      "symptoms": [
        "There is a constant clicking noise from the engine",
        "the brake light turns on and off",
        "and the brake system may malfunction or fail to engage properly."
      ],
      "odiNumbers": [
        "11564190"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Suspension and Steering Component Failure",
      "impact": "The failure of suspension and steering components can cause the vehicle to malfunction, leading to accidents or loss of control, and may also cause concerns about the vehicle's safety.",
      "symptoms": [
        "There is an abnormal rattling noise from the strut",
        "and the front-end bolts may become loose",
        "causing the vehicle to vibrate or shake."
      ],
      "odiNumbers": [
        "11575332"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Excessive Wind Noise at Highway Speeds",
      "impact": "The excessive wind noise at highway speeds can be a distraction to the driver, potentially leading to decreased attention on the road and increased risk of accidents.",
      "symptoms": [
        "Loud wind noise while driving at highway speeds",
        "noise is distracting and annoying",
        "noise can be heard coming from the doors",
        "windows",
        "or sunroof."
      ],
      "odiNumbers": [
        "11571244"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Loose Carpet Under Front Seat",
      "impact": "The loose carpet under the front seat can cause the carpet to buckle up and interfere with the gas pedal, potentially leading to unintended acceleration or loss of control of the vehicle.",
      "symptoms": [
        "Loose carpet under the front seat",
        "carpet buckling up and interfering with the gas pedal",
        "difficulty pressing the gas pedal."
      ],
      "odiNumbers": [
        "11560014"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Rear Camera Failure",
      "impact": "The failure of the rear camera can reduce the driver's visibility and increase the risk of accidents, particularly when reversing or parking.",
      "symptoms": [
        "Rear camera displays a blue screen",
        "rear camera is not functioning",
        "difficulty seeing behind the vehicle when reversing."
      ],
      "odiNumbers": [
        "11556797",
        "11532171"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Sunroof Explosion",
      "impact": "The sudden explosion of the sunroof can cause a loud noise, potentially startling the driver and leading to loss of control of the vehicle, as well as creating a safety hazard for occupants and other vehicles on the road.",
      "symptoms": [
        "Sudden loud noise",
        "sunroof glass shattering",
        "glass debris on the road."
      ],
      "odiNumbers": [
        "11541588"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}