{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "ELECTRICAL SYSTEM",
    "STRUCTURE",
    "POWER TRAIN"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Backup Camera Display Failure",
      "impact": "The intermittent failure of the backup camera display can increase the risk of accidents or injuries, especially when reversing, as the driver may not be able to see obstacles or pedestrians behind the vehicle.",
      "symptoms": [
        "The backup camera display screen is blank",
        "with a strange icon in the middle",
        "and does not display what is behind the vehicle."
      ],
      "odiNumbers": [
        "11505429"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Auto Headlight Sensor Malfunction",
      "impact": "The malfunction of the auto headlight sensor can cause the headlights to switch on and off incorrectly, potentially leading to reduced visibility and increased risk of accidents.",
      "symptoms": [
        "Daylight driving lights come on in the dark",
        "and headlights come on during the day",
        "when the vehicle's headlights are set to \"auto\"."
      ],
      "odiNumbers": [
        "11489488"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Door and Convertible Top Control Module Failure",
      "impact": "The failure of the control module can cause the electric door opening and convertible top operation to malfunction, leading to inconvenience and potential safety risks, especially in emergency situations.",
      "symptoms": [
        "The electric door opening button does not activate",
        "requiring manual handle operation; the electric button to open the hard top convertible does not activate."
      ],
      "odiNumbers": [
        "11530410"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Intermittent Rear Camera Failure",
      "impact": "The intermittent failure of the rear camera can lead to reduced visibility and increased risk of accidents, especially when reversing.",
      "symptoms": [
        "The rear camera works intermittently",
        "fails more often than it works properly",
        "and can be reset by shutting the car off and leaving the door open for 90 seconds",
        "then restarting."
      ],
      "odiNumbers": [
        "11515907"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Camera System Failure (Rear and Front)",
      "impact": "The failure of the camera system can lead to reduced visibility and increased risk of accidents, especially when reversing or maneuvering in tight spaces.",
      "symptoms": [
        "The rear and front cameras fail to operate",
        "displaying error codes B1A62 and U0131; the camera system malfunctions within a short period of driving",
        "making it difficult to navigate in and out of driveways or parking spaces."
      ],
      "odiNumbers": [
        "11514474"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Hood Latch Failure",
      "impact": "The sudden and unexpected opening of the hood while driving can cause loss of forward vision, increasing the risk of accidents and potentially leading to serious injury or death.",
      "symptoms": [
        "The hood suddenly opens while driving",
        "the hood flies up and obstructs the driver's view",
        "the hood becomes detached from the vehicle and can cause damage or injury."
      ],
      "odiNumbers": [
        "11516490"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Transmission Engagement Failure",
      "impact": "The failure of the transmission to engage can cause the vehicle to stall or lose power, increasing the risk of accidents or leaving the driver stranded.",
      "symptoms": [
        "The transmission fails to engage",
        "the gear indicator light flashes",
        "the \"service transmission\" message is displayed on the instrument panel",
        "the vehicle stalls or loses power."
      ],
      "odiNumbers": [
        "11490966"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}