{
  "totalComplaints": 25,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "STEERING",
    "SEAT BELTS",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Steering Gearbox Failure/Steering Stickiness",
      "impact": "The failure of the steering gearbox can cause the steering wheel to stick, making it difficult to control the vehicle, which can lead to accidents, loss of control, and potentially serious injuries.",
      "symptoms": [
        "The steering wheel feels sticky",
        "the steering wheel jerks or pulls to one side",
        "the vehicle pulls to one side while driving straight",
        "the steering wheel has a delayed return to its normal position",
        "the steering wheel has a sudden loss of pressure",
        "the vehicle is difficult to drive",
        "especially in rainy conditions."
      ],
      "odiNumbers": [
        "11584804",
        "11582892",
        "11582308",
        "11580018",
        "11577426",
        "11560331",
        "11558941",
        "11543643",
        "11543564"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Failure to Disclose Open Recalls",
      "impact": "The failure to disclose open recalls can put the driver and passengers at risk of accidents or injuries due to unresolved safety issues.",
      "symptoms": [
        "The vehicle has open recalls that were not disclosed to the buyer",
        "the dealership fails to provide information about the recall",
        "the recall is not repaired or replaced before sale."
      ],
      "odiNumbers": [
        "11577100"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Delayed or Unavailable Recall Repairs",
      "impact": "The delay or unavailability of recall repairs can leave the vehicle in an unsafe condition, putting the driver and passengers at risk of accidents or injuries.",
      "symptoms": [
        "The dealership does not have the necessary parts to repair the recall",
        "there is no estimated time of arrival (ETA) for the parts",
        "the driver is forced to drive the vehicle under risk."
      ],
      "odiNumbers": [
        "11557305"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Faulty Seat Belts",
      "impact": "Faulty seat belts can fail to restrain occupants in the event of an accident, leading to serious injuries or fatalities.",
      "symptoms": [
        "The seat belts do not lock in place",
        "the seat belts fail to function properly",
        "the driver or passengers are at risk of injury or death in the event of an accident."
      ],
      "odiNumbers": [
        "11557003"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Key Fob Unlocking Issue",
      "impact": "The faulty key fob unlocking mechanism can compromise the safety feature of unlocking only the driver's door, potentially putting the driver and passengers at risk.",
      "symptoms": [
        "Clicking the unlock button once on the key fob unlocks all doors and the tailgate instead of just the driver's door."
      ],
      "odiNumbers": [
        "11564713"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Windshield Washer Fluid Reservoir Defect",
      "impact": "The lack of windshield washer fluid can impair the driver's visibility, increasing the risk of accidents, especially during inclement weather conditions.",
      "symptoms": [
        "No windshield washer fluid in the reservoir",
        "no indicator light on the dashboard."
      ],
      "odiNumbers": [
        "11549783"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Spontaneous Rear Glass Shattering",
      "impact": "The sudden shattering of the rear glass can cause injuries, damage to the vehicle, and potentially lead to accidents.",
      "symptoms": [
        "Rear glass shatters without any external impact or warning."
      ],
      "odiNumbers": [
        "11548987"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}