{
  "totalComplaints": 24,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "SEAT BELTS",
    "ENGINE AND ENGINE COOLING",
    "FUEL SYSTEM",
    "STRUCTURE"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Inadequate Seat Belt Design and Fit",
      "impact": "The failure of the seat belt to fit properly can lead to discomfort, difficulty in use, and potentially, failure to provide adequate protection in the event of an accident, increasing the risk of injury or fatality.",
      "symptoms": [
        "The seat belt does not fit comfortably",
        "the seat belt is too short",
        "the seat belt does not adjust properly",
        "the driver or passenger is unable to buckle up due to seat belt design or fit issues."
      ],
      "odiNumbers": [
        "722596"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Corrosion-Related Seat Belt Anchor Failure",
      "impact": "The corrosion of the seat belt anchor can cause it to pull out of the wheel well, leading to a loss of seat belt functionality and increasing the risk of injury or fatality in the event of an accident.",
      "symptoms": [
        "The seat belt anchor is loose or detached",
        "the seat belt is no longer securely attached to the vehicle",
        "rust or corrosion is visible on the seat belt anchor or surrounding area."
      ],
      "odiNumbers": [
        "781623"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Defective Seat Belt Buckle or Retractor",
      "impact": "The failure of the seat belt buckle or retractor can prevent the seat belt from functioning properly, increasing the risk of injury or fatality in the event of an accident.",
      "symptoms": [
        "The seat belt buckle is difficult or impossible to fasten",
        "the seat belt buckle will not latch or unlatch",
        "the seat belt retractor locks up or fails to retract",
        "the seat belt requires excessive force or manipulation to buckle or unbuckle."
      ],
      "odiNumbers": [
        "966364",
        "965753",
        "965764",
        "960483"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rusting of Exhaust System Components",
      "impact": "Rusting of exhaust system components can lead to exhaust leaks, which can cause carbon monoxide poisoning, decreased vehicle performance, and increased emissions.",
      "symptoms": [
        "Rattling or hissing sounds from the exhaust system",
        "decreased engine performance",
        "decreased fuel efficiency",
        "visible rust or corrosion on exhaust system components."
      ],
      "odiNumbers": [
        "714137"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Faulty Idle Air Control System",
      "impact": "A faulty idle air control system can cause the engine to stall or idle erratically, leading to loss of vehicle control, especially on cold or icy days.",
      "symptoms": [
        "Engine stalling",
        "high or low idle",
        "erratic shifting",
        "loss of power while driving",
        "frequent need to pull over to allow the problem to correct itself."
      ],
      "odiNumbers": [
        "546610"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Cracked PCV Vacuum Unit Housing",
      "impact": "A cracked PCV vacuum unit housing can cause engine oil leaks, decreased engine performance, and increased emissions.",
      "symptoms": [
        "Engine oil leaks",
        "decreased engine performance",
        "increased emissions",
        "visible cracks or damage to the PCV vacuum unit housing."
      ],
      "odiNumbers": [
        "508846"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Valve Cover Gasket Failure",
      "impact": "Valve cover gasket failure can cause engine oil leaks, decreased engine performance, and increased emissions.",
      "symptoms": [
        "Engine oil leaks",
        "decreased engine performance",
        "increased emissions",
        "visible signs of oil leakage around the valve cover."
      ],
      "odiNumbers": [
        "482167"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Defective Timing Belt",
      "impact": "A defective timing belt can cause engine damage, decreased engine performance, and potentially lead to engine failure.",
      "symptoms": [
        "Engine failure",
        "decreased engine performance",
        "visible signs of timing belt damage or breakage."
      ],
      "odiNumbers": [
        "482167"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rusted Gas Filler Neck and Contaminated Fuel Line",
      "impact": "A rusted gas filler neck and contaminated fuel line can cause fuel leaks, stalling, and rough idling, which can lead to accidents, fires, and leave the driver stranded.",
      "symptoms": [
        "Fuel leaks",
        "stalling",
        "rough idling",
        "car won't start",
        "fuel leaking out of the carburetor",
        "water leaks into the trunk where the fuel filler pipe mounts to the wheel well and trunk area."
      ],
      "odiNumbers": [
        "10119825",
        "514625",
        "489129",
        "960159"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Frame Corrosion/Rust",
      "impact": "Frame corrosion or rust can lead to structural weakening, compromising the vehicle's integrity and potentially causing accidents or injuries.",
      "symptoms": [
        "Rust or corrosion on the frame",
        "particularly in areas such as the front crossmember bar or rear left side of the frame",
        "can cause the frame to weaken or break",
        "leading to loss of vehicle control or collapse."
      ],
      "odiNumbers": [
        "805476",
        "984304",
        "973264"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}