{
  "totalComplaints": 17,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "FUEL SYSTEM",
    "SEAT BELTS",
    "VISIBILITY",
    "POWER TRAIN"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel Filler Pipe Corrosion",
      "impact": "Corrosion of the fuel filler pipe can cause fuel leakage, which can lead to fires, explosions, and accidents, posing a significant risk to vehicle occupants and other road users.",
      "symptoms": [
        "Fuel smell while driving",
        "fuel leaking into the trunk or other areas of the vehicle",
        "visible signs of rust or corrosion on the fuel filler pipe."
      ],
      "odiNumbers": [
        "517067",
        "802068",
        "803174",
        "960357"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Fuel Injector Failure",
      "impact": "Leaking fuel injectors can cause fuel system failure, leading to engine performance issues, decreased fuel efficiency, and increased emissions, which can affect vehicle safety and performance.",
      "symptoms": [
        "Fuel smell",
        "engine misfires",
        "decreased engine performance",
        "decreased fuel efficiency."
      ],
      "odiNumbers": [
        "978882"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Fuel Tank Assembly Pipe Failure",
      "impact": "Leaks in the fuel tank assembly pipe can cause fuel to leak, leading to fires, explosions, and accidents, posing a significant risk to vehicle occupants and other road users.",
      "symptoms": [
        "Fuel smell",
        "fuel leaking from the fuel tank area",
        "visible signs of rust or corrosion on the fuel tank assembly pipe."
      ],
      "odiNumbers": [
        "976283"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Driver's Side Seatbelt Retractor Failure",
      "impact": "The failure of the driver's side seatbelt retractor can cause the seatbelt to remain loose around the driver, increasing the risk of injury or fatality in the event of an accident.",
      "symptoms": [
        "The driver's side seatbelt does not retract",
        "the seatbelt remains loose around the driver",
        "the seatbelt does not function properly."
      ],
      "odiNumbers": [
        "888601",
        "715873",
        "522263"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Windshield Wiper Linkage Failure",
      "impact": "The sudden failure of the windshield wiper linkage can cause the wipers to stop working, leading to reduced visibility, increased risk of accidents, and potential loss of control of the vehicle, especially in heavy rain or low-visibility conditions.",
      "symptoms": [
        "Windshield wipers suddenly stop working",
        "wiper motor continues to run but wipers do not move",
        "wiper blades become disconnected from the motor",
        "instant loss of visibility while driving."
      ],
      "odiNumbers": [
        "561978",
        "748200"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Odometer Fraud",
      "impact": "Rolling back the odometer reading can deceive potential buyers about the vehicle's true mileage, leading to unfair pricing and potential safety risks due to unknown maintenance history.",
      "symptoms": [
        "The odometer reading appears to be lower than expected",
        "the vehicle's maintenance history is unclear",
        "the seller is unwilling to provide documentation of the vehicle's mileage."
      ],
      "odiNumbers": [
        "558403"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Ignition Key Interlock Failure",
      "impact": "The ability to remove the ignition key while the transmission is still in gear can cause the vehicle to move unexpectedly, leading to accidents or injuries.",
      "symptoms": [
        "The ignition key can be removed while the transmission is in gear",
        "the vehicle can be shifted into gear without the key being in the ignition",
        "the vehicle moves unexpectedly when the key is removed."
      ],
      "odiNumbers": [
        "972970"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}