{
  "totalComplaints": 26,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "SEAT BELTS",
    "SERVICE BRAKES",
    "SEATS"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Seat Belt Buckle Failure",
      "impact": "The failure of the seat belt buckle can cause the seat belt to jam or lock, making it difficult or impossible to remove, which can lead to accidents, injuries, or fatalities in the event of a crash or emergency situation.",
      "symptoms": [
        "The seat belt buckle jams or locks",
        "the seat belt is unable to latch or unlatch",
        "the seat belt is stuck in the housing",
        "the passenger is unable to remove the seat belt",
        "the seat belt breaks or fails to function properly."
      ],
      "odiNumbers": [
        "728421",
        "724925",
        "722061",
        "860573",
        "979937",
        "976445",
        "483613",
        "964386",
        "963999",
        "962274",
        "960180"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Seat Belt Latch Failure",
      "impact": "The failure of the seat belt latch can cause the seat belt to lock or jam, making it difficult or impossible to remove, which can lead to accidents, injuries, or fatalities in the event of a crash or emergency situation.",
      "symptoms": [
        "The seat belt latch fails to function properly",
        "the seat belt locks or jams",
        "the passenger is unable to remove the seat belt",
        "the seat belt is stuck in the housing."
      ],
      "odiNumbers": [
        "724925",
        "722061",
        "860573",
        "979937",
        "976445",
        "964386",
        "962274",
        "960180"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Seat Belt Anchor Failure",
      "impact": "The failure of the seat belt anchor can cause the seat belt to fail to function properly, which can lead to accidents, injuries, or fatalities in the event of a crash or emergency situation.",
      "symptoms": [
        "The seat belt anchor is broken or damaged",
        "the seat belt is not properly secured",
        "the seat belt fails to function properly."
      ],
      "odiNumbers": [
        "722061"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Brake Pedal Issues (Cold Temperature and High-Speed Stopping)",
      "impact": "The malfunctioning brake pedal can lead to extended stopping distances, increased risk of accidents, and loss of vehicle control, especially during high-speed stopping or in emergency braking situations.",
      "symptoms": [
        "The brake pedal can be pressed all the way down",
        "but the vehicle slows down gradually; excessive pressure is needed to apply the brakes when the vehicle is cold; the brake pedal resists and then suddenly engages when applied during cold temperatures; the power braking system is intermittently inoperative for a few moments when starting the vehicle; the pedal goes to the floor in cold weather",
        "resulting in extended stopping distances."
      ],
      "odiNumbers": [
        "723251",
        "830276",
        "818582",
        "963646",
        "961623"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Driver's Seat Back Failure",
      "impact": "The failure of the driver's seat back can cause the seat to fall backward, leading to injuries, such as concussions and whiplash, and potentially affecting the driver's control of the vehicle.",
      "symptoms": [
        "The driver's seat back falls backward",
        "the seat does not stay in the upright position",
        "the seat twists or is misaligned",
        "the seat is loose or unstable."
      ],
      "odiNumbers": [
        "762799",
        "985960"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}