{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "VISIBILITY",
    "SERVICE BRAKES",
    "EQUIPMENT",
    "EXTERIOR LIGHTING",
    "VEHICLE SPEED CONTROL"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Power Window Failure",
      "impact": "The failure of the power windows can cause inconvenience and discomfort for the driver and passengers, and in extreme cases, can lead to safety issues if the windows are stuck in a position that obstructs the driver's view.",
      "symptoms": [
        "The power windows do not roll up or down",
        "the power windows are slow to respond",
        "the power windows are stuck in a particular position",
        "the power window switches are unresponsive."
      ],
      "odiNumbers": [
        "502892"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Heater Failure",
      "impact": "The failure of the heater can cause discomfort and distraction for the driver and passengers, which can lead to accidents or decreased visibility in cold weather conditions.",
      "symptoms": [
        "The heater does not produce warm air",
        "the heater blows cold air",
        "the heater is slow to warm up",
        "the heater has a reduced airflow",
        "the heater has a strange noise or odor."
      ],
      "odiNumbers": [
        "502892"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Anti-Lock Braking System (ABS) Failure",
      "impact": "The failure of the ABS system can cause the vehicle to lose traction and stability, leading to increased stopping distances, accidents, and potential injuries.",
      "symptoms": [
        "The ABS brake warning light illuminates on the dashboard",
        "the vehicle's brakes feel spongy or soft",
        "the vehicle's brakes make a grinding or screeching noise",
        "the vehicle's brakes vibrate or pulse",
        "the vehicle takes longer to stop than usual."
      ],
      "odiNumbers": [
        "502892",
        "10512411",
        "10495132",
        "10485431",
        "10474411",
        "10465521",
        "10459311",
        "10457132",
        "10455521"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Air Conditioning System Failure",
      "impact": "The failure of the air conditioning system can cause discomfort and distraction for the driver and passengers, potentially leading to decreased vehicle safety and reduced visibility due to fogged windows.",
      "symptoms": [
        "The air conditioning blows warm or hot air",
        "the air conditioning is not blowing air",
        "the air conditioning is making a loud or unusual noise",
        "the air conditioning has a musty or unpleasant odor",
        "the air conditioning is not turning on."
      ],
      "odiNumbers": [
        "502892"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "High Beam Headlight Malfunction",
      "impact": "The high beam headlights being stuck on can cause glare and discomfort for oncoming traffic, potentially leading to accidents or near-misses.",
      "symptoms": [
        "The high beam headlights remain on even when the switch is turned off",
        "the high beam headlights cannot be turned off",
        "the high beam headlights are stuck in the \"on\" position",
        "the vehicle's headlights are constantly shining brightly."
      ],
      "odiNumbers": [
        "502892"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Sudden Unintended Acceleration",
      "impact": "Sudden unintended acceleration can cause the vehicle to accelerate rapidly without driver input, increasing the risk of accidents, injuries, and fatalities.",
      "symptoms": [
        "The vehicle suddenly accelerates without pressing the accelerator pedal",
        "the vehicle surges forward unexpectedly",
        "the engine RPM increases rapidly without driver input",
        "the vehicle is difficult to control or stop."
      ],
      "odiNumbers": [
        "502892",
        "10234213",
        "10194511",
        "10164499",
        "10144449",
        "10134419",
        "10124429",
        "10114419",
        "10094429",
        "10084419"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}