{
  "totalComplaints": 19,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "VISIBILITY",
    "SERVICE BRAKES",
    "TIRES",
    "SEATS",
    "ENGINE AND ENGINE COOLING"
  ],
  "parsedComplaintsResultLength": 9,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Passenger Side Window Defect",
      "impact": "The defective rear passenger side window can cause inconvenience and discomfort for passengers, and may also lead to safety issues if the window is stuck in a position that obstructs visibility.",
      "symptoms": [
        "The rear passenger side window does not move when the automatic button is pressed",
        "the window must be manually pulled up with both hands",
        "the window is stuck in a position."
      ],
      "odiNumbers": [
        "10083073",
        "850561"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Automatic Window Failure",
      "impact": "The failure of the automatic window system can cause inconvenience and discomfort for passengers, and may also lead to safety issues if the window is stuck in a position that obstructs visibility.",
      "symptoms": [
        "The window does not move when the automatic button is pressed",
        "the motor can be heard running but the window does not move",
        "the window must be manually pulled up."
      ],
      "odiNumbers": [
        "850561"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Heater Malfunction",
      "impact": "The malfunction of the heater can cause discomfort and inconvenience for passengers, especially during cold weather.",
      "symptoms": [
        "The heater does not work",
        "no heat is produced during the winter."
      ],
      "odiNumbers": [
        "529591"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Windshield Failure",
      "impact": "The failure of the windshield can cause safety issues, especially if it shatters while driving, and may lead to accidents or injuries.",
      "symptoms": [
        "The windshield shatters unexpectedly",
        "the windshield shatters while cleaning snow from it."
      ],
      "odiNumbers": [
        "976835"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Anti-Lock Braking System (ABS) Failure",
      "impact": "The failure of the ABS can cause the vehicle to lose traction, leading to accidents, including rollovers, and potentially resulting in injuries or fatalities.",
      "symptoms": [
        "The vehicle's brakes fail to engage properly",
        "the vehicle fish-tails or loses control when applying the brakes in wet conditions",
        "the vehicle rolls forward after stopping and the brake pedal is still depressed."
      ],
      "odiNumbers": [
        "535282",
        "605724",
        "521884"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Brake Rotor Warping",
      "impact": "Warped brake rotors can cause the brakes to vibrate or pulsate, leading to reduced stopping power and increased stopping distances, which can increase the risk of accidents.",
      "symptoms": [
        "The brake pedal pulsates or vibrates when applied",
        "the vehicle's brakes make a grinding or scraping noise",
        "the brake rotors are visibly warped or uneven."
      ],
      "odiNumbers": [
        "962813"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Tire Tread Separation",
      "impact": "Tire tread separation can lead to sudden loss of tire pressure, loss of vehicle control, and potentially cause accidents, especially at high speeds.",
      "symptoms": [
        "Tread separation from the tire casing",
        "tire failure with plenty of rubber still left on the tread",
        "sudden loss of tire pressure",
        "tire blowout",
        "and potentially loss of vehicle control."
      ],
      "odiNumbers": [
        "731734",
        "869909"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Seat Frame Weld Failure",
      "impact": "The failure of the seat frame weld can cause the seat to become unstable, leading to a loss of control while driving, which can increase the risk of accidents and injuries.",
      "symptoms": [
        "The seat frame breaks",
        "the seat moves back and forth when the brakes or accelerator pedal is applied",
        "the seat is very unstable."
      ],
      "odiNumbers": [
        "542649",
        "830881"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Radiator Failure due to Carbon Buildup and Cooling System Issues",
      "impact": "The failure of the radiator can cause coolant leakage, overheating, and engine damage, which can lead to accidents, injuries, or even fires.",
      "symptoms": [
        "Loud bang or explosion sound",
        "coolant leakage",
        "overheating",
        "engine failure",
        "clogged engine cooling ports",
        "clogged heater core",
        "carbon buildup in the engine."
      ],
      "odiNumbers": [
        "529784",
        "813657"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}