{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "SEATS",
    "ELECTRICAL SYSTEM",
    "VEHICLE SPEED CONTROL"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Main Air Brake Line Rubbing Against Retaining Bracket",
      "impact": "The premature wear of the main air brake line due to rubbing against the retaining bracket can lead to air brake system failure, potentially causing accidents or loss of control.",
      "symptoms": [
        "None reported",
        "as this issue is related to wear and tear",
        "but drivers may experience sudden loss of air brake pressure",
        "reduced braking performance",
        "or warning lights on the dashboard."
      ],
      "odiNumbers": [
        "505277",
        "601431",
        "601433",
        "601434",
        "601435",
        "601436"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Delayed or Failure to Receive Recall Parts from Blue Bird",
      "impact": "The delay or failure to receive recall parts from Blue Bird can leave vehicles unrepaired, potentially leading to safety risks and continued operation with defective components.",
      "symptoms": [
        "Vehicle owners experience prolonged wait times for recall parts",
        "failure to receive parts",
        "and lack of communication from Blue Bird regarding the status of parts delivery."
      ],
      "odiNumbers": [
        "802374"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Recall 96V126.001: Incomplete or Inadequate Repair",
      "impact": "The incomplete or inadequate repair of vehicles under Recall 96V126.001 can lead to continued safety risks, including potential accidents or injuries, due to the presence of defective components.",
      "symptoms": [
        "Vehicle owners report that their vehicles have not been properly repaired",
        "or that the repairs did not address the underlying safety issues",
        "despite the recall."
      ],
      "odiNumbers": [
        "96"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Steering Lock-Up due to Horn Ring Failure",
      "impact": "The failure of the horn ring can cause the steering column to lock up, making it difficult or impossible to steer the vehicle, which can lead to accidents or loss of control.",
      "symptoms": [
        "The steering wheel becomes difficult to turn or locks up",
        "the horn ring is stuck or peeling",
        "the steering column feels rough or binding",
        "the vehicle is hard to steer or maneuver."
      ],
      "odiNumbers": [
        "505181"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Throttle Cable Failure",
      "impact": "The failure of the throttle cable can cause the engine to stall or hesitate, leading to a loss of power and potentially causing accidents or leaving the driver stranded.",
      "symptoms": [
        "The throttle cable breaks",
        "the engine stalls or hesitates",
        "the vehicle loses power",
        "the accelerator pedal feels loose or unresponsive",
        "the vehicle is difficult to control."
      ],
      "odiNumbers": [
        "500637"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}