{
  "totalComplaints": 53,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "SEATS",
    "SEAT BELTS",
    "AIR BAGS"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Front Seatback Recliner Failure",
      "impact": "The failure of the front seatback recliner can cause the seat to recline or collapse while driving, leading to loss of control, accidents, or injuries.",
      "symptoms": [
        "The seatback reclines or collapses while driving",
        "the seat does not remain in an upright position",
        "the seatback slips into the reclining position upon acceleration",
        "the seatback fails to lock into position",
        "the seatback collapses when pressing the accelerator",
        "the seatback falls back when leaning or giving any motion."
      ],
      "odiNumbers": [
        "8018074",
        "8007996",
        "855014",
        "843281",
        "840896",
        "707190",
        "835999",
        "832569",
        "542631",
        "828850",
        "541592",
        "540023",
        "825094",
        "533509",
        "811603",
        "603293",
        "807305",
        "807321",
        "806620"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Seat Belt Retractor Failure",
      "impact": "The failure of the seat belt retractor can cause the seat belt to malfunction, leading to inadequate restraint in the event of an accident, which can increase the risk of injury or fatality.",
      "symptoms": [
        "The seat belt retracts back and forth",
        "the seat belt does not move",
        "the seat belt locks in place but does not slide forward",
        "the seat belt does not slide to the lock position",
        "the seat belt is inoperative."
      ],
      "odiNumbers": [
        "10074050",
        "10052520",
        "757664",
        "550368",
        "837596",
        "702865"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Seat Belt Buckle Failure",
      "impact": "The failure of the seat belt buckle can cause the seat belt to release the occupant during an accident, leading to increased risk of injury or fatality.",
      "symptoms": [
        "The seat belt broke at the buckle",
        "releasing the occupant."
      ],
      "odiNumbers": [
        "804704"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Seat Belt Webbing Failure",
      "impact": "The failure of the seat belt webbing can cause the seat belt to malfunction, leading to inadequate restraint in the event of an accident, which can increase the risk of injury or fatality.",
      "symptoms": [
        "The seat belt webbing is torn",
        "the seat belt webbing fails to retract."
      ],
      "odiNumbers": [
        "809548",
        "974252"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Motorized Seat Belt Interference",
      "impact": "The motorized seat belt can interfere with other vehicle components, causing the seat belt to malfunction, which can increase the risk of injury or fatality.",
      "symptoms": [
        "The motorized seat belt gets caught in the sunvisor."
      ],
      "odiNumbers": [
        "479606"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Failure of Driver's Airbag to Deploy in Crash",
      "impact": "The failure of the driver's airbag to deploy in a crash can lead to serious injury or even death, as the airbag is designed to provide critical protection to the driver in the event of an accident.",
      "symptoms": [
        "The airbag does not deploy in a crash",
        "despite the severity of the impact",
        "and the driver may experience injuries as a result."
      ],
      "odiNumbers": [
        "853882",
        "853450",
        "504319",
        "983173",
        "502402"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Seatback Collapse",
      "impact": "The collapse of the seatback can cause the driver to lose control of the vehicle, leading to accidents or injuries, and can also exacerbate the effects of an airbag failure.",
      "symptoms": [
        "The seatback collapses during a crash or sudden stop",
        "causing the driver to lose control or experience injuries."
      ],
      "odiNumbers": [
        "853450"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}