{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "VISIBILITY",
    "SEATS",
    "WHEELS",
    "TIRES"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Brake Pedal Sinking or Soft Brake Pedal",
      "impact": "A soft or sinking brake pedal can lead to extended stopping distances, increasing the risk of accidents and injuries.",
      "symptoms": [
        "The brake pedal feels soft or spongy",
        "the brake pedal goes to the floor",
        "the brakes resist or are unresponsive",
        "the vehicle takes longer to stop than usual."
      ],
      "odiNumbers": [
        "817630",
        "818735"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "ABS Malfunction",
      "impact": "A malfunctioning ABS system can cause the vehicle to fail to stop or lose control, leading to accidents and injuries.",
      "symptoms": [
        "The ABS system kicks in unnecessarily",
        "the vehicle fails to stop or slows down gradually",
        "the brakes do not hold",
        "the vehicle goes through stop signs or red lights."
      ],
      "odiNumbers": [
        "817419",
        "511642"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Intermittent Windshield Wiper Operation",
      "impact": "Intermittent windshield wiper operation can cause poor visibility for the driver, increasing the risk of accidents, especially during rain or snow.",
      "symptoms": [
        "Windshield wipers operate intermittently",
        "windshield wipers stop working suddenly",
        "windshield wipers do not turn on",
        "windshield wipers turn on and off randomly",
        "poor visibility due to ineffective windshield wiper operation."
      ],
      "odiNumbers": [
        "10050399"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Driver's Side Seat Bolt Failure",
      "impact": "The failure of the driver's side seat bolts can cause the seat to become dislodged during a collision, increasing the risk of injury or fatality to the driver.",
      "symptoms": [
        "The driver's seat is loose or unstable",
        "the driver's seat moves unexpectedly during driving",
        "the driver's seat bolts are broken or damaged."
      ],
      "odiNumbers": [
        "980414"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Wheel Hub Assembly Failure",
      "impact": "The failure of the wheel hub assembly can cause the wheels to lose traction, leading to loss of control, accidents, and potential injuries or fatalities.",
      "symptoms": [
        "Wheels fail to lock upon acceleration",
        "wheels vibrate or shake",
        "wheels feel loose or wobbly",
        "unusual noises or grinding sounds from the wheels",
        "difficulty steering or maintaining control of the vehicle."
      ],
      "odiNumbers": [
        "482119"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Incorrect Tire Size",
      "impact": "Installing the wrong size tires on a vehicle can lead to reduced traction, increased stopping distance, and compromised vehicle stability, which can increase the risk of accidents and affect overall vehicle safety.",
      "symptoms": [
        "The vehicle's tires appear to be the incorrect size",
        "the tire information placard on the driver's side doorjamb or inside the fuel filler door does not match the tires installed on the vehicle",
        "the vehicle's handling and stability are affected",
        "the vehicle's fuel efficiency is decreased."
      ],
      "odiNumbers": [
        "482119"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Tire Information Placard Error",
      "impact": "An incorrect tire information placard can lead to the installation of incorrect tires, which can compromise vehicle safety and performance.",
      "symptoms": [
        "The tire information placard on the driver's side doorjamb or inside the fuel filler door contains incorrect information",
        "the placard does not match the tires installed on the vehicle",
        "the vehicle's owner's manual contains incorrect tire information."
      ],
      "odiNumbers": [
        "482119"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}