{
  "totalComplaints": 11,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "ELECTRICAL SYSTEM",
    "VISIBILITY"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Fan Clutch Brake Pad Failure",
      "impact": "The failure of the brake pad on the fan clutch can cause the engine to overheat, leading to engine damage, loss of power, and potentially causing accidents or leaving the driver stranded.",
      "symptoms": [
        "The brake pad on the fan clutch breaks or disintegrates",
        "the surface of the brake pad comes apart",
        "the engine overheats",
        "the vehicle loses power."
      ],
      "odiNumbers": [
        "544606",
        "514762"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Speedometer Failure",
      "impact": "A faulty speedometer can lead to inaccurate speed readings, making it difficult for drivers to maintain a safe speed, which can increase the risk of accidents.",
      "symptoms": [
        "The speedometer on the instrument panel does not function",
        "displays incorrect speed readings",
        "or is inoperative."
      ],
      "odiNumbers": [
        "10277200"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electrical System Failure",
      "impact": "Electrical system failures can cause a range of issues, including failed headlights, dashboard lights, and sensors, which can compromise vehicle safety and increase the risk of accidents, especially at night or in low-visibility conditions.",
      "symptoms": [
        "The low amp light appears",
        "headlights fail",
        "multiple dashboard lights fail (up to 17 bulbs)",
        "sensor shorting",
        "and dome light failure."
      ],
      "odiNumbers": [
        "544606"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Right Side Mirror Failure",
      "impact": "The failure of the right side mirror can cause reduced visibility, increasing the risk of accidents, especially when changing lanes or merging with traffic.",
      "symptoms": [
        "The right side mirror is loose",
        "the right side mirror is broken",
        "the right side mirror is not adjustable",
        "the right side mirror is not providing a clear view."
      ],
      "odiNumbers": [
        "544606"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Windshield and Sun Roof Glass Leaking Water",
      "impact": "Water leakage through the windshield and sun roof can cause electrical system failures, corrosion, and reduced visibility, increasing the risk of accidents.",
      "symptoms": [
        "Water is leaking into the vehicle through the windshield",
        "water is leaking into the vehicle through the sun roof",
        "water is accumulating on the dashboard or floor",
        "the vehicle's electrical systems are malfunctioning due to water exposure."
      ],
      "odiNumbers": [
        "544606"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}