{
  "totalComplaints": 57,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "POWER TRAIN",
    "AIR BAGS"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Ignition Switch Failure",
      "impact": "The failure of the ignition switch can cause the vehicle to stall or die while driving, leading to a loss of power steering and brakes, which can result in accidents or leave the driver stranded.",
      "symptoms": [
        "The vehicle stalls or dies while driving",
        "the vehicle fails to turn off even after the key is removed from the ignition",
        "the power steering and brakes fail",
        "the theft light comes on",
        "and the accessories continue to run even after the vehicle has stopped."
      ],
      "odiNumbers": [
        "11128371",
        "11075216",
        "10822771",
        "10480501",
        "10479726",
        "10234030",
        "10173808",
        "10129987",
        "10064844",
        "567746",
        "567494"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electrical System Failure",
      "impact": "The failure of the electrical system can cause the vehicle's lights to malfunction, leading to a loss of visibility and increasing the risk of accidents.",
      "symptoms": [
        "The dashboard and head lights dim or flash in sync with the turn signal lighting",
        "the electrical system appears to contain a short",
        "and the lights malfunction."
      ],
      "odiNumbers": [
        "605959",
        "606624"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Window Regulator Failure",
      "impact": "The failure of the window regulator can cause the window to malfunction, leading to inconvenience and potential safety risks.",
      "symptoms": [
        "The window breaks or fails to roll down",
        "and the driver's side window part in the door breaks",
        "causing the window to malfunction."
      ],
      "odiNumbers": [
        "10747283"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Failure",
      "impact": "Transmission failure can cause the vehicle to stall, lose power, or fail to shift gears, leading to accidents or leaving the driver stranded.",
      "symptoms": [
        "The vehicle stalls",
        "loses power",
        "or fails to shift gears; the transmission slips or hesitates; the vehicle revs to high RPMs and then bogs down; the transmission rapidly changes gears; the vehicle rolls backwards on an incline while in park."
      ],
      "odiNumbers": [
        "10641153",
        "10201919",
        "10171387",
        "10083197",
        "10059154",
        "8016769"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Axle Bearing Failure",
      "impact": "Axle bearing failure can cause the wheel to fall off, leading to loss of control and potential accidents.",
      "symptoms": [
        "The wheel falls off; the vehicle loses control; there is no indication of a problem before failure."
      ],
      "odiNumbers": [
        "10074679"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Clutch and Gear Shifter Issues",
      "impact": "Clutch and gear shifter issues can cause the vehicle to stall or lose power, leading to accidents or leaving the driver stranded.",
      "symptoms": [
        "The clutch pedal feels soft or spongy; the gear shifter accidentally moves from drive to neutral; the vehicle stalls or loses power."
      ],
      "odiNumbers": [
        "606624"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Check Engine Light Issues",
      "impact": "Check engine light issues can cause the driver to be unaware of potential problems, leading to accidents or leaving the driver stranded.",
      "symptoms": [
        "The check engine light stays on even when there is no apparent problem; other lights stay on even when there is no apparent problem."
      ],
      "odiNumbers": [
        "10641153"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Takata Airbag Recall Parts Unavailability",
      "impact": "The delay in receiving the necessary parts for the Takata airbag recall repair can leave the vehicle in an unsafe condition, potentially leading to accidents or injuries.",
      "symptoms": [
        "None",
        "as the issue is related to the unavailability of parts for the recall repair."
      ],
      "odiNumbers": [
        "11365952",
        "11354950",
        "11351163",
        "11338138",
        "11323181",
        "11321187"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "SRS Warning Indicator Illumination",
      "impact": "The illumination of the SRS warning indicator can indicate a potential problem with the airbag system, which can lead to accidents or injuries if not addressed.",
      "symptoms": [
        "The SRS warning indicator remains illuminated on the dashboard."
      ],
      "odiNumbers": [
        "10904481"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Airbag Failure to Deploy",
      "impact": "The failure of the airbag to deploy in the event of a crash can lead to serious injuries or fatalities.",
      "symptoms": [
        "The airbag does not deploy during a crash",
        "despite the vehicle being equipped with an airbag system."
      ],
      "odiNumbers": [
        "10066998"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}