{
  "totalComplaints": 13,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "SUSPENSION",
    "FUEL SYSTEM",
    "VISIBILITY"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Inadequate Suspension System",
      "impact": "The inadequate suspension system can cause severe handling problems, leading to loss of control, accidents, and potential injuries or fatalities.",
      "symptoms": [
        "The vehicle exhibits poor handling",
        "swaying",
        "or leaning while driving",
        "especially when carrying heavy loads or towing."
      ],
      "odiNumbers": [
        "552227",
        "535596"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Ungreased Wheel Bearings",
      "impact": "Ungreased wheel bearings can cause the wheels to separate from the vehicle, leading to loss of control, accidents, and potential injuries or fatalities.",
      "symptoms": [
        "The wheels may feel loose or wobbly",
        "there may be unusual noises or vibrations while driving",
        "the wheel may separate from the vehicle while in motion."
      ],
      "odiNumbers": [
        "828164",
        "827102"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel Tank Seam Leak",
      "impact": "A fuel tank seam leak can cause fuel to spill onto the ground, creating a fire hazard and potentially leading to accidents or injuries.",
      "symptoms": [
        "Fuel smell or leak around the fuel tank",
        "fuel dripping from the bottom of the vehicle",
        "fuel tank seam showing signs of corrosion or rust."
      ],
      "odiNumbers": [
        "755759"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Fuel Line Corrosion and Leaking",
      "impact": "A corroded and leaking fuel line can cause fuel to spill onto the ground, creating a fire hazard and potentially leading to accidents or injuries.",
      "symptoms": [
        "Fuel smell or leak around the fuel tank or engine",
        "fuel dripping from the fuel lines",
        "fuel lines showing signs of corrosion or rust."
      ],
      "odiNumbers": [
        "751926"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Windshield Structural Integrity Failure",
      "impact": "The failure of the windshield's structural integrity can cause it to crack or shatter, leading to a loss of visibility and increased risk of accidents, as well as potential injury from wind and debris entering the vehicle.",
      "symptoms": [
        "Sudden cracking or shattering of the windshield",
        "wind noise or air entering the vehicle through the windshield",
        "visible cracks or damage to the windshield."
      ],
      "odiNumbers": [
        "10198897"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}