{
  "totalComplaints": 11,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ENGINE AND ENGINE COOLING",
    "SUSPENSION",
    "FUEL SYSTEM"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Camshaft Chain Tensioner Failure",
      "impact": "The failure of the camshaft chain tensioner can cause engine noise, cam chain wear, and potentially lead to premature cam chain failure, resulting in loss of rider control and accidents.",
      "symptoms": [
        "Engine noise",
        "cam chain wear",
        "excessive cam chain noise."
      ],
      "odiNumbers": [
        "720629",
        "719020"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Warranty Dispute and Lack of Safety Recall",
      "impact": "The lack of a safety recall and Kawasaki's refusal to honor the warranty can leave riders unaware of the potential safety risks and without a clear solution to address the issue.",
      "symptoms": [
        "Riders may experience a lack of transparency and support from the manufacturer",
        "leading to frustration and concern for their safety."
      ],
      "odiNumbers": [
        "764920",
        "720629",
        "719020"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Pattern of Failure in Nomad Motorcycles and Vulcan Classics",
      "impact": "The repeated failures of the camshaft chain tensioner in Nomad Motorcycles and Vulcan Classics can lead to a pattern of liability for Kawasaki, potentially affecting multiple owners and riders.",
      "symptoms": [
        "The failures occur at around 20",
        "000 miles",
        "and many bikes are resold multiple times during this period",
        "leaving future owners unaware of the potential issue."
      ],
      "odiNumbers": [
        "719020"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Front End Vibration/Shimmy",
      "impact": "The sudden and violent shaking of the front end can cause loss of control, accidents, or even ejection from the motorcycle, posing a significant risk to the rider's safety.",
      "symptoms": [
        "The front end of the motorcycle starts to shake or shimmy violently while driving",
        "often at various speeds",
        "making it difficult to maintain control."
      ],
      "odiNumbers": [
        "8007728",
        "851751"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Rear Air Shocks Failure",
      "impact": "The lack of air in the rear air shocks can cause the motorcycle to bottom out, leading to potential accidents or damage to the vehicle, and the exposed wiring can lead to electrical issues or fires.",
      "symptoms": [
        "The rear air shocks arrive without air",
        "causing the motorcycle to bottom out at low speeds",
        "and the main wiring harness rubs against the left front forks",
        "exposing the wiring."
      ],
      "odiNumbers": [
        "849597"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Gas Tank Design and Vent Hose Failure",
      "impact": "The faulty design of the gas tank and vent hose can cause gas leaks, leading to fires, and potentially resulting in serious accidents or injuries.",
      "symptoms": [
        "Gas leaks from the vent hose",
        "gas drips onto the exhaust pipe",
        "fire ignites",
        "rust deposits in the tank",
        "water accumulation in the lower portions of the tank",
        "rust-through of the tank",
        "engine seizures",
        "carburetor overflow."
      ],
      "odiNumbers": [
        "10096523",
        "746517"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}