{
  "totalComplaints": 14,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "STRUCTURE",
    "STEERING",
    "VISIBILITY"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Dashboard Malfunction",
      "impact": "A malfunctioning dashboard can cause a range of issues, including faulty gauge readings, warning light malfunctions, and electrical system failures, which can lead to accidents or leave the driver without critical information.",
      "symptoms": [
        "Faulty or inaccurate gauge readings",
        "warning lights remaining illuminated or failing to illuminate",
        "electrical system failures",
        "dashboard lights or displays not functioning properly."
      ],
      "odiNumbers": [
        "565092",
        "565087"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Cab Squeak and Leak",
      "impact": "The squeaking and leaking of the cab can cause discomfort and distraction to the driver, potentially leading to accidents. Additionally, water leaks can lead to electrical system failures, corrosion, and damage to interior components.",
      "symptoms": [
        "Unusual squeaking or creaking noises coming from the cab",
        "water leaks into the cab",
        "water spots or stains on the interior",
        "musty or mildew odor inside the vehicle."
      ],
      "odiNumbers": [
        "565087"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Steering Assist Failure",
      "impact": "The loss of steering assist can lead to increased effort required to steer the vehicle, making it difficult to control, especially at low speeds, which can increase the risk of accidents.",
      "symptoms": [
        "The steering wheel feels heavy or difficult to turn",
        "the steering assist suddenly stops working",
        "the steering assist intermittently fails",
        "especially when turning right."
      ],
      "odiNumbers": [
        "561998",
        "565114"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Windshield Cracking/Corrosion",
      "impact": "A cracked or corroded windshield can impair the driver's visibility, increasing the risk of accidents, and may also compromise the structural integrity of the vehicle.",
      "symptoms": [
        "Cracks or breaks in the windshield",
        "corrosion or rust at the bottom of the windows",
        "windshield glass shattering or blowing out."
      ],
      "odiNumbers": [
        "565114"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Airbag Light Illumination",
      "impact": "An illuminated airbag light can indicate a faulty airbag system, which can fail to deploy in the event of an accident, increasing the risk of injury or fatality.",
      "symptoms": [
        "The airbag light on the dashboard is illuminated",
        "the airbag system is malfunctioning."
      ],
      "odiNumbers": [
        "565114"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Abnormal Tire Wear",
      "impact": "Abnormal tire wear can lead to reduced traction, increasing the risk of accidents, especially on wet or slippery roads.",
      "symptoms": [
        "Uneven tire wear",
        "excessive wear on specific areas of the tire",
        "tires wearing out prematurely."
      ],
      "odiNumbers": [
        "565114"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Windshield Cracking/Blowing Out",
      "impact": "A cracked or blown-out windshield can obstruct the driver's view, leading to accidents or injuries. Additionally, it can compromise the structural integrity of the vehicle, making it more vulnerable to damage in the event of a crash.",
      "symptoms": [
        "The front windshield is cracked or broken",
        "the windshield suddenly shatters or blows out",
        "the driver's view is obstructed by cracks or debris."
      ],
      "odiNumbers": [
        "565114"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Window Corrosion",
      "impact": "Corrosion at the bottom of the windows can lead to water intrusion, electrical issues, and structural weakening of the vehicle. This can compromise the overall safety and reliability of the vehicle.",
      "symptoms": [
        "Rust or corrosion is visible at the bottom of the windows",
        "water leaks into the vehicle through the windows",
        "electrical issues or malfunctioning windows."
      ],
      "odiNumbers": [
        "565114"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}