{
  "totalComplaints": 17,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "AIR BAGS",
    "STRUCTURE",
    "SUSPENSION",
    "SEAT BELTS"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Erroneous Airbag Deployment",
      "impact": "The unexpected deployment of airbags can cause physical harm to the driver and passengers, including burns, bruising, and hair loss, and can lead to accidents or loss of vehicle control.",
      "symptoms": [
        "Airbags deploy without a crash or impact",
        "airbag warning lights illuminate on the dashboard",
        "airbags deploy while driving at high speeds",
        "airbags deploy without any apparent reason."
      ],
      "odiNumbers": [
        "11288210",
        "10544980",
        "10463048",
        "10062030"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Airbag System Malfunction",
      "impact": "A malfunctioning airbag system can lead to failure of the airbags to deploy in the event of an accident, which can increase the risk of injury or fatality to the driver and passengers.",
      "symptoms": [
        "Airbag warning lights illuminate on the dashboard",
        "airbag system malfunction messages appear on the dashboard",
        "airbags fail to deploy in the event of an accident",
        "airbag system resets repeatedly."
      ],
      "odiNumbers": [
        "10062030"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Subframe Failure",
      "impact": "The failure of the rear subframe can cause loss of vehicle control, leading to accidents, and can also lead to premature wear of other components.",
      "symptoms": [
        "Cracks in the rear subframe",
        "separation of the subframe",
        "spot welds coming apart along the edges of the subframe."
      ],
      "odiNumbers": [
        "10185969",
        "10090578"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Rear Differential Mount Failure",
      "impact": "The failure of the rear differential mount can cause loss of vehicle control, leading to accidents, and can also lead to premature wear of other components.",
      "symptoms": [
        "Torn or loose rear differential sheet metal mounting bracket",
        "thin sheet metal brackets and cross member appear inadequate",
        "welded seams coming apart on the floor of the trunk above the differential."
      ],
      "odiNumbers": [
        "10016959"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Convertible Top Window Design Flaw",
      "impact": "The design of the convertible top window can cause impaired visibility and deep scratches on the window, which can lead to accidents.",
      "symptoms": [
        "Putting the top down causes deep scratches and impairs sight of the window when the top is up."
      ],
      "odiNumbers": [
        "10045702"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Subframe/Differential Mount Failure",
      "impact": "The failure of the rear subframe and differential mount can lead to a loss of vehicle control, accidents, and potentially serious injuries or fatalities.",
      "symptoms": [
        "Creaking or clunking noises from the rear of the vehicle",
        "loose spot welds in the trunk floor",
        "broken cross-member welds",
        "and cracks or tears in the body metal."
      ],
      "odiNumbers": [
        "11383583",
        "10970992",
        "10468504"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Seat Belt Retractor Failure",
      "impact": "The failure of the seat belt retractor can cause the seat belt to become locked in the retracted position, making it impossible to use, which can increase the risk of injury or death in the event of an accident.",
      "symptoms": [
        "The seat belt is locked in the retracted position",
        "the seat belt locks intermittently",
        "the seat belt retractor is frozen and cannot be used while driving."
      ],
      "odiNumbers": [
        "10836261",
        "761217"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Driver's Seat Back Bracket Failure",
      "impact": "The failure of the driver's seat back bracket can cause the seat to become unstable, increasing the risk of injury or death in the event of an accident.",
      "symptoms": [
        "The driver's seat back bracket needs to be replaced",
        "the seat system is loose",
        "the seat is unstable."
      ],
      "odiNumbers": [
        "761217"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}