{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "STRUCTURE",
    "ENGINE AND ENGINE COOLING",
    "ELECTRICAL SYSTEM",
    "SERVICE BRAKES",
    "POWER TRAIN"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Cab Floor Board Collapse",
      "impact": "The collapse of the cab floor board can cause loss of structural integrity, leading to potential injuries or accidents, especially if the driver loses control of the vehicle.",
      "symptoms": [
        "The cab floor board collapses or sinks",
        "creating a step-down hazard",
        "making it difficult to enter or exit the vehicle."
      ],
      "odiNumbers": [
        "557870"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Quarter Fender Mount Bolt Failure",
      "impact": "The failure of the quarter fender mount bolts can cause the fenders to detach and fall in front of the drive wheels, potentially causing accidents or injuries, especially if the fenders are flung out sideways at high speed.",
      "symptoms": [
        "The quarter fender mount bolts snap off",
        "allowing the fenders to fall in front of the drive wheels",
        "and potentially causing damage to the vehicle or surrounding objects."
      ],
      "odiNumbers": [
        "557870"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Exhaust System Failure",
      "impact": "The failure of the exhaust system can cause exhaust stacks to vibrate out of the muffler, creating a road hazard, and potentially leading to accidents. Additionally, oil drooling out of the exhaust manifold can create a fire hazard, posing a risk to the vehicle and its occupants.",
      "symptoms": [
        "Exhaust stacks vibrate excessively",
        "exhaust stacks fall out of the muffler",
        "oil drools out of the exhaust manifold",
        "oil co-agulates on the engine block",
        "creating a fire hazard."
      ],
      "odiNumbers": [
        "557870"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Electrical System Failure Leading to Fire",
      "impact": "The failure of the electrical system can cause a sudden and unexpected fire, which can lead to serious injuries, fatalities, and significant damage to the vehicle.",
      "symptoms": [
        "Sudden and unexplained fire on the vehicle",
        "especially on the right side",
        "arcing wires",
        "blown fuses",
        "no warning signs or smells before the fire."
      ],
      "odiNumbers": [
        "10109010"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Intermittent Failure of ABS System and Service Brakes",
      "impact": "The intermittent failure of the ABS system and service brakes can lead to a loss of vehicle control, increasing the risk of accidents and injuries.",
      "symptoms": [
        "The ABS light illuminates on the dashboard",
        "the brake pedal feels spongy or soft",
        "the vehicle takes longer to stop than usual",
        "the brakes make a grinding or screeching noise",
        "the vehicle pulls to one side while braking",
        "the brakes fail to engage or respond intermittently."
      ],
      "odiNumbers": [
        "557870"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Transmission Noise and Uphill Shifting Issues",
      "impact": "The transmission noise and uphill shifting issues can cause the vehicle to lose power, hesitate, or fail to engage higher gears, leading to reduced acceleration, decreased fuel efficiency, and potential safety risks when driving uphill or merging onto highways.",
      "symptoms": [
        "Unusual transmission noise",
        "slow or hesitant upshifting",
        "failure to engage higher gears",
        "free-wheeling without engaging higher gear",
        "especially when driving uphill or carrying heavy loads."
      ],
      "odiNumbers": [
        "557870"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}