{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "AIR BAGS",
    "UNKNOWN OR OTHER",
    "POWER TRAIN",
    "VEHICLE SPEED CONTROL",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Delayed or Unavailable Recall Parts for Airbag Repair",
      "impact": "The unavailability of recall parts for airbag repairs can leave vehicles without critical safety features, increasing the risk of injury or death in the event of an accident.",
      "symptoms": [
        "Receipt of recall notification",
        "inability to schedule repair due to part unavailability",
        "delayed or failed delivery of recall parts",
        "lack of communication from dealership or manufacturer regarding part availability."
      ],
      "odiNumbers": [
        "10817058",
        "10782809"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Ceiling Lining Failure",
      "impact": "The failure of the rear ceiling lining can cause debris to fall from the ceiling, creating a distraction for the driver and potentially obstructing their view, which can lead to accidents.",
      "symptoms": [
        "The lining begins to fall from the rear ceiling of the vehicle",
        "the glue that holds the lining in place wears out",
        "debris falls from the ceiling."
      ],
      "odiNumbers": [
        "10243544"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Adhesive Failure (Rear Ceiling Lining)",
      "impact": "The failure of the adhesive that holds the rear ceiling lining in place can cause the lining to detach, creating a distraction for the driver and potentially obstructing their view, which can lead to accidents.",
      "symptoms": [
        "The glue that holds the lining in place wears out",
        "the lining begins to fall from the rear ceiling of the vehicle",
        "debris falls from the ceiling."
      ],
      "odiNumbers": [
        "10243544"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Premature Clutch Failure",
      "impact": "Premature clutch failure can cause the clutch to malfunction, leading to difficulty shifting gears, and potentially causing accidents or leaving the driver stranded.",
      "symptoms": [
        "The clutch fails prematurely",
        "the clutch pedal feels soft or spongy",
        "the clutch pedal sticks to the floor",
        "the clutch pedal does not return to its normal position",
        "the clutch pedal has a delayed return to its normal position",
        "the clutch pedal has a sudden loss of pressure",
        "the vehicle is unable to shift into gear."
      ],
      "odiNumbers": [
        "10115220"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Intermittent Loss of Power",
      "impact": "The intermittent loss of power while driving can cause the vehicle to stall or slow down unexpectedly, increasing the risk of accidents, especially on highways or busy roads.",
      "symptoms": [
        "The vehicle suddenly loses power",
        "the accelerator pedal has no effect or minimal effect on the vehicle's speed",
        "the vehicle barely moves despite pressing the accelerator pedal to the floor."
      ],
      "odiNumbers": [
        "10113183"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Premature Front Brake Rotor Warping",
      "impact": "Premature warping of the front brake rotors can cause vibrations, uneven braking, and reduced stopping power, which can increase the risk of accidents and compromise vehicle safety.",
      "symptoms": [
        "Vibrations or pulsations when applying the brakes",
        "uneven braking",
        "squealing or grinding noises when braking",
        "excessive brake dust",
        "and reduced stopping power."
      ],
      "odiNumbers": [
        "10097243"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Inadequate Brake Rotor Replacement",
      "impact": "Failure to properly diagnose and address the underlying cause of premature brake rotor warping can lead to repeated failures, increased repair costs, and continued safety risks.",
      "symptoms": [
        "Repeated brake rotor replacements",
        "persistent brake-related issues despite repairs",
        "and continued vibrations or uneven braking."
      ],
      "odiNumbers": [
        "10097243"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}