{
  "totalComplaints": 10,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "FUEL SYSTEM",
    "SEAT BELTS",
    "EXTERIOR LIGHTING",
    "VEHICLE SPEED CONTROL",
    "SEATS"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Fuel Filler Neck Corrosion and Leaks",
      "impact": "Corrosion and leaks in the fuel filler neck can cause fuel spills, odors, and potentially lead to fires or explosions, posing a significant risk to vehicle occupants and bystanders.",
      "symptoms": [
        "Strong odor of gasoline when filling the tank",
        "visible fuel leaks or pools of gasoline under the vehicle",
        "rust or corrosion on the fuel filler neck or surrounding components."
      ],
      "odiNumbers": [
        "10456403",
        "10438046"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Seatbelt Lock-Up and Restriction",
      "impact": "The lock-up of the rear seatbelts can cause discomfort and potentially lead to unsafe situations where passengers may need to remove their seatbelts while the vehicle is in motion.",
      "symptoms": [
        "The rear seatbelts lock up or become overly tight",
        "causing discomfort and restricting movement",
        "passengers need to remove their seatbelts to readjust",
        "the belts get tighter and tighter if not taken off."
      ],
      "odiNumbers": [
        "10121424"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Sharp Plastic Component in Rear Seat Area",
      "impact": "The sharp plastic component in the rear seat area can cause cuts and lacerations to passengers, potentially leading to injuries.",
      "symptoms": [
        "Passengers may experience cuts or lacerations from coming into contact with the sharp plastic disk",
        "the component is as sharp as a knife",
        "the injury can occur during normal entry or exit from the vehicle."
      ],
      "odiNumbers": [
        "10010613"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Excessive Headlight Glare",
      "impact": "The excessive glare from the headlights can cause temporary blindness or distraction to oncoming traffic, increasing the risk of accidents and potentially leading to fatalities.",
      "symptoms": [
        "Blinding or excessive glare from the headlights",
        "difficulty seeing the road ahead",
        "discomfort or pain from the intense light",
        "feeling of being \"dazzled\" or disoriented."
      ],
      "odiNumbers": [
        "11142494"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unintended Acceleration",
      "impact": "Unintended acceleration can cause the vehicle to suddenly and unexpectedly gain speed, potentially leading to accidents, injuries, or fatalities.",
      "symptoms": [
        "The vehicle suddenly accelerates without input from the driver",
        "continues to gain speed even when the foot is removed from the accelerator pedal",
        "and may require riding the brakes to slow down or maintain a safe speed."
      ],
      "odiNumbers": [
        "10576926"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Driver Seat Heater Electrical Shortage",
      "impact": "An electrical shortage in the driver seat heater can cause the seat to become extremely hot, potentially scorching the seat and posing a burn risk to the driver.",
      "symptoms": [
        "The driver seat becomes extremely hot while driving",
        "the seat is scorching or burning",
        "there is an unusual smell of burning or melting plastic."
      ],
      "odiNumbers": [
        "10345296"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}