{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "VEHICLE SPEED CONTROL",
    "SUSPENSION",
    "ENGINE AND ENGINE COOLING",
    "POWER TRAIN",
    "VISIBILITY"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Throttle Sticking Open",
      "impact": "The throttle sticking open can cause unintended acceleration, leading to loss of control, accidents, and injuries. This can result in serious harm to the rider and others involved.",
      "symptoms": [
        "The throttle does not return to its original position when released",
        "leading to continued acceleration",
        "making it difficult to control the motorcycle",
        "and potentially causing accidents."
      ],
      "odiNumbers": [
        "10093696",
        "10053904"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Balance Tensioner Failure",
      "impact": "The failure of the balance tensioner can cause catastrophic engine failure, leading to a loss of control and potential accidents.",
      "symptoms": [
        "None reported",
        "as the failure is internal and may not exhibit symptoms until it's too late."
      ],
      "odiNumbers": [
        "10043355"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Frame Misalignment",
      "impact": "The misalignment of the frame can cause the front tire to slide to the left in wet conditions, leading to a loss of control and potential accidents.",
      "symptoms": [
        "The front tire slides to the left in wet conditions",
        "affecting handling and stability."
      ],
      "odiNumbers": [
        "10019478"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Balancer Tensioner Lever Failure on Idler Shaft",
      "impact": "The failure of the balancer tensioner lever on the idler shaft can cause the engine to stall, leading to loss of control and potential accidents.",
      "symptoms": [
        "Engine stalling",
        "loss of power",
        "sudden engine failure."
      ],
      "odiNumbers": [
        "10018484",
        "8022079"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Clutch Lever Noise",
      "impact": "The loud buzzing noise from the clutch lever can be a distraction while riding, making it difficult to focus on the road, and potentially leading to accidents.",
      "symptoms": [
        "A loud buzzing or grinding noise comes from the clutch lever",
        "especially when the clutch is engaged or disengaged",
        "making it difficult to hear other sounds",
        "such as engine noise or wind noise."
      ],
      "odiNumbers": [
        "10091737"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear View Mirror Obstruction",
      "impact": "The rear view mirror placement on the Kawasaki Z1000 (ZR1000A) can cause a significant blind spot, making it difficult for the driver to see the rear of the vehicle, which can increase the risk of accidents or collisions.",
      "symptoms": [
        "The rear view mirror is obstructed by the driver's elbows or arms",
        "making it impossible to obtain a clear view of the rear of the vehicle",
        "even with adjustments."
      ],
      "odiNumbers": [
        "10041372"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}