{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "WHEELS",
    "UNKNOWN OR OTHER",
    "ELECTRICAL SYSTEM",
    "EQUIPMENT",
    "SUSPENSION"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Wheel Corrosion and Chrome Plating Failure",
      "impact": "The corrosion of the wheels and failure of the chrome plating can cause the tire bead to not seal properly, leading to abnormal air leaks, which can result in tire blowouts, accidents, and loss of vehicle control.",
      "symptoms": [
        "The tires leak air abnormally",
        "requiring frequent inflation",
        "the tire pressure warning light comes on",
        "the wheels have visible corrosion or rust",
        "the chrome plating has bubbles or defects."
      ],
      "odiNumbers": [
        "10400600",
        "10372210",
        "10227691"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Inaccurate OnStar System Information",
      "impact": "The provision of incorrect information about the OnStar system's capabilities and compatibility can lead to consumer disappointment, frustration, and a sense of being misled. This can also result in the loss of a safety feature that was expected to be available for the life of the vehicle.",
      "symptoms": [
        "Dealership or manufacturer representatives provide incorrect information about the OnStar system's digital readiness",
        "leading to consumer reliance on the system's functionality beyond its actual capabilities."
      ],
      "odiNumbers": [
        "10194333",
        "10192160"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inability to Upgrade OnStar System to Digital",
      "impact": "The inability to upgrade the OnStar system to digital can result in the loss of a safety feature that was expected to be available for the life of the vehicle, leaving consumers without a critical safety feature.",
      "symptoms": [
        "Consumers are informed that their OnStar system cannot be upgraded to digital",
        "rendering the system inoperable beyond a certain date",
        "despite initial assurances of its continued functionality."
      ],
      "odiNumbers": [
        "10192160"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Ignition Tumbler Failure",
      "impact": "The failure of the ignition tumbler can prevent the key from being inserted into the ignition, making it impossible to start the vehicle, which can leave the driver stranded.",
      "symptoms": [
        "The key cannot be inserted into the ignition",
        "the key gets stuck in the ignition",
        "the ignition is difficult to turn",
        "the vehicle cannot be started."
      ],
      "odiNumbers": [
        "10432222"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Misrepresentation of Safety Features and On-Star System",
      "impact": "The misrepresentation of safety features, specifically the On-Star system, can lead to a false sense of security for the vehicle owner, potentially putting them at risk in emergency situations. Additionally, the refusal to honor the salesperson's pledge to update the system can result in a financial loss for the owner.",
      "symptoms": [
        "The vehicle does not have the expected safety features",
        "the On-Star system is not digital ready",
        "the dealer and manufacturer refuse to update the system",
        "the dealer and manufacturer deny any wrongdoing",
        "and the owner is offered an inadequate compensation."
      ],
      "odiNumbers": [
        "10239063"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Failure of Dealership to Disclose Accurate Information",
      "impact": "The failure of the dealership to disclose accurate information about the vehicle's safety features can lead to a loss of trust and potential financial loss for the owner. It can also result in the owner being unaware of potential safety risks.",
      "symptoms": [
        "The dealer misrepresents the vehicle's safety features",
        "the dealer fails to disclose accurate information about the On-Star system",
        "the dealer denies any wrongdoing",
        "and the owner is offered an inadequate compensation."
      ],
      "odiNumbers": [
        "10239063"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "High-Speed Vibration or Shimmy",
      "impact": "The high-speed vibration or shimmy can cause loss of control, reduced traction, and increased stopping distances, which can lead to accidents or injuries.",
      "symptoms": [
        "The vehicle experiences a high-speed vibration or shimmy",
        "often felt through the steering wheel",
        "seat",
        "or floor",
        "typically above 50-60 mph",
        "and may be accompanied by uneven tire wear",
        "despite repeated tire replacements and balancing."
      ],
      "odiNumbers": [
        "10209616"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}