{
  "totalComplaints": 10,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "WHEELS",
    "ELECTRICAL SYSTEM",
    "TIRES"
  ],
  "parsedComplaintsResultLength": 4,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Delayed or Unavailable Repair Parts for Rear Wheel Recall",
      "impact": "The delay or unavailability of repair parts for the rear wheel recall can lead to a potential safety risk, as the rear wheel may crack or come apart, causing loss of control or accidents.",
      "symptoms": [
        "Owners receive recall notices",
        "but dealerships are unable to perform the repair due to the unavailability of parts",
        "which are often on backorder for several months."
      ],
      "odiNumbers": [
        "10355147",
        "10321531",
        "10313606",
        "10290618",
        "10277828",
        "10275336"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Incomplete or Inadequate Repair of Rear Wheel",
      "impact": "The incomplete or inadequate repair of the rear wheel can lead to a potential safety risk, as the wheel may not be properly balanced or secured, causing loss of control or accidents.",
      "symptoms": [
        "Owners experience continued problems with the rear wheel after the recall repair",
        "including issues with balancing the wheel."
      ],
      "odiNumbers": [
        "10281654"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Electronic Handlebar Control (EHC) Failure",
      "impact": "The failure of the Electronic Handlebar Control (EHC) can cause the vehicle to fail to start, leading to inconvenience and potential safety risks, especially if the vehicle stalls while in operation.",
      "symptoms": [
        "The vehicle fails to start",
        "power failures while the motorcycle is being operated."
      ],
      "odiNumbers": [
        "10650263",
        "10334071"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Tread Separation on Avon Tire 300 AV72",
      "impact": "The tread separation on the Avon Tire 300 AV72 can cause loss of control, accidents, and potentially lead to fatalities, especially at high speeds.",
      "symptoms": [
        "The tread separates down the center of the tire",
        "often with less than 3000 miles of usage",
        "resulting in a sudden loss of traction and control."
      ],
      "odiNumbers": [
        "10422289"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}