{
  "totalComplaints": 25,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "STEERING",
    "TIRES",
    "SUSPENSION"
  ],
  "parsedComplaintsResultLength": 3,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Steering Oscillation (Death Wobble)",
      "impact": "The steering oscillation, also known as the \"Death Wobble,\" can cause the driver to lose control of the vehicle, potentially leading to accidents or near-miss situations.",
      "symptoms": [
        "The steering wheel shakes or wobbles violently",
        "often when driving at speeds of 30-70 mph and hitting a bump or uneven pavement. The vehicle may pull to one side",
        "and the driver may need to slow down or stop to regain control. The issue can occur when the vehicle is empty or loaded",
        "and may be accompanied by a loud noise or vibration."
      ],
      "odiNumbers": [
        "10670084",
        "10557146",
        "10521135",
        "10463493",
        "10363678",
        "10360616",
        "10275802",
        "10265488",
        "10252555"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Tire Failure Due to Belt Separation or Tread Separation",
      "impact": "Sudden tire failure due to belt separation or tread separation can cause loss of vehicle control, accidents, and damage to the vehicle, leading to potential injuries or fatalities.",
      "symptoms": [
        "Tire blowout",
        "sudden loss of air pressure",
        "unusual tire noise",
        "tire vibration",
        "tire damage",
        "and separation of the tread or belt from the tire."
      ],
      "odiNumbers": [
        "11230126",
        "10682044",
        "10608629",
        "10840411"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Front Suspension and Steering System Failure",
      "impact": "The failure of the front suspension and steering system can cause the vehicle to vibrate violently, leading to loss of control, accidents, and potentially serious injuries or fatalities.",
      "symptoms": [
        "The front end of the vehicle and steering wheel vibrate violently",
        "the vehicle shakes violently",
        "the vehicle wobbles after hitting a bump",
        "the vehicle requires slowing down to unsafe speeds or stopping completely to stop the wobbling."
      ],
      "odiNumbers": [
        "10818907",
        "10503036",
        "10402520"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}