{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "ENGINE",
    "POWER TRAIN",
    "SUSPENSION",
    "STRUCTURE"
  ],
  "parsedComplaintsResultLength": 4,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Excessive Oil Consumption",
      "impact": "Excessive oil consumption can lead to premature engine wear, engine failure, and potentially cause accidents due to engine stalling or loss of power.",
      "symptoms": [
        "The vehicle consumes an abnormal amount of engine oil",
        "requiring frequent oil top-offs",
        "oil levels drop rapidly",
        "oil reservoir is near empty after a short period of time",
        "engine smoke is visible from the exhaust."
      ],
      "odiNumbers": [
        "11510892",
        "11463253",
        "11433654",
        "11399656",
        "11398976",
        "11321316"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Engine Failure due to Oil Defect",
      "impact": "The engine failure caused by the oil defect can lead to sudden loss of power, stalling, and potentially cause accidents, especially if it occurs while driving at high speeds. This defect can also result in costly repairs, including engine replacement or rebuilding.",
      "symptoms": [
        "The vehicle jerks and dies while driving",
        "the engine stalls",
        "the engine restarts after stalling",
        "unusual noises or vibrations from the engine",
        "loss of power or performance."
      ],
      "odiNumbers": [
        "11396135"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Lack of Disclosure and Accountability by Manufacturer",
      "impact": "The failure of the manufacturer to disclose known defects and take responsibility for rectifying the issue can lead to financial losses for customers, damage to the manufacturer's reputation, and erosion of trust in the brand.",
      "symptoms": [
        "Customers are unaware of existing defects when purchasing the vehicle",
        "customers are left to bear the cost of repairs or replacement",
        "customers experience frustration and anger due to the manufacturer's lack of accountability."
      ],
      "odiNumbers": [
        "11396135"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Hatch Trim Plate Failure",
      "impact": "The detachment of the rear hatch trim plate can cause it to swing while driving, scratching the surrounding body panels, and potentially becoming airborne if the retaining cable breaks, posing a risk to other road users and pedestrians.",
      "symptoms": [
        "The rear hatch trim plate detaches and hangs by a cable",
        "swings while driving",
        "scratches the bottom of the hatch and back fender",
        "and may become airborne if the cable breaks."
      ],
      "odiNumbers": [
        "10979973"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}