{
  "totalComplaints": 10,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "ENGINE AND ENGINE COOLING",
    "WHEELS",
    "FUEL SYSTEM",
    "POWER TRAIN",
    "VISIBILITY"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Intermittent Engine Stalling",
      "impact": "The intermittent stalling of the engine can cause the motorcycle to suddenly lose power, leading to a loss of control, accidents, or leaving the rider stranded in remote areas or busy city streets.",
      "symptoms": [
        "The engine cuts out completely without warning",
        "the motorcycle stalls while cornering or downshifting",
        "the motorcycle surges like it's not taking fuel",
        "the engine won't immediately restart",
        "the motorcycle can restart after a minute",
        "the motorcycle may make a few more miles before stalling again."
      ],
      "odiNumbers": [
        "10354976",
        "10325748",
        "10240591"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Premature Rear Wheel Bearing Failure",
      "impact": "The premature failure of the rear wheel bearing can cause the drive belt to shift out of place, leading to a loud squeaking sound, and potentially causing loss of control or accidents.",
      "symptoms": [
        "Loud squeaking sound coming from the rear wheel",
        "drive belt shifting out from the wheel",
        "premature wear of the rear wheel bearing."
      ],
      "odiNumbers": [
        "11310014",
        "10607546"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel Pump Failure",
      "impact": "The failure of the fuel pump can cause the motorcycle to stall without warning, which can lead to accidents or leave the rider stranded.",
      "symptoms": [
        "The motorcycle stalls without warning",
        "the motorcycle shuts off while traveling at various speeds",
        "the motorcycle stalls more frequently in warm weather",
        "the motorcycle stalls when the fuel tank is less than half full."
      ],
      "odiNumbers": [
        "10352995",
        "10351416"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Wheel Bearing Failure",
      "impact": "The failure of the rear wheel bearing can cause the wheel to seize while riding, leading to loss of control of the vehicle, which can result in accidents and injuries.",
      "symptoms": [
        "The rear wheel bearing failure can cause the wheel to seize",
        "leading to loss of control of the vehicle",
        "and potentially causing accidents."
      ],
      "odiNumbers": [
        "11210442"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inadequate Recall Procedure",
      "impact": "The inadequate recall procedure for the rear wheel bearing failure can lead to incomplete repairs, putting the vehicle operator at risk of accidents and injuries.",
      "symptoms": [
        "The recall procedure only requires a single inspection",
        "and if no damage is found",
        "the recall is marked as complete",
        "regardless of the vehicle's mileage. This can lead to vehicles being returned to service without proper repairs",
        "putting the operator at risk."
      ],
      "odiNumbers": [
        "11210442"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear View Mirror Design Flaw",
      "impact": "The poorly designed rear view mirrors can cause a significant obstruction to the operator's rear view, leading to a high risk of accidents, especially when making left-hand turns, and potentially resulting in serious injury or death.",
      "symptoms": [
        "The rear view mirrors are obstructed by the operator's hands and forearms",
        "making it difficult or impossible to see behind the vehicle",
        "requiring the operator to remove their hands from the handlebars to adjust the mirrors",
        "and creating a distraction that can endanger the operator and others."
      ],
      "odiNumbers": [
        "10365423"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}