{
  "totalComplaints": 39,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "AIR BAGS",
    "VISIBILITY/WIPER",
    "STRUCTURE",
    "VISIBILITY"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Takata Airbag Inflator Recall Issues",
      "impact": "The failure to repair or replace the Takata airbag inflator can lead to serious injury or death in the event of an accident, as the airbag may not deploy properly or may rupture, causing shrapnel to be expelled into the passenger compartment.",
      "symptoms": [
        "None reported",
        "as the issue is related to a recall and not a specific failure or malfunction."
      ],
      "odiNumbers": [
        "11229331",
        "11032392",
        "11003105",
        "10972305",
        "10943805",
        "10940022",
        "10929932",
        "10928846",
        "10928515",
        "10917835",
        "10909173",
        "10907092",
        "10906595",
        "10885116",
        "10873714",
        "10870001",
        "10860388"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Lack of Communication and Availability of Replacement Parts",
      "impact": "The lack of communication and availability of replacement parts can lead to frustration and anxiety for vehicle owners, as they may be unable to have their vehicles repaired in a timely manner, potentially putting themselves and others at risk.",
      "symptoms": [
        "Vehicle owners report receiving recall notices but being unable to have their vehicles repaired due to the unavailability of replacement parts",
        "lack of communication from dealerships and manufacturers",
        "and long wait times for appointments."
      ],
      "odiNumbers": [
        "11032392",
        "11003105",
        "10972305",
        "10940022",
        "10909173",
        "10907092",
        "10906595",
        "10873714"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Dealer Failure to Comply with Recall Repairs",
      "impact": "The failure of dealerships to comply with recall repairs can lead to a delay in the repair of potentially life-threatening safety issues, putting vehicle owners and others at risk.",
      "symptoms": [
        "Vehicle owners report that dealerships are not complying with recall repairs",
        "citing lack of availability of replacement parts",
        "lack of trained technicians",
        "or simply refusing to perform the repairs."
      ],
      "odiNumbers": [
        "11003105",
        "10972305",
        "10873714"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Window Separation from Convertible Top",
      "impact": "The separation of the rear window from the convertible top can cause the glass to fall off while driving, leading to a potential safety hazard, accidents, or injuries.",
      "symptoms": [
        "The rear window becomes detached from the convertible top",
        "mainly at the bottom portion",
        "and may swing around while driving",
        "causing a loud wind noise",
        "and potentially falling off the vehicle."
      ],
      "odiNumbers": [
        "11421662",
        "11230887",
        "11194430",
        "11010550",
        "10897848",
        "10895588",
        "10663277"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Window Adhesive Failure in Convertible Top",
      "impact": "The failure of the adhesive attaching the rear window to the convertible top can cause the window to detach while driving, potentially leading to accidents, injuries, or fatalities.",
      "symptoms": [
        "The rear window glass separates from the convertible top",
        "the rear window falls out or becomes loose",
        "a loud rattling or wind noise is heard from the rear of the vehicle",
        "the rear window assembly partially or completely detaches from the convertible top."
      ],
      "odiNumbers": [
        "10914067",
        "10888566",
        "10705408",
        "10664135",
        "10532177",
        "10512807"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Window Detachment in Convertible Top",
      "impact": "The detachment of the rear window from the convertible top can cause glass shattering, injury, or damage to the vehicle's interior and exterior, and may also obstruct the driver's rear view, potentially leading to accidents.",
      "symptoms": [
        "The rear window starts to separate and fall out of the convertible top",
        "the adhesive on the rear glass window becomes loose",
        "the rear window detaches from the frame without warning."
      ],
      "odiNumbers": [
        "10914074",
        "10876330",
        "10629563",
        "10604781",
        "10565470"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}