{
  "totalComplaints": 44,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "UNKNOWN OR OTHER",
    "STRUCTURE"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Failure of ZAP to Comply with NHTSA Recall Order",
      "impact": "The failure of ZAP to comply with the NHTSA recall order has resulted in owners being unable to drive their vehicles, facing insurance and registration issues, and experiencing financial losses.",
      "symptoms": [
        "Owners have not received payment or communication from ZAP",
        "despite submitting required paperwork and meeting deadlines. Vehicles are sitting idle",
        "and owners are facing local code violations."
      ],
      "odiNumbers": [
        "10579086",
        "10573013",
        "10568538",
        "10567985",
        "10567042",
        "10566598",
        "10566467",
        "10563254",
        "10562872",
        "10562977",
        "10562644",
        "10562710",
        "10562559",
        "10562595",
        "10562514",
        "10562008",
        "10560315",
        "10559358",
        "10559056",
        "10558191",
        "10558214",
        "10557345",
        "10557127",
        "10556391",
        "10554895",
        "10553387",
        "10536944",
        "10533385"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Brake System Failure",
      "impact": "The failure of the brake system can cause accidents, injuries, or fatalities.",
      "symptoms": [
        "The brake pedal feels soft or spongy",
        "the brake pedal sticks to the floor",
        "the brake pedal does not return to its normal position",
        "the brake pedal has a delayed return to its normal position",
        "the brake pedal has a sudden loss of pressure",
        "the vehicle is unable to stop."
      ],
      "odiNumbers": [
        "10579086",
        "10573013",
        "10568538",
        "10567985",
        "10567042",
        "10566598",
        "10566467",
        "10563254",
        "10562872",
        "10562977",
        "10562644",
        "10562710",
        "10562559",
        "10562595",
        "10562514",
        "10562008",
        "10560315",
        "10559358",
        "10559056",
        "10558191",
        "10558214",
        "10557345",
        "10557127",
        "10556391",
        "10554895",
        "10553387",
        "10536944",
        "10533385"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Failure of ZAP to Repurchase Vehicles with Defects",
      "impact": "ZAP's failure to repurchase vehicles with defects as ordered by NHTSA can lead to continued operation of unsafe vehicles, potentially causing accidents or injuries to drivers and passengers.",
      "symptoms": [
        "Vehicle owners have not been contacted by ZAP to arrange for payment and/or pickup of defective vehicles",
        "despite the company's agreement to do so; ZAP continues to advertise and sell defective vehicles on online marketplaces without adequate disclosure of the problems."
      ],
      "odiNumbers": [
        "10568046",
        "10282701"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Deceptive Business Practices",
      "impact": "ZAP's failure to disclose defects in their vehicles can lead to unsuspecting buyers purchasing unsafe vehicles, potentially causing accidents or injuries to drivers and passengers.",
      "symptoms": [
        "ZAP continues to advertise and sell defective vehicles on online marketplaces without adequate disclosure of the problems; vehicle owners are not informed about the defects and potential safety risks."
      ],
      "odiNumbers": [
        "10282701"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Failure to Comply with Recall and Buyback",
      "impact": "The failure of the manufacturer to comply with the recall and buyback program has left vehicle owners with worthless vehicles that cannot be insured or registered, causing significant financial loss and inconvenience.",
      "symptoms": [
        "Vehicle owners are unable to insure or register their vehicles",
        "manufacturers are unresponsive to communication",
        "and recall refunds have not been processed."
      ],
      "odiNumbers": [
        "10560283"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Insufficient Braking Performance",
      "impact": "The insufficient braking performance of the vehicle can increase the risk of accidents, injuries, and fatalities, as well as lead to financial losses and legal liabilities.",
      "symptoms": [
        "The vehicle takes longer than expected to stop",
        "the brakes feel soft or spongy",
        "the vehicle is unable to stop quickly enough to avoid accidents",
        "the brakes are unresponsive or fail to engage."
      ],
      "odiNumbers": [
        "10515937"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}