{
  "totalComplaints": 15,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ENGINE AND ENGINE COOLING",
    "FUEL SYSTEM",
    "EXTERIOR LIGHTING"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Engine Stalling in Rainy Conditions",
      "impact": "The engine stalling in rainy conditions can cause loss of control, skidding, and accidents, especially when the motorcycle is traveling at high speeds or cornering.",
      "symptoms": [
        "The engine stalls when slowing down",
        "shifting gears",
        "or coasting with the clutch disengaged in rainy conditions; the motorcycle may not restart immediately; water pooling in the airbox and charcoal canister; erratic response or failure to accelerate when pulling into traffic."
      ],
      "odiNumbers": [
        "10324644",
        "10316089",
        "10281359",
        "10279885",
        "10274958",
        "10274260",
        "10265061",
        "10262215"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Clutch-Related Issues",
      "impact": "The clutch-related issues can cause the engine to stall, leading to loss of control, skidding, and accidents, especially when the motorcycle is traveling at high speeds or cornering.",
      "symptoms": [
        "The clutch pedal feels soft or spongy; the clutch pedal sticks to the floor; the clutch pedal does not return to its normal position; the clutch pedal has a delayed return to its normal position; the clutch pedal has a sudden loss of pressure; the vehicle is unable to shift into gear."
      ],
      "odiNumbers": [
        "10281359",
        "10279885",
        "10274958",
        "10274260",
        "10262215"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Airbox and Charcoal Canister Water Ingress",
      "impact": "Water ingress into the airbox and charcoal canister can cause the engine to stall, leading to loss of control, skidding, and accidents, especially when the motorcycle is traveling at high speeds or cornering.",
      "symptoms": [
        "Water pooling in the airbox and charcoal canister; engine stalling in rainy conditions; erratic response or failure to accelerate when pulling into traffic."
      ],
      "odiNumbers": [
        "10274958",
        "10274260"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Engine Stalling Due to Water Ingress",
      "impact": "The engine stalling due to water ingress can cause a loss of control, especially when driving in the rain, and lead to accidents or leave the rider stranded.",
      "symptoms": [
        "The engine stalls when downshifting",
        "the engine stalls in rainy conditions",
        "the engine stalls when disengaging the clutch",
        "the engine is difficult to restart",
        "the engine sputters and misfires when restarting",
        "the bike surges and jerks when starting and stopping",
        "the idle is very jumpy."
      ],
      "odiNumbers": [
        "10281906",
        "10280276",
        "10264964"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Headlight Reflector Housing Failure",
      "impact": "The overheating of the headlight reflector housing can cause a significant reduction in headlight brightness, reducing visibility and increasing the risk of accidents, especially at night or in low-light conditions.",
      "symptoms": [
        "The headlight beam appears dim or yellowish",
        "the headlight reflector housing is discolored or blackened",
        "the headlight unit is excessively hot to the touch."
      ],
      "odiNumbers": [
        "10347528"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Headlight Unit Failure",
      "impact": "The failure of the headlight unit can cause a complete loss of headlight function, reducing visibility and increasing the risk of accidents, especially at night or in low-light conditions.",
      "symptoms": [
        "The headlight does not turn on",
        "the headlight is dim or flickering",
        "the headlight unit is excessively hot to the touch."
      ],
      "odiNumbers": [
        "10347528"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}