{
  "totalComplaints": 36,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "AIR BAGS",
    "ELECTRICAL SYSTEM",
    "SEATS"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Passenger Airbag Sensor Failure",
      "impact": "The failure of the passenger airbag sensor can cause the airbag to malfunction, leading to potential injury or fatality in the event of an accident.",
      "symptoms": [
        "The \"Service Airbag\" warning light illuminates on the dashboard",
        "the passenger airbag indicator light on the dashboard remains off or flickers",
        "and the airbag may not deploy in the event of an accident."
      ],
      "odiNumbers": [
        "11483284",
        "11438826",
        "11407099",
        "11384058",
        "11129466",
        "11128558",
        "11118529",
        "11092110",
        "11067224",
        "11040323",
        "11024168",
        "10968666",
        "10887796",
        "10881939",
        "10811641",
        "10762517",
        "10711930",
        "10622506",
        "10611313",
        "10605001",
        "10584012",
        "10576347",
        "10550941",
        "10524652",
        "10522499",
        "10482206"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Parts Distribution Disconnect",
      "impact": "The unavailability of parts for the recall repair can lead to a delay in fixing the safety issue, putting the driver and passengers at risk.",
      "symptoms": [
        "The dealer is unable to obtain the necessary parts to perform the recall repair",
        "and the vehicle owner is left without a functional airbag system."
      ],
      "odiNumbers": [
        "11129466",
        "11128558",
        "11118529",
        "11040323",
        "11024168",
        "10968666"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Inadequate Recall Repair",
      "impact": "The ineffective repair of the passenger airbag sensor can lead to the continued malfunction of the airbag system, putting the driver and passengers at risk.",
      "symptoms": [
        "The \"Service Airbag\" warning light continues to illuminate after the recall repair",
        "and the airbag system may not function properly."
      ],
      "odiNumbers": [
        "11438826",
        "11092110",
        "10711930",
        "10584012"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Airbag Sensor Failure",
      "impact": "The failure of the airbag sensor can cause the airbag system to malfunction, leading to failure to deploy in the event of an accident, which can result in serious injury or death.",
      "symptoms": [
        "The passenger airbag indicator light is on",
        "the passenger airbag sensor light is on",
        "the airbag system fails to deploy in the event of an accident."
      ],
      "odiNumbers": [
        "10745881",
        "10644518",
        "10643448"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Ignition Switch Failure",
      "impact": "The failure of the ignition switch can cause the vehicle to stall or fail to turn off, leading to a loss of control and increasing the risk of accidents.",
      "symptoms": [
        "The vehicle stalls or fails to turn off",
        "the ignition switch is difficult to turn",
        "the vehicle's electrical system malfunctions."
      ],
      "odiNumbers": [
        "10658504",
        "10621949",
        "10566497"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Delayed or Unavailable Repair Parts",
      "impact": "The delay or unavailability of repair parts can leave vehicles in an unsafe condition, increasing the risk of accidents and injuries.",
      "symptoms": [
        "The dealer informs the consumer that the parts are not available",
        "the consumer is placed on a waiting list",
        "the repair is delayed or cannot be completed."
      ],
      "odiNumbers": [
        "10658504",
        "10621949"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Passenger Presence Sensor (PPS) Failure",
      "impact": "The failure of the PPS can cause the passenger airbag to malfunction, leading to potential safety risks in the event of an accident. The faulty sensor can also cause the airbag warning light to illuminate on the dashboard, creating a distraction for the driver.",
      "symptoms": [
        "The passenger airbag turns off or on randomly",
        "the service airbag light appears on the dashboard",
        "the passenger airbag is deactivated despite having a passenger over 150 pounds",
        "the airbag warning light remains on even when there is no passenger or the passenger is not over 150 pounds."
      ],
      "odiNumbers": [
        "11337373"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}