{
  "totalComplaints": 57,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "AIR BAGS",
    "TIRES",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Airbag System Failure",
      "impact": "The failure of the airbag system can lead to the non-deployment of airbags in the event of an accident, increasing the risk of injury or fatality.",
      "symptoms": [
        "The airbag light flashes or stays on",
        "the airbag sensor turns on and off",
        "the airbag light blinks fast while driving",
        "the airbag light illuminates constantly when the passenger seat is occupied",
        "the airbag light disappears and reappears intermittently."
      ],
      "odiNumbers": [
        "11229519",
        "11161732",
        "11100028",
        "11035982",
        "10873891",
        "10846330",
        "10839283",
        "10824929",
        "10643790",
        "10435699",
        "10331083",
        "10329246"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Tire Valve Stem Fracture",
      "impact": "The fracture of the tire valve stem can cause the tire to lose air pressure, leading to a loss of vehicle control, accidents, or strandings.",
      "symptoms": [
        "The valve stem breaks or detaches while inflating the tire",
        "resulting in a sudden loss of air pressure."
      ],
      "odiNumbers": [
        "11517836",
        "10483435"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Tire Sidewall Failure",
      "impact": "The failure of the tire sidewall can cause a loss of vehicle control, accidents, or strandings, especially at high speeds.",
      "symptoms": [
        "The tire sidewall develops a bubble or blister",
        "or ruptures suddenly",
        "often without warning",
        "while driving."
      ],
      "odiNumbers": [
        "10690889",
        "10453870",
        "10356790"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Premature Tire Wear",
      "impact": "Premature tire wear can lead to a loss of vehicle control, accidents, or strandings, especially if the tires are not replaced promptly.",
      "symptoms": [
        "The tires wear unevenly",
        "often with cupping or excessive wear on the rear tires",
        "due to improper camber settings or other design issues."
      ],
      "odiNumbers": [
        "10456038"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Engine Stalling",
      "impact": "The sudden stalling of the engine can cause loss of control, accidents, or leave the driver stranded, especially when it occurs while in motion.",
      "symptoms": [
        "The engine stalls without warning",
        "often when slowing down or making a right-hand turn",
        "and requires restarting; loss of power to the engine."
      ],
      "odiNumbers": [
        "11567927",
        "10393657"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Faulty Target EF Feedback System",
      "impact": "The faulty system can cause the engine to run lean, leading to poor performance, decreased fuel efficiency, and potentially causing engine damage.",
      "symptoms": [
        "Check engine light illuminates; DTC code P2096 is displayed; engine running lean."
      ],
      "odiNumbers": [
        "11527963"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Rear Windshield Glass Separation",
      "impact": "The separation of the rear windshield glass can cause it to shatter while driving, resulting in flying debris that can hit other vehicles or pedestrians.",
      "symptoms": [
        "The glue and seal around the rear windshield glass are separating; the glass is loose and rattles."
      ],
      "odiNumbers": [
        "11431731"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rust Corrosion on Body Panels",
      "impact": "The rust corrosion can weaken the structural integrity of the vehicle, leading to safety issues and potentially causing accidents.",
      "symptoms": [
        "Rust develops on the body panel surrounding the rear wheel on the passenger side; similar issues reported on other Mazda 5 models."
      ],
      "odiNumbers": [
        "11431101"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}