{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "FUEL SYSTEM",
    "FUEL/PROPULSION SYSTEM",
    "ENGINE AND ENGINE COOLING"
  ],
  "parsedComplaintsResultLength": 3,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel Tank Expansion and Deformation",
      "impact": "The expansion and deformation of the fuel tank can cause damage to the tank, surrounding components, and paint, leading to safety issues, such as loss of power, and potentially causing accidents. Additionally, the obstruction of the key opening can prevent the locking mechanism from working, leaving the engine running.",
      "symptoms": [
        "The fuel tank swells and bulges from the frame of the bike",
        "causing contact with the steering and suspension",
        "handlebars",
        "and upper fork bracket",
        "resulting in damage to the finish and cracks in the tank. The key opening is obstructed",
        "and the paint and decals become damaged."
      ],
      "odiNumbers": [
        "10420290",
        "10415866",
        "10412308",
        "10369619",
        "10356167"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Fuel Tank Deformation",
      "impact": "The deformation of the fuel tank can cause various issues, including interference with surrounding components, such as the horn button and key guard, and potentially lead to fuel leaks or other safety hazards.",
      "symptoms": [
        "The fuel tank is expanding or deforming",
        "the horn button is touching the steering wheel when locking the front wheel",
        "the key guard is breaking",
        "the fuel tank side trim panels are loose",
        "the fuel tank is replaced due to deformation",
        "but the replacement tank is also deforming."
      ],
      "odiNumbers": [
        "10794996",
        "10549252"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Engine Stalling/Loss of Power",
      "impact": "The sudden and unexpected stalling of the engine can cause the rear wheel to lock up, leading to loss of control, accidents, and potential injuries or fatalities, especially when riding at high speeds or in turns.",
      "symptoms": [
        "The engine cuts out or stalls while riding",
        "the engine stops completely",
        "the rear wheel locks up",
        "the motorcycle becomes unstable",
        "the rider loses control."
      ],
      "odiNumbers": [
        "10359597"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}