{
  "totalComplaints": 11,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "STRUCTURE",
    "EQUIPMENT",
    "LATCHES/LOCKS/LINKAGES"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Saddlebag Quick Release Pin Failure",
      "impact": "The failure of the quick release pins can cause the saddlebag to detach from the motorcycle while in motion, creating a distraction for the rider and a hazard for other vehicles on the road.",
      "symptoms": [
        "Saddlebag falls off the motorcycle while driving",
        "quick release pins come loose",
        "saddlebag becomes separated from the motorcycle."
      ],
      "odiNumbers": [
        "10463208",
        "10411779"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Delayed Recall Parts Availability",
      "impact": "The delayed availability of recall parts can leave motorcycle owners without a safe and functional vehicle, potentially leading to accidents or injuries.",
      "symptoms": [
        "Recall parts are not available",
        "dealership is unable to repair the vehicle",
        "customer service is unresponsive or unhelpful."
      ],
      "odiNumbers": [
        "10644375"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Lock and Ride Saddle Bag Pin Failure",
      "impact": "The failure of the pins that hold the saddle bag can cause the bag to fall off while driving, potentially obstructing the rider's view or causing a loss of control, which can lead to accidents.",
      "symptoms": [
        "The saddle bag falls off while driving",
        "the pins that hold the saddle bag are loose",
        "the saddle bag is not securely attached."
      ],
      "odiNumbers": [
        "10651243",
        "10402838"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inadequate Dealer Response to Lock and Ride Safety Recall",
      "impact": "The failure of dealers to respond to safety recalls can leave riders unaware of potential safety issues, potentially leading to accidents or injuries.",
      "symptoms": [
        "Dealers fail to notify owners of safety recalls",
        "dealers fail to provide timely repairs or replacements",
        "owners are left unaware of potential safety issues."
      ],
      "odiNumbers": [
        "10651243"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Improperly Designed Saddlebag Latch Bracket",
      "impact": "The improperly designed saddlebag latch bracket on the right side of the Victory Cross Country motorcycle can cause the latch to wear through and the saddlebag lid to fly open while in motion, potentially leading to loss of cargo, distraction, or accidents.",
      "symptoms": [
        "The latch on the right side saddlebag is wearing through the latch bracket",
        "the bracket has sheared through",
        "the saddlebag lid cannot be secured",
        "the latch is loose or has excessive play."
      ],
      "odiNumbers": [
        "10644692",
        "10644381"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}