{
  "totalComplaints": 20,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "VISIBILITY/WIPER",
    "UNKNOWN OR OTHER",
    "ELECTRICAL SYSTEM",
    "FUEL/PROPULSION SYSTEM",
    "ENGINE"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Passenger Windshield Wiper Arm Failure",
      "impact": "The sudden failure of the passenger windshield wiper arm can cause the wiper blade to break off and fly away, potentially hitting other vehicles or pedestrians, and compromising the driver's visibility in rainy or snowy conditions.",
      "symptoms": [
        "The passenger windshield wiper arm snaps off or breaks",
        "the wiper blade detaches and flies away",
        "the wiper arm breaks near the base",
        "the wiper arm fails to operate properly",
        "the windshield is left without proper cleaning",
        "and the driver is forced to operate the vehicle in poor visibility conditions."
      ],
      "odiNumbers": [
        "11549884",
        "11539960",
        "11494284",
        "11375789",
        "11204261",
        "11045764",
        "11041380"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "False Warning for Right Rear Brake and Parking Light",
      "impact": "The false warning for the right rear brake and parking light can cause unnecessary stress and distraction for the driver, potentially leading to accidents or near-misses.",
      "symptoms": [
        "Warning message appears on the dashboard indicating that the right rear brake is not working",
        "warning message appears on the dashboard indicating that the right rear parking light is not working",
        "physical inspection shows that the brake and parking lights are functioning properly."
      ],
      "odiNumbers": [
        "11354037"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Ignition Switch Failure",
      "impact": "The failure of the ignition switch can cause a sudden loss of power, affecting the vehicle's braking and steering systems, which can lead to accidents or loss of control.",
      "symptoms": [
        "Clicking sound accompanied by loss of power",
        "brakes do not function properly",
        "steering wheel becomes increasingly hard to maneuver",
        "ignition switch turns off unexpectedly",
        "vehicle suddenly stops working."
      ],
      "odiNumbers": [
        "11110916"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Faulty Door Handle Sensors",
      "impact": "The failure of the door handle sensors can cause inconvenience and financial burden to the vehicle owner, as it may lead to repeated repairs and replacements.",
      "symptoms": [
        "The door handle sensors fail",
        "requiring replacement",
        "and may cause issues with the vehicle's electrical system."
      ],
      "odiNumbers": [
        "11163117"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Adblue (NOx) System Failure",
      "impact": "The failure of the Adblue (NOx) system can cause the vehicle to become inoperable, leaving the driver stranded, and may lead to safety concerns, especially in emergency situations.",
      "symptoms": [
        "The vehicle displays a fault message",
        "stating that it will not turn on within a certain distance",
        "and may require replacement of the NOx sensor",
        "which can be costly."
      ],
      "odiNumbers": [
        "10731421"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Inadequate Fuel Pump Repair and Fuel Injector Failure",
      "impact": "The inadequate repair of the fuel pump and failure of the fuel injector can cause fuel leaks, leading to a fire hazard, and potentially putting the driver and passengers at risk of injury or death.",
      "symptoms": [
        "Fuel odor inside the vehicle",
        "fuel leaks under the hood",
        "fuel spray on components under the hood",
        "gasoline smell in the garage."
      ],
      "odiNumbers": [
        "11118338",
        "10992466"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Adblue (NOx) System Failure",
      "impact": "The failure of the Adblue (NOx) system can cause the vehicle to not start or run, leading to inconvenience and potential safety risks.",
      "symptoms": [
        "Warning alert stating the car will not start within a certain mileage",
        "NOx sensor failure",
        "vehicle will not run due to software lockout triggered by the sensor."
      ],
      "odiNumbers": [
        "10905910"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Engine Failure",
      "impact": "The failure of the engine can cause the vehicle to stall, leading to potential safety risks, especially when driving at high speeds.",
      "symptoms": [
        "Temperature gauge fluctuates from high to low and then back to normal",
        "vehicle decelerates and stalls."
      ],
      "odiNumbers": [
        "10631921"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}