{
  "totalComplaints": 11,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "AIR BAGS",
    "VISIBILITY",
    "STEERING"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Airbag Failure to Deploy",
      "impact": "The failure of the airbag to deploy in the event of a collision can lead to serious injury or death.",
      "symptoms": [
        "None",
        "as this issue is related to a failure to deploy in a crash scenario."
      ],
      "odiNumbers": [
        "11377818"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Takata Airbag Recall Issues",
      "impact": "The Takata airbag recall has led to a delay in repairs, causing inconvenience and safety concerns for vehicle owners. The recall notice advises owners to avoid having a passenger sit in the front seat, which can be impractical and stressful.",
      "symptoms": [
        "Difficulty in getting the recall repair done",
        "lack of available parts",
        "long wait times",
        "and inconvenience caused by the recall notice."
      ],
      "odiNumbers": [
        "10937472",
        "10898282",
        "10896532",
        "10887518",
        "10652409"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Seat Belt Failure",
      "impact": "The failure of the seat belt to release can trap the driver in the seat, leading to serious injury or death.",
      "symptoms": [
        "The driver seat belt fails to release upon depression of the driver seat belt button",
        "trapping the driver in the seat."
      ],
      "odiNumbers": [
        "11377818"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Sun Visor Failure",
      "impact": "A faulty sun visor can obstruct the driver's view, increasing the risk of accidents and compromising road safety.",
      "symptoms": [
        "The sun visor will not stay in place",
        "falls down",
        "or blocks visibility of the road ahead."
      ],
      "odiNumbers": [
        "10608461"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Spontaneous Windshield Failure",
      "impact": "Sudden and unexplained windshield breakage can cause accidents, injuries, or fatalities, especially if it occurs while driving at high speeds.",
      "symptoms": [
        "The windshield shatters or explodes without any apparent reason or external impact",
        "causing sudden loss of visibility and potentially leading to accidents."
      ],
      "odiNumbers": [
        "10598033"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Steering Wheel Hub Support Mounting Bracket Failure",
      "impact": "The failure of the steering wheel hub support mounting bracket can cause the steering wheel to become loose and wobbly, leading to a loss of steering control, which can result in accidents, injuries, or fatalities.",
      "symptoms": [
        "The steering wheel is wobbly and loose",
        "the bracket has cracked or broken",
        "the steering wheel may come off in the driver's hands while driving."
      ],
      "odiNumbers": [
        "11118775"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Improper Engineering/Design and Material Specifications of Steering Wheel Hub Support Mounting Bracket",
      "impact": "The defective design and material specifications of the steering wheel hub support mounting bracket can lead to premature failure, causing a loss of steering control, which can result in accidents, injuries, or fatalities.",
      "symptoms": [
        "The steering wheel hub support mounting bracket cracks or breaks over time",
        "the steering wheel becomes wobbly and loose."
      ],
      "odiNumbers": [
        "11118775"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}