{
  "totalComplaints": 12,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "STRUCTURE",
    "STEERING"
  ],
  "parsedComplaintsResultLength": 4,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Brake Failure with ABS",
      "impact": "The failure of the rear brakes can cause a loss of stopping power, leading to increased stopping distances and potentially causing accidents, which can result in injuries or fatalities.",
      "symptoms": [
        "The rear brakes fail to engage",
        "the rear brake pedal goes to the floor without stopping",
        "the brakes take in air",
        "the rear brakes fail intermittently",
        "the vehicle requires a longer stopping distance."
      ],
      "odiNumbers": [
        "11355654",
        "10822100",
        "10700828",
        "10598585",
        "10483508"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Front Fender Breakage and Separation",
      "impact": "The breakage and separation of the front fender can cause the rear half to become jammed between the tire and lower fairing assembly, leading to difficult steering and potentially causing accidents or loss of control.",
      "symptoms": [
        "The rear half of the front fender breaks and separates",
        "becoming wedged between the tire and fairing",
        "making steering difficult",
        "and potentially causing the bike to become unresponsive."
      ],
      "odiNumbers": [
        "10606364",
        "10592181",
        "10534743",
        "10534753",
        "10430546"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Front Fender Design Flaw",
      "impact": "The failure of the front fender can cause jamming into the fairing, making turning the motorcycle impossible at low speeds and noticeably different at high speeds, which can lead to accidents or loss of control.",
      "symptoms": [
        "The lower black plastic front fender comes loose from the fork attachments",
        "jams itself into the fairing",
        "and makes turning the motorcycle difficult or impossible. The hole provided in the plastic part wears through",
        "allowing the wind to catch the lower fender and lodge it into the fairing."
      ],
      "odiNumbers": [
        "10535066"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Mounting Hole Wear and Breakage",
      "impact": "The wear and breakage of the mounting holes and points can cause the front fender to come loose and jam into the fairing, making turning the motorcycle impossible at low speeds and noticeably different at high speeds, which can lead to accidents or loss of control.",
      "symptoms": [
        "The mounting holes wear through",
        "allowing the wind to catch the lower fender and lodge it into the fairing. The fender breaks off at the mounting points",
        "causing the fender to come loose and jam into the fairing."
      ],
      "odiNumbers": [
        "10535066"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}