{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SEAT BELTS",
    "POWER TRAIN",
    "ENGINE",
    "ENGINE AND ENGINE COOLING",
    "ELECTRICAL SYSTEM"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Seat Belt Locking Mechanism Failure",
      "impact": "The failure of the seat belt locking mechanism can cause the seat belt to become stuck, potentially leading to difficulties in removing the seat belt or, in extreme cases, causing a fire.",
      "symptoms": [
        "The seat belt becomes stuck in the buckle",
        "the seat belt is unable to be removed from the buckle",
        "the seat belt locking mechanism fails to release",
        "smoke or fire originates from the seat belt area."
      ],
      "odiNumbers": [
        "11465755",
        "11128517"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unintended Downshifting and Loss of Power",
      "impact": "The unintended downshifting and loss of power can cause the vehicle to suddenly lose speed and control, increasing the risk of accidents, injuries, and fatalities, especially when towing heavy loads.",
      "symptoms": [
        "The vehicle independently downshifts into first gear",
        "the wheels seize",
        "the engine shuts down",
        "the computer screen displays flashing warnings",
        "and the alarm chimes non-stop."
      ],
      "odiNumbers": [
        "10875395",
        "10660701"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Faulty Exhaust Gas Sensors",
      "impact": "The failure of the exhaust gas sensors can cause the vehicle to shut down or lose power, leading to a loss of control and increasing the risk of accidents. Additionally, the repeated failures can lead to costly repairs and inconvenience to the driver.",
      "symptoms": [
        "The vehicle warning system indicates to safely stop the truck immediately",
        "the truck will not restart",
        "the truck continues to run but with reduced power",
        "the exhaust gas sensor warning light is illuminated."
      ],
      "odiNumbers": [
        "10693668"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Inadequate Exhaust Gas Sensor Design",
      "impact": "The faulty design of the exhaust gas sensors can lead to repeated failures, causing the vehicle to shut down or lose power, and increasing the risk of accidents. The repeated failures can also lead to costly repairs and inconvenience to the driver.",
      "symptoms": [
        "The vehicle warning system indicates to safely stop the truck immediately",
        "the truck will not restart",
        "the truck continues to run but with reduced power",
        "the exhaust gas sensor warning light is illuminated."
      ],
      "odiNumbers": [
        "10693668"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Radiator Leaks",
      "impact": "A radiator leak can cause the engine to overheat, leading to damage to the engine, coolant system, and other components, which can result in costly repairs, engine failure, and potentially cause accidents.",
      "symptoms": [
        "Coolant leaks from the radiator",
        "coolant level drops",
        "engine temperature gauge rises",
        "engine overheats",
        "steam or coolant vapor comes from the hood",
        "sweet or burning smell from the engine."
      ],
      "odiNumbers": [
        "10660112"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Exhaust Heat Sensor Failure",
      "impact": "The failure of the exhaust heat sensor can cause the vehicle to stall or leave the driver stranded, potentially leading to accidents or safety risks, especially when it occurs on busy highways.",
      "symptoms": [
        "The vehicle stalls or dies while driving",
        "the check engine light comes on",
        "the vehicle is unable to maintain speed",
        "the vehicle is left stranded on the road."
      ],
      "odiNumbers": [
        "10630825"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Inadequate Warranty Coverage",
      "impact": "The limited warranty coverage can leave vehicle owners with significant out-of-pocket expenses for repairs, even if the issue is related to a faulty component.",
      "symptoms": [
        "Vehicle owners are charged a deductible for repairs",
        "vehicle owners are without their vehicle for an extended period",
        "vehicle owners experience financial burden due to repair costs."
      ],
      "odiNumbers": [
        "10630825"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}