{
  "totalComplaints": 22,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "STEERING",
    "AIR BAGS"
  ],
  "parsedComplaintsResultLength": 9,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Electrical System Failure",
      "impact": "The failure of the electrical system can cause the vehicle to lose power, leading to accidents or injuries, and can also affect the vehicle's safety features.",
      "symptoms": [
        "The vehicle loses electrical power",
        "lights",
        "and door locks",
        "and the engine upshifts into second or third gear on its own",
        "refusing to accelerate. The electronics may go crazy",
        "and the vehicle may stall or restart independently."
      ],
      "odiNumbers": [
        "11315838",
        "11024990",
        "10671762"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Brake System Failure",
      "impact": "The failure of the brake system can cause the vehicle to accelerate instead of stopping, leading to accidents or injuries.",
      "symptoms": [
        "The brake pedal sinks into the floorboard",
        "and the vehicle fails to stop. The brake sensors may need to be replaced",
        "and the central computer may need to be recalibrated."
      ],
      "odiNumbers": [
        "10690319",
        "10503189"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Ignition Switch Failure",
      "impact": "The failure of the ignition switch can cause the key to be removed from the ignition while the vehicle is in motion, leading to accidents or injuries.",
      "symptoms": [
        "The key can be removed from the ignition switch while the vehicle is in motion."
      ],
      "odiNumbers": [
        "10766400"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Locking System Failure",
      "impact": "The failure of the locking system can cause the vehicle to randomly lock or unlock while parked or moving, creating a serious safety concern.",
      "symptoms": [
        "The vehicle randomly locks or unlocks while parked or moving",
        "and the dealer may be unable to diagnose or correct the issue."
      ],
      "odiNumbers": [
        "10497630"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Engine and Camshaft Actuator Failure",
      "impact": "The failure of the engine and camshaft actuator can cause the vehicle to turn off while running, leading to accidents or injuries.",
      "symptoms": [
        "The engine cuts off or goes into low power mode",
        "and the oil pressure sensor check engine light comes on. The camshaft actuator may be starved of oil due to low oil pressure",
        "causing the vehicle to turn off while running."
      ],
      "odiNumbers": [
        "11269759"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Electronic Power Steering Failure",
      "impact": "The failure of the electronic power steering system can cause loss of power steering functionality, making it difficult to control the vehicle, which can lead to accidents or loss of control.",
      "symptoms": [
        "Service power steering warning light illuminates",
        "loss of power steering functionality",
        "vehicle is difficult to steer",
        "sudden loss of power steering while driving."
      ],
      "odiNumbers": [
        "11327738",
        "11327274"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electrical Power System Failure",
      "impact": "The failure of the electrical power system can cause sudden and repeated loss of electrical power and related power systems, leading to loss of control and increased risk of accidents.",
      "symptoms": [
        "Door locks repeatedly clicking on and off",
        "navigation system failure",
        "air conditioning failure",
        "stabilitrack failure",
        "lack of power steering",
        "sudden loss of electrical power while driving."
      ],
      "odiNumbers": [
        "10609340"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Airbag Warning Light Illumination and Recall Repair Delay",
      "impact": "The illumination of the airbag warning light can indicate a potential safety risk, and the delay in recall repair can leave the vehicle in an unsafe condition, potentially leading to accidents or injuries.",
      "symptoms": [
        "The airbag warning light is illuminated on the dashboard",
        "the service airbag light appears upon starting the vehicle",
        "the passenger side frontal airbag inflator is faulty."
      ],
      "odiNumbers": [
        "11424063",
        "11404061"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Unavailability of Recall Repair Parts",
      "impact": "The unavailability of recall repair parts can cause a delay in fixing the safety issue, leaving the vehicle in an unsafe condition, potentially leading to accidents or injuries.",
      "symptoms": [
        "The dealer states that parts are not yet available for the recall repair",
        "the manufacturer is unable to provide a timeline for part availability."
      ],
      "odiNumbers": [
        "11424063",
        "11404061"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}