{
  "totalComplaints": 11,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "UNKNOWN OR OTHER",
    "AIR BAGS"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Excessive Oil Consumption",
      "impact": "Excessive oil consumption can lead to premature engine wear, increased emissions, and potentially cause engine failure, which can result in costly repairs or even accidents.",
      "symptoms": [
        "The vehicle consumes a quarter of oil additional every 3000 miles",
        "frequent oil top-offs",
        "oil leaks",
        "or unusual engine noises."
      ],
      "odiNumbers": [
        "11524217"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Airbag System Failure (Driver Side Front Door Harness Issue)",
      "impact": "The failure of the airbag system can lead to the deployment of airbags in non-crash scenarios, causing injuries or accidents, or failure to deploy in the event of a crash, resulting in increased risk of injury or fatality.",
      "symptoms": [
        "Airbag light intermittently flashing or staying on all the time",
        "open circuit in the driver side front door harness",
        "airbag sensor malfunction."
      ],
      "odiNumbers": [
        "11418123",
        "11415634"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Clutch Failure (Concentric Slave Cylinder and Clutch Master Cylinder Issues)",
      "impact": "The failure of the clutch system can cause the clutch pedal to stick to the floor, making it difficult or impossible to shift gears, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "Clutch pedal feels soft or spongy",
        "clutch pedal sticks to the floor",
        "clutch pedal does not return to its normal position",
        "clutch pedal has a delayed return to its normal position",
        "clutch pedal has a sudden loss of pressure",
        "vehicle is unable to shift into gear",
        "unusual smells or smoke from the clutch area."
      ],
      "odiNumbers": [
        "11164937"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Unattended Vehicle Fire",
      "impact": "The vehicle catching fire while unattended can cause significant damage, pose a risk to surrounding people and property, and potentially lead to injuries or fatalities.",
      "symptoms": [
        "The vehicle suddenly catches fire while parked",
        "with no warning signs or symptoms beforehand."
      ],
      "odiNumbers": [
        "11478134"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Spontaneous Windshield Cracking (TAKATA RECALL)",
      "impact": "The sudden and unexpected cracking of the windshield can cause startle, distraction, and potentially lead to accidents or injuries.",
      "symptoms": [
        "The windshield cracks suddenly",
        "without any apparent cause",
        "making a loud noise",
        "and resulting in a distinctive crack pattern (e.g.",
        "\"J\" shape or a line across the middle)."
      ],
      "odiNumbers": [
        "11150657"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Failure of Airbags to Deploy",
      "impact": "The failure of airbags to deploy in a crash can increase the risk of injury or fatality to occupants, especially in severe accidents.",
      "symptoms": [
        "Airbags do not deploy in a crash",
        "despite the severity of the impact",
        "occupants may experience injuries or fatalities that could have been prevented or mitigated by airbag deployment."
      ],
      "odiNumbers": [
        "11020134",
        "10627300"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Brake System Failure",
      "impact": "The failure of the brake system can increase the stopping distance, leading to accidents or near-misses, and potentially causing injuries or fatalities.",
      "symptoms": [
        "The brakes take longer than usual to kick-in",
        "the brakes are soft or spongy",
        "the vehicle takes longer to stop than expected",
        "the brakes fail to engage properly."
      ],
      "odiNumbers": [
        "10627300"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}