{
  "totalComplaints": 44,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "AIR BAGS",
    "STRUCTURE",
    "ENGINE"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Airbag Failure to Deploy",
      "impact": "The failure of the airbag to deploy in the event of a crash can lead to serious injury or death.",
      "symptoms": [
        "Airbag did not deploy in a crash",
        "driver suffered facial and arm injuries from striking the steering wheel."
      ],
      "odiNumbers": [
        "11244627",
        "11032001"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Takata Airbag Recall Issues",
      "impact": "The failure to repair or replace the recalled Takata airbags can lead to serious injury or death in the event of a crash.",
      "symptoms": [
        "Received recall notification but parts are unavailable",
        "dealer unable to provide a repair date",
        "lack of communication from manufacturer and dealer."
      ],
      "odiNumbers": [
        "10929395",
        "10914551",
        "10910402",
        "10908350",
        "10906842",
        "10903866",
        "10899529",
        "10898739",
        "10899023",
        "10893373",
        "10885132",
        "10884885",
        "10883317",
        "10882940",
        "10882540",
        "10882755",
        "10881774",
        "10875882",
        "10875262",
        "10875374",
        "10873900",
        "10871497",
        "10871022"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Inadequate Rental Vehicle Provided",
      "impact": "The provision of an inadequate rental vehicle can cause inconvenience and financial loss to the vehicle owner.",
      "symptoms": [
        "Rental vehicle provided is of a different model",
        "does not meet the needs of the owner",
        "and may not be safe for the owner's family."
      ],
      "odiNumbers": [
        "10882540",
        "10875374",
        "10871497"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Third Brake Light Assembly Failure",
      "impact": "The failure of the third brake light assembly can cause a loss of visibility to other drivers, increasing the risk of accidents.",
      "symptoms": [
        "The third brake light assembly blows off",
        "the clips that hold the assembly in place are bad",
        "the assembly is loose and not held in place."
      ],
      "odiNumbers": [
        "11330286"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Parts Distribution Disconnect",
      "impact": "The delay in receiving recall parts can leave vehicles unrepaired, potentially leading to safety risks and accidents.",
      "symptoms": [
        "Dealers confirm that parts are not yet available",
        "manufacturers exceed a reasonable amount of time for the repair."
      ],
      "odiNumbers": [
        "11483218"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Antenna Cover Failure",
      "impact": "The failure of the antenna cover can cause damage to the vehicle's exterior and potentially lead to electrical issues.",
      "symptoms": [
        "The antenna cover is not attached to the vehicle",
        "the lens and antenna cover melt due to heating failure."
      ],
      "odiNumbers": [
        "10763734"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unintended Power Loss when Braking and Accelerating",
      "impact": "The sudden loss of power when braking and accelerating can lead to accidents, especially in heavy traffic or when turning, as the vehicle may become vulnerable to being hit by other vehicles.",
      "symptoms": [
        "The engine power stops or is significantly reduced when the brake pedal is pressed while the accelerator pedal is still being pressed",
        "or when the vehicle is slowing down or making a turn; pressing the accelerator pedal does not restore power",
        "but releasing the brake pedal causes rapid acceleration."
      ],
      "odiNumbers": [
        "10717531",
        "10713298"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}