{
  "totalComplaints": 21,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "ENGINE",
    "SERVICE BRAKES",
    "FUEL/PROPULSION SYSTEM",
    "FUEL SYSTEM"
  ],
  "parsedComplaintsResultLength": 9,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Excessive Heat Generation and Fuel Vapor Issues",
      "impact": "The excessive heat generation and fuel vapor issues can lead to a dangerous situation, potentially causing fires, explosions, and injuries to life and property.",
      "symptoms": [
        "The vehicle's engine and surrounding areas become excessively hot",
        "fuel vapor fumes are present",
        "the gas tank and gasoline fuel become significantly hot",
        "and the body panels become very hot."
      ],
      "odiNumbers": [
        "10693107",
        "10670014",
        "10621153"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Check Engine Light Distraction",
      "impact": "The check engine light distraction can cause a dangerous situation, forcing the rider's eyes off the road and potentially leading to serious injury or death.",
      "symptoms": [
        "The display screen changes to orange",
        "displaying a check engine warning",
        "which distracts the rider and forces them to remove their attention from the road."
      ],
      "odiNumbers": [
        "10622335"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Rough Idling and Surging",
      "impact": "The rough idling and surging can become a safety hazard, particularly at stop lights and in traffic, potentially leading to accidents or loss of control.",
      "symptoms": [
        "The vehicle idles rough",
        "RPMs race between 1000 and 2000",
        "the bike surges forward",
        "and a beeping sound occurs as if the bike is going to shut off."
      ],
      "odiNumbers": [
        "10550361"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Master Brake Cylinder Failure due to Heat Damage",
      "impact": "The failure of the master brake cylinder can cause a loss of brake pressure, leading to a potential loss of control and increased risk of accidents. Additionally, the brake fluid leakage can ignite due to the proximity of the exhaust pipe, resulting in a fire hazard.",
      "symptoms": [
        "White smoke coming out of the vents",
        "an unusual odor",
        "\"Brake Failure\" light on the LCD panel",
        "brake fluid pouring out of the master cylinder",
        "melted plastic cap on top of the master cylinder."
      ],
      "odiNumbers": [
        "10522993",
        "10522520",
        "10522528"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Vehicle Goes into \"Limp Mode\" due to VSS Fault",
      "impact": "The vehicle going into \"Limp Mode\" can cause a loss of power and control, increasing the risk of accidents. Additionally, the failure of the cruise control system can lead to driver distraction and fatigue.",
      "symptoms": [
        "Vehicle goes into \"Limp Mode\"",
        "cruise control will not set",
        "brake light remains on after engine is off."
      ],
      "odiNumbers": [
        "10854714"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel System Overheating and Vapor Leaks",
      "impact": "The overheating of the fuel system can cause fuel vapors to escape, leading to a strong fuel smell, and potentially creating a fire hazard. This issue can also cause the fuel in the tank to boil, which can lead to fuel leaks and further increase the risk of a fire.",
      "symptoms": [
        "Strong fuel smell",
        "fuel vapors escaping from the charcoal canister",
        "fuel boiling in the tank",
        "excessive heat emanating from the body panels",
        "hot air being vented out of the space between the seat and upper body panels",
        "and the fuel cap becoming hot to the touch."
      ],
      "odiNumbers": [
        "10622128",
        "10621079",
        "10583184"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Fuel System Issues",
      "impact": "The fuel system issues can cause fuel leaks, odors, and stalling, which can lead to accidents, fires, or personal injuries. Additionally, the excessive heat generated by the fuel system can cause discomfort, burns, and property damage.",
      "symptoms": [
        "Fuel odor",
        "intermittent stalling",
        "fuel spewing out when removing the gas cap",
        "hot gas cap",
        "hot body panels",
        "discomfort",
        "burns",
        "white smoke coming from the vehicle."
      ],
      "odiNumbers": [
        "10585386",
        "10541836",
        "10541939"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Exhaust System Issues",
      "impact": "The exhaust system issues can cause excessive heat, discomfort, and potential fires, which can lead to personal injuries or property damage.",
      "symptoms": [
        "Excessive heat under the seat",
        "hot body panels",
        "puff of white smoke coming from the vehicle."
      ],
      "odiNumbers": [
        "10541939"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Poor Dealer Response",
      "impact": "The poor response from the dealer can lead to a lack of trust and confidence in the vehicle's safety and reliability, causing emotional distress and potential financial losses.",
      "symptoms": [
        "Dealer's dismissive attitude",
        "lack of concern for safety issues",
        "inadequate repair attempts."
      ],
      "odiNumbers": [
        "10585386",
        "10541939"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}