{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "STEERING",
    "STRUCTURE",
    "ENGINE",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Front Fender Assembly Failure",
      "impact": "The failure of the two-piece plastic front fender assembly can cause the rear portion of the fender to dislodge and become wedged between the front forks and the main body of the motorcycle, affecting steering and potentially leading to accidents or fatalities.",
      "symptoms": [
        "Cracks or fractures in the rear portion of the plastic fender",
        "particularly at the point where it contacts the metal forks",
        "separation of the rear portion of the fender assembly",
        "loose or dislodged fender",
        "difficulty steering or loss of control."
      ],
      "odiNumbers": [
        "10724295",
        "10548727",
        "10535411"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Front Lower Fender Failure",
      "impact": "The failure of the front lower fender can cause the fender to crack or break off, potentially leading to a lockup of the front wheel or steering, which can result in a loss of control and increase the risk of accidents.",
      "symptoms": [
        "Cracking or breaking of the plastic portion of the front fender",
        "particularly where it attaches to the front forks",
        "separation of the fender from the mount point",
        "potential lockup of the front wheel or steering."
      ],
      "odiNumbers": [
        "10650819",
        "10644548",
        "10558244"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Engine Stalling Issue",
      "impact": "The engine stalling issue can cause the motorcycle to lose power and stall, potentially leading to accidents, especially in heavy traffic conditions. This can put the rider and other road users at risk.",
      "symptoms": [
        "The engine stalls while slowing down",
        "rev-matching",
        "or downshifting",
        "requiring evasive action to avoid collisions; the engine takes multiple attempts to restart; the motorcycle may stall repeatedly."
      ],
      "odiNumbers": [
        "10663990",
        "10536157"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Faulty Electronic Fuel Injection (EFI) System",
      "impact": "The faulty EFI system can cause the engine to stall, leading to a loss of power and control, which can result in accidents.",
      "symptoms": [
        "The engine stalls due to the EFI system malfunctioning",
        "shutting off the engine to \"avoid damage\" even when the RPMs are within the safe range; the motorcycle requires an aftermarket EFI unit and adjustable idle control valve to correct the problem."
      ],
      "odiNumbers": [
        "10663990"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Brake Master Cylinder Failure",
      "impact": "The failure of the rear brake master cylinder can cause a loss of braking ability, leading to accidents or near-miss situations, potentially resulting in injuries or fatalities.",
      "symptoms": [
        "Loss of braking ability while riding",
        "sudden failure of the rear brake system",
        "repeated failure of the rear brake master cylinder."
      ],
      "odiNumbers": [
        "11231287"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}