{
  "totalComplaints": 14,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ENGINE",
    "POWER TRAIN",
    "ENGINE AND ENGINE COOLING"
  ],
  "parsedComplaintsResultLength": 3,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Engine Stalling when Pulling in the Clutch",
      "impact": "The engine stalling when pulling in the clutch can cause the motorcycle to suddenly come to a stop, potentially leading to accidents or injuries, especially when riding in heavy traffic or at high speeds.",
      "symptoms": [
        "The engine RPMs drop below 1000 RPM",
        "the engine stalls or dies when pulling in the clutch",
        "the motorcycle comes to a sudden stop",
        "the engine stalls repeatedly when pulling in the clutch",
        "the engine stalls more frequently when the motorcycle has been sitting in the sun for an extended period."
      ],
      "odiNumbers": [
        "10533126",
        "10524022",
        "10522328",
        "10512579"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Engine Stalling when Clutch is Disengaged",
      "impact": "The engine stalling when the clutch is disengaged can cause loss of control, accidents, and injuries, especially for new or inexperienced riders.",
      "symptoms": [
        "The engine stalls when the clutch is disengaged",
        "often when coming to a stop or slowing down; the bike may come to an instant stop",
        "causing loss of control or accidents; the idle speed may drop significantly before recovering."
      ],
      "odiNumbers": [
        "10522426",
        "10521588",
        "10505548",
        "10505117"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Sudden Engine Stalling",
      "impact": "The sudden stalling of the engine can cause loss of control, accidents, or leave the rider stranded, especially when it occurs at critical times such as when approaching a stop sign or navigating a curve.",
      "symptoms": [
        "The engine stalls or shuts down without warning",
        "the engine idles erratically",
        "the engine RPMs fluctuate rapidly",
        "the vehicle loses power or momentum",
        "the rider experiences a loss of control."
      ],
      "odiNumbers": [
        "10521599",
        "10498192"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}