{
  "totalComplaints": 17,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "UNKNOWN OR OTHER",
    "ENGINE",
    "POWER TRAIN",
    "VEHICLE SPEED CONTROL"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Front Brake Failure",
      "impact": "The sudden and complete loss of front brake function can cause accidents, injuries, or fatalities, especially when riding at high speeds or in emergency braking situations.",
      "symptoms": [
        "The front brakes completely lock up",
        "there is no brake response when the front brake is applied",
        "the motorcycle becomes immovable or difficult to control."
      ],
      "odiNumbers": [
        "11318094",
        "11152324"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Clutch/Brake Gasket Failure",
      "impact": "The failure of the clutch/brake gasket can cause fluid to leak, leading to corrosion and damage to surrounding components, which can affect the overall performance and safety of the vehicle.",
      "symptoms": [
        "Fluid leaks from the clutch/brake system",
        "corrosion or damage to the reservoir covers",
        "clutch or brake pedal feels soft or spongy."
      ],
      "odiNumbers": [
        "10836618"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Saddlebag Pin Failure",
      "impact": "The failure of the pins holding the saddlebag can cause the saddlebag to fall off while riding, potentially leading to accidents or injuries.",
      "symptoms": [
        "The saddlebag falls off while riding",
        "the pins holding the saddlebag break or fail."
      ],
      "odiNumbers": [
        "11101456"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Clutch Master Cylinder Failure (after Recall Upgrade)",
      "impact": "The failure of the clutch master cylinder can cause the clutch pedal to stick to the floor, making it difficult or impossible to shift gears, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "Clutch fluid leaks from the clutch master cylinder",
        "the clutch pedal feels soft or spongy",
        "the clutch pedal sticks to the floor",
        "the clutch pedal does not return to its normal position."
      ],
      "odiNumbers": [
        "10777025"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Shifter Shaft and Shifter Arm Failure",
      "impact": "The sudden failure of the shifter shaft and shifter arm can cause the rider to lose control of the motorcycle, leading to accidents or leaving them stranded, which can be dangerous and irresponsible.",
      "symptoms": [
        "The shifter shaft and shifter arm strip off",
        "making it impossible to shift gears",
        "leaving the rider stranded."
      ],
      "odiNumbers": [
        "11043718"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Spark Plug Wire Wear",
      "impact": "The wear on the spark plug wire can cause it to arch to the gas tank, leading to a potential fire hazard, which can be dangerous and cause damage to the motorcycle.",
      "symptoms": [
        "The spark plug wire is worn due to rubbing against another component",
        "which can lead to a short circuit or fire."
      ],
      "odiNumbers": [
        "10967851"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Stripped Shifter Shaft Splines",
      "impact": "The stripped shifter shaft splines can cause the transmission to malfunction, leading to loss of control and potential accidents.",
      "symptoms": [
        "The shifter moves freely and does not engage the transmission",
        "unable to downshift or upshift",
        "stuck in a specific gear."
      ],
      "odiNumbers": [
        "10945406"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Drive Belt and Floorboard Issues",
      "impact": "The loose drive belt and unsecured floorboard can cause vibration while decelerating, leading to loss of control and potential accidents.",
      "symptoms": [
        "Vibration occurs while decelerating",
        "vibration stops when the clutch is disengaged",
        "vibration occurs between 2000 and 1500 engine RPM during deceleration."
      ],
      "odiNumbers": [
        "10564809"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Cruise Control Failure to Disengage",
      "impact": "The failure of the cruise control to disengage when applying the front brake can cause the vehicle to accelerate unexpectedly, leading to a loss of control and increasing the risk of accidents.",
      "symptoms": [
        "The cruise control does not disengage when applying the front brake",
        "the vehicle accelerates unexpectedly",
        "the switch housing on the handlebars where the front brake lever is attached is faulty."
      ],
      "odiNumbers": [
        "10816751"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inaccurate Speedometer Readings",
      "impact": "Inaccurate speedometer readings can lead to speeding violations, accidents, and misinformed decisions while driving, posing a risk to the rider and others on the road.",
      "symptoms": [
        "The speedometer displays a reading that is higher or lower than the actual speed being traveled",
        "the GPS speed and speedometer readings differ",
        "the instrument panel flashes in red indicating a speeding violation."
      ],
      "odiNumbers": [
        "10574454"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}