{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SUSPENSION",
    "TIRES",
    "EXTERIOR LIGHTING",
    "POWER TRAIN",
    "AIR BAGS"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Leaf Spring Failure",
      "impact": "The failure of the rear leaf spring can cause loss of vehicle control, reduced stability, and increased risk of accidents, particularly when driving at high speeds or carrying heavy loads.",
      "symptoms": [
        "Sudden or gradual breakage of the rear leaf spring",
        "resulting in reduced vehicle height",
        "uneven tire wear",
        "and potentially leading to loss of vehicle control."
      ],
      "odiNumbers": [
        "11203821"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Front Suspension Issues",
      "impact": "The failure of the front suspension can cause uneven tire wear, reduced vehicle stability, and increased risk of accidents, particularly when driving at high speeds or cornering.",
      "symptoms": [
        "Squeaky noises coming from the front wheel",
        "uneven tire wear",
        "reduced vehicle stability",
        "and potentially leading to loss of vehicle control."
      ],
      "odiNumbers": [
        "11128438"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Tire Pressure Monitoring System (TPMS) Sensor Failure",
      "impact": "The failure of the TPMS sensors can cause inaccurate tire pressure readings, leading to reduced vehicle safety, increased risk of tire blowouts, and potentially resulting in accidents.",
      "symptoms": [
        "Inaccurate tire pressure readings",
        "faulty or inconsistent TPMS warnings",
        "and potentially leading to tire damage or blowouts."
      ],
      "odiNumbers": [
        "11128438"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Tire Sidewall Bulge and Exposed Wires",
      "impact": "The tire sidewall bulge and exposed wires can lead to a sudden tire failure, causing loss of vehicle control, accidents, and potentially resulting in injuries or fatalities.",
      "symptoms": [
        "Visible bulge on the tire sidewall",
        "exposed wires on the tire",
        "potential tire blowout or loss of air pressure."
      ],
      "odiNumbers": [
        "11452153"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Passenger Airbag Sensor Malfunction",
      "impact": "The intermittent sticking of the passenger airbag sensor can cause the airbag system to malfunction, potentially leading to incorrect deployment or non-deployment in the event of a crash, which can increase the risk of injury or fatality.",
      "symptoms": [
        "The passenger airbag sensor is stuck",
        "the airbag warning light is illuminated",
        "the passenger airbag is incorrectly deployed or not deployed",
        "the sensor is intermittently faulty."
      ],
      "odiNumbers": [
        "11128848"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Headlamp Auto Function Failure",
      "impact": "The failure of the headlamp auto function can cause the headlamps to remain on even when the vehicle is turned off, draining the battery and potentially leading to a dead battery, which can leave the driver stranded.",
      "symptoms": [
        "The headlamps do not turn off when the vehicle is turned off",
        "the headlamps remain on when the switch is set to 'auto'",
        "the battery is drained",
        "the vehicle will not start due to a dead battery."
      ],
      "odiNumbers": [
        "11128848"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Transmission Power Loss and Bucking",
      "impact": "The sudden loss of power and bucking of the transmission can cause the vehicle to stall or lose control, increasing the risk of accidents, especially at high speeds.",
      "symptoms": [
        "The vehicle randomly bucks and loses drive power",
        "mostly at slow speeds",
        "but also on the highway; the transmission completely fails",
        "causing a major safety concern."
      ],
      "odiNumbers": [
        "11053826"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Air Bag Warning Sensor Failure",
      "impact": "The failure of the air bag warning sensor can lead to the air bag warning light remaining illuminated, which can cause confusion and distraction for the driver, potentially increasing the risk of accidents.",
      "symptoms": [
        "The air bag warning light remains illuminated on the dashboard",
        "the air bag system may not function properly in the event of a crash",
        "the sensor may need to be replaced."
      ],
      "odiNumbers": [
        "11004882"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}