{
  "totalComplaints": 16,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "STRUCTURE",
    "ENGINE",
    "POWER TRAIN",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 5,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Exhaust System Overheating",
      "impact": "The excessive heat generated by the exhaust system can cause the plastic fender to melt, deform, or catch fire, leading to a potential fire hazard and risk of vehicle damage.",
      "symptoms": [
        "The exhaust pipes",
        "muffler",
        "or heat shield become extremely hot",
        "glowing red or orange",
        "and can cause the surrounding plastic components to melt",
        "deform",
        "or catch fire. The heat can also cause the stick-on heat shield to lose its adhesiveness and fall off."
      ],
      "odiNumbers": [
        "10873843",
        "10763205",
        "10758474",
        "10724614",
        "10723324",
        "10723085"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Exhaust System Design Flaw",
      "impact": "The poorly designed exhaust system can cause the exhaust components to overheat, leading to fires, burns, and damage to the vehicle and surrounding environment. This can result in serious injuries, fatalities, and property damage.",
      "symptoms": [
        "The exhaust system glows red hot",
        "the muffler reaches extremely high temperatures",
        "the plastic fenders and surrounding areas become untouchable",
        "the rear tire becomes extremely hot",
        "and grass or other flammable materials near the exhaust can catch fire."
      ],
      "odiNumbers": [
        "10818840",
        "10732030",
        "10726286",
        "10716996"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Electrical System Failure due to Water Ingress",
      "impact": "The electrical system failure can cause the battery to drain, leading to a loss of power and potentially leaving the driver stranded. Water ingress can also cause electrical shorts, which can lead to fires or other safety hazards.",
      "symptoms": [
        "The electrical system shorts out when the vehicle gets wet",
        "the battery drains",
        "the drive belt slips due to water ingress."
      ],
      "odiNumbers": [
        "10892845"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Muffler Overheating",
      "impact": "The muffler overheating can cause a high risk of fire, especially when in contact with flammable materials such as brush. The excessive heat can also damage plastic body parts and potentially cause injuries.",
      "symptoms": [
        "The muffler becomes red hot with normal use",
        "the plastic in the area of the muffler and heat shield becomes too hot to touch",
        "the plastic body parts may melt."
      ],
      "odiNumbers": [
        "10730620"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Excessive Exhaust System Heat",
      "impact": "The excessive heat generated by the exhaust system can cause discomfort to the rider, melt plastic components, and pose a fire hazard to the vehicle and surrounding environment, including national forests.",
      "symptoms": [
        "The muffler glows orange",
        "plastic fenders melt",
        "excessive heat emanating from the exhaust system",
        "discomfort to the rider."
      ],
      "odiNumbers": [
        "10749958",
        "10725613"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}