{
  "totalComplaints": 10,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "FUEL/PROPULSION SYSTEM",
    "SEATS",
    "UNKNOWN OR OTHER",
    "SERVICE BRAKES",
    "AIR BAGS"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel Line Failure due to Delamination of Coating",
      "impact": "The delamination of the coating from the base metal material in the fuel line can cause fuel to leak directly onto the engine, leading to a substantial fire hazard.",
      "symptoms": [
        "Fuel leaking onto the engine",
        "fuel smell",
        "engine compartment fire."
      ],
      "odiNumbers": [
        "11517806"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "High-Pressure Fuel Pump Failure",
      "impact": "The failure of the high-pressure fuel pump can cause engine stalling, loss of power, and difficulty starting the engine, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "Engine stalling",
        "loss of power",
        "difficulty starting the engine."
      ],
      "odiNumbers": [
        "11131009"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Fuel System Recall Parts Unavailability",
      "impact": "The unavailability of parts for fuel system recalls can delay necessary repairs, leaving vehicles on the road with potential safety hazards, such as fuel leaks or engine fires.",
      "symptoms": [
        "None",
        "as this issue is related to the delay in receiving recall parts."
      ],
      "odiNumbers": [
        "11092860",
        "11131009"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Front Passenger Seat Squeaking",
      "impact": "The squeaking noise from the front passenger seat can be distracting and annoying, potentially causing discomfort and disturbance to the occupants.",
      "symptoms": [
        "Squeaking noise when electronically tilting the front passenger seat back using the button on the right side."
      ],
      "odiNumbers": [
        "11364792"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Ventilated Seat Overheating",
      "impact": "The overheating of the ventilated seats can cause discomfort and potentially lead to burns or injuries, especially if the driver or passenger is not aware of the excessive heat.",
      "symptoms": [
        "The upper part of the seat heats up excessively",
        "sometimes randomly",
        "when using the ventilated seat feature; the heat becomes unbearable",
        "requiring the feature to be turned off."
      ],
      "odiNumbers": [
        "10881652"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "HVAC Servo Motor Malfunction",
      "impact": "The malfunction of the HVAC servo motor can cause the air conditioning system to malfunction, leading to uncomfortable temperatures and potential health issues for occupants, especially in extreme weather conditions.",
      "symptoms": [
        "The front passenger side air conditioning blows outside temperature air",
        "does not blow cold air",
        "error code B1455 is present",
        "and the issue occurs at approximately 25",
        "000 miles."
      ],
      "odiNumbers": [
        "11364790"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Abnormal Brake Noise",
      "impact": "The unusual thumping noise when pressing the brake pedal can be a sign of a potential brake system issue, which can lead to reduced braking performance, increased stopping distances, and potentially cause accidents.",
      "symptoms": [
        "A loud thumping or unusual noise when pressing the brake pedal",
        "especially when braking hard or continuously."
      ],
      "odiNumbers": [
        "11298666"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Misdiagnosis or Lack of Proper Repair by Dealership",
      "impact": "Failure to properly diagnose and repair brake system issues can lead to continued safety risks, reduced vehicle performance, and decreased customer satisfaction.",
      "symptoms": [
        "Dealership or mechanic fails to identify or repair brake system issues",
        "provides inadequate or misleading explanations for the problem."
      ],
      "odiNumbers": [
        "11298666"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Takata Airbag Recall and Brake Vibration Issues",
      "impact": "The failure to replace the recalled Takata airbag can lead to serious injury or fatalities in the event of an accident. Additionally, the brake vibration issue can cause loss of control, accidents, and injuries.",
      "symptoms": [
        "The vehicle has a recalled Takata airbag that has not been replaced",
        "the brake pedal vibrates or pulses",
        "the steering wheel shakes or vibrates while braking",
        "the vehicle is difficult to control while braking",
        "the brake issue is intermittent."
      ],
      "odiNumbers": [
        "11123971"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Inadequate Dealership Service",
      "impact": "The inability of dealerships to diagnose and repair the brake vibration issue can lead to continued risk of accidents and injuries, and the failure to replace the recalled Takata airbag can lead to serious injury or fatalities.",
      "symptoms": [
        "Dealerships are unable to diagnose the brake vibration issue",
        "dealerships are unable to repair the brake vibration issue",
        "dealerships do not have a solution for the brake vibration issue",
        "dealerships are unaware of the Takata airbag recall",
        "dealerships are unable to replace the recalled Takata airbag."
      ],
      "odiNumbers": [
        "11123971"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}