{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "STEERING",
    "SERVICE BRAKES",
    "EXTERIOR LIGHTING",
    "ELECTRICAL SYSTEM",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Steering System Misalignment and Vibration",
      "impact": "The misalignment of the steering system and vibration can cause the vehicle to wander or drift while driving, making it difficult to control, which can lead to accidents or loss of vehicle stability.",
      "symptoms": [
        "The vehicle wanders or drifts while driving on a straight road",
        "the steering wheel cannot be centered",
        "the steering wheel and front driver-side seat vibrate while driving at certain speeds",
        "the vehicle clunks and lurches forward when approaching a complete stop."
      ],
      "odiNumbers": [
        "10993136",
        "10854768"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Spongy Brake Pedal and Intermittent Brake Failure",
      "impact": "The spongy brake pedal and intermittent brake failure can cause a loss of braking power, leading to increased stopping distances, accidents, and potentially serious injuries or fatalities.",
      "symptoms": [
        "The brake pedal feels soft or spongy",
        "the brake pedal travels to the floor with little or no resistance",
        "the vehicle slows down slightly but does not come to a complete stop",
        "the brake pedal has a delayed response to braking input."
      ],
      "odiNumbers": [
        "10935146",
        "10915364"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Brake Pedal Failure to Return",
      "impact": "The brake pedal failure to return to its normal position can cause the driver to lose control of the vehicle, leading to accidents and potentially serious injuries or fatalities.",
      "symptoms": [
        "The brake pedal remains stuck to the floor",
        "the brake pedal does not return to its normal position after being pressed",
        "the vehicle is unable to be driven safely."
      ],
      "odiNumbers": [
        "10935146"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Excessive Glare from High-Intensity Headlights",
      "impact": "The excessive glare from high-intensity headlights can cause temporary blindness, distraction, and discomfort to other drivers, pedestrians, and cyclists, increasing the risk of accidents and road rage incidents.",
      "symptoms": [
        "Excessive glare from oncoming or following vehicles",
        "especially from larger pickup trucks",
        "causing temporary blindness",
        "discomfort",
        "or distraction; difficulty seeing the road ahead or surrounding environment; need to adjust or avoid looking at rearview mirrors to reduce glare."
      ],
      "odiNumbers": [
        "11047087"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Instrument Cluster/Dashboard Electronics Failure",
      "impact": "The failure of the instrument cluster/dashboard electronics can cause a range of issues, including malfunctioning radio, incorrect date and time, loss of radio programs, and faulty dimming controls, which can be distracting and potentially lead to accidents.",
      "symptoms": [
        "The dashboard electronics reset",
        "the radio malfunctions",
        "the date and time are incorrect",
        "radio programs are lost",
        "dimming controls do not function properly",
        "unknown other issues may occur."
      ],
      "odiNumbers": [
        "10938984"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Intermittent Radio Failure",
      "impact": "The intermittent failure of the radio can cause frustration and distraction while driving, potentially leading to accidents or decreased driver attention.",
      "symptoms": [
        "The radio turns off for periods of time",
        "the radio does not work at all",
        "the radio works only occasionally",
        "the radio has poor reception or sound quality."
      ],
      "odiNumbers": [
        "10906460"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}