{
  "totalComplaints": 26,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "FUEL/PROPULSION SYSTEM",
    "AIR BAGS",
    "ELECTRICAL SYSTEM"
  ],
  "parsedComplaintsResultLength": 7,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel Pump Control Module Failure",
      "impact": "The failure of the fuel pump control module can cause the fuel pump to run continuously, resulting in a drained battery and/or a no-start condition, or cause a loss of motive power while the vehicle is in motion, which can increase the risk of a crash causing injury and/or damage to property.",
      "symptoms": [
        "The vehicle suddenly stops receiving gas and starts coasting",
        "the vehicle stops working in the middle of traffic",
        "the fuel pump runs continuously",
        "the battery drains",
        "the vehicle is unable to start",
        "the vehicle loses motive power while in motion."
      ],
      "odiNumbers": [
        "11327163",
        "11044520",
        "11043483"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Fuel Pump Recall Issues",
      "impact": "The delay in repairing the fuel pump control module can cause the driver to continue driving a potentially dangerous vehicle, increasing the risk of a crash causing injury and/or damage to property.",
      "symptoms": [
        "The driver receives notification of the recall but the part is unavailable",
        "the dealer is unable to repair the vehicle",
        "the manufacturer is unaware of the issue",
        "the driver is forced to continue driving the vehicle without a repair."
      ],
      "odiNumbers": [
        "11088549",
        "11084631",
        "11044520",
        "11043483"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Fuel Pump/Push Start Ignition Issues",
      "impact": "The failure of the fuel pump and push start ignition can cause the vehicle to stall or not start, which can increase the risk of a crash causing injury and/or damage to property.",
      "symptoms": [
        "The push start ignition does not respond while turning the vehicle off",
        "the vehicle stalls or does not start."
      ],
      "odiNumbers": [
        "11057246"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Gas Pumping Issues",
      "impact": "The failure of the fuel pump can cause the gas pump to shut off every few seconds, making it difficult to fill the tank, which can cause inconvenience and delay.",
      "symptoms": [
        "The gas pump clicks off every few seconds",
        "the tank takes a long time to fill",
        "the gas pump shuts off frequently."
      ],
      "odiNumbers": [
        "11193013"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Clock Spring Failure",
      "impact": "The failure of the clock spring can cause the airbag light to come on, rendering the airbag system inoperable, and potentially leading to a lack of warning in the event of an accident. Additionally, the failure can also cause the horn to malfunction, increasing the risk of accidents due to the inability to warn other drivers.",
      "symptoms": [
        "The airbag light comes on",
        "the horn does not work",
        "the audio controls on the steering wheel stop working",
        "a noise comes out of the wheel when turning",
        "and the steering panel does not function."
      ],
      "odiNumbers": [
        "11520704",
        "11488206",
        "11472467",
        "11267143",
        "11180280",
        "11042077"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Takata Airbag Recall Issues",
      "impact": "The Takata airbag recall has left many owners without a functioning airbag system, putting them at risk in the event of an accident. The lack of available parts and unclear timelines for repair have caused frustration and concern among owners.",
      "symptoms": [
        "None",
        "as this issue is related to the recall and lack of repair rather than a specific symptom."
      ],
      "odiNumbers": [
        "11180280",
        "11042077",
        "11267143"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Clock Spring Failure",
      "impact": "The failure of the clock spring can cause the airbags to be disabled, leading to a significant safety risk in the event of an accident.",
      "symptoms": [
        "The airbag sensor light comes on",
        "the horn does not work",
        "electrical components on the wheel do not work",
        "all airbags are disabled",
        "the steering power fails",
        "and the computer system malfunctions."
      ],
      "odiNumbers": [
        "11439051",
        "11389150",
        "11279682",
        "11173730"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}