{
  "totalComplaints": 10,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "SEATS",
    "SEAT BELTS",
    "ELECTRICAL SYSTEM",
    "STEERING",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 9,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Seat Back Screw Failure",
      "impact": "The failure of the seat back screws can cause the seat backs to detach from the seat frame, leading to a loss of control and increased risk of accidents, particularly during sudden stops or crashes.",
      "symptoms": [
        "The seat back screws or shrouds break off",
        "the seat back moves or comes loose",
        "the driver and passenger are pushed forward against the steering wheel and dashboard",
        "the seat back is no longer securely attached to the seat frame."
      ],
      "odiNumbers": [
        "11476077",
        "11459062"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Driver's Side Seat Belt Extension Failure",
      "impact": "The failure of the driver's side seat belt to extend can lead to improper restraint, increasing the risk of injury or fatality in the event of an accident.",
      "symptoms": [
        "The driver's side seat belt does not extend",
        "making it difficult or impossible to wear the seat belt properly."
      ],
      "odiNumbers": [
        "11419985"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Unintended Acceleration and Gas Pedal Malfunction",
      "impact": "Unintended acceleration can cause loss of vehicle control, leading to accidents, injuries, or fatalities. The malfunctioning gas pedal can also cause the vehicle to accelerate even after the driver has removed their foot from the pedal.",
      "symptoms": [
        "The gas pedal feels strange or shifts to the right",
        "the vehicle accelerates unintentionally",
        "the vehicle continues to accelerate even after the driver has removed their foot from the pedal."
      ],
      "odiNumbers": [
        "11099569"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Seat Belt Failure to Restrain",
      "impact": "The failure of the seat belt to restrain the driver can lead to increased risk of injury or fatality in the event of an accident.",
      "symptoms": [
        "The seat belt does not hold the driver in place during an accident",
        "allowing the driver to move around or be ejected from the vehicle."
      ],
      "odiNumbers": [
        "11099569"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Delayed or Unavailable Recall Repair Parts for Battery Fuse Block Inspection and Chassis Fuse Relocation",
      "impact": "The delayed or unavailable parts for the recall repair can put riders at risk, as the vehicle may experience steering and light failures, which can lead to accidents or injuries.",
      "symptoms": [
        "None reported",
        "as the issue is related to the unavailability of recall repair parts."
      ],
      "odiNumbers": [
        "11363025",
        "11331688"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Electrical System Failure",
      "impact": "The failure of the electrical system can cause critical safety features such as headlights, brake lights, and instrument panel lighting to malfunction, increasing the risk of accidents. Additionally, the loss of power steering can make the vehicle difficult to control, leading to potential crashes.",
      "symptoms": [
        "Headlights",
        "rear brake lights",
        "and instrument panel lighting randomly shut off",
        "power steering seizes",
        "steering wheel becomes difficult to turn",
        "ABS warning indicator illuminates",
        "traction control and steering ability fail",
        "vehicle pulls to one side."
      ],
      "odiNumbers": [
        "11286440",
        "10958800"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Control Module Failure",
      "impact": "The failure of the control module can cause critical safety features such as ABS and traction control to malfunction, increasing the risk of accidents.",
      "symptoms": [
        "ABS warning indicator illuminates",
        "traction control and steering ability fail",
        "vehicle pulls to one side."
      ],
      "odiNumbers": [
        "10958800"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Battery Cable Failure",
      "impact": "The failure of the battery cable can cause the vehicle to stall or not start, leaving the driver stranded and potentially causing accidents.",
      "symptoms": [
        "Vehicle will not start",
        "battery cable is loose."
      ],
      "odiNumbers": [
        "10958800"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Brake System Failure Warning",
      "impact": "The brake system failure warning can cause the \"brake failure\" light to illuminate on the dashboard, disabling the cruise control and potentially leading to a loss of vehicle control, which can increase the risk of accidents.",
      "symptoms": [
        "The \"brake failure\" light illuminates on the dashboard",
        "cruise control is disabled",
        "brake pedal feels spongy or soft",
        "brake pedal travels further than usual",
        "vehicle takes longer to stop than usual."
      ],
      "odiNumbers": [
        "11451617",
        ""
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}