{
  "totalComplaints": 14,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "STEERING",
    "BACK OVER PREVENTION"
  ],
  "parsedComplaintsResultLength": 12,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Auxiliary Battery Failure",
      "impact": "The failure of the auxiliary battery can leave the vehicle inoperable, causing inconvenience and potential safety risks.",
      "symptoms": [
        "The vehicle is unable to start",
        "the auxiliary battery is dead",
        "and the vehicle's electrical systems are affected."
      ],
      "odiNumbers": [
        "11534412"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Moonroof Electrical Retractable Interior Lining Failure",
      "impact": "The failure of the moonroof electrical retractable interior lining can cause the moonroof to malfunction, leading to inconvenience and potential safety risks.",
      "symptoms": [
        "The moonroof electrical retractable interior lining is bunched up",
        "and the moonroof cannot close properly."
      ],
      "odiNumbers": [
        "11534412"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Seatbelt Lock-up",
      "impact": "The seatbelt lock-up can cause undue constriction and stress on the driver and passenger, potentially leading to safety risks.",
      "symptoms": [
        "The seatbelt on both the driver and passenger sides continually locks up",
        "causing discomfort and stress."
      ],
      "odiNumbers": [
        "11534412"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Dashboard Light Illumination and Sensor Failure",
      "impact": "The illumination of various dashboard lights, including the engine light, ABS, and emergency brake failure message, can indicate critical safety concerns and potentially lead to accidents.",
      "symptoms": [
        "Multiple dashboard lights illuminate",
        "including the engine light",
        "ABS",
        "and emergency brake failure message",
        "and the vehicle drives as if the power steering has failed."
      ],
      "odiNumbers": [
        "11462066"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Wheel Speed Sensor Failure",
      "impact": "The failure of the wheel speed sensors can cause critical safety concerns, including loss of power steering and potentially leading to accidents.",
      "symptoms": [
        "The vehicle displays codes for wheel speed sensor failure",
        "and the vehicle drives as if the power steering has failed."
      ],
      "odiNumbers": [
        "11462066"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Radio Staying On and Battery Drain",
      "impact": "The radio staying on and battery drain can cause the vehicle's battery to drain, leading to inconvenience and potential safety risks.",
      "symptoms": [
        "The radio stays on even after the vehicle is turned off",
        "and the battery drains completely if not cranked every 6-8 hours."
      ],
      "odiNumbers": [
        "11311498"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 7,
      "issueCategory": "Instrument Panel Screen Blackout",
      "impact": "The instrument panel screen blackout can cause inconvenience and potential safety risks, especially when reversing.",
      "symptoms": [
        "The instrument panel screen blacks out",
        "including the backup camera screen",
        "and the failure occurs every time the engine is started."
      ],
      "odiNumbers": [
        "11204959"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 8,
      "issueCategory": "Electrical Harness Damage",
      "impact": "The damage to the electrical harness can cause electrical system failures, leading to potential safety risks, including vehicle fires and system control problems.",
      "symptoms": [
        "The left hatch harness cover is crushed",
        "and the wiring is getting pinched every time the hatch is opened and closed."
      ],
      "odiNumbers": [
        "11123544"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Electrical Harness Failure",
      "impact": "The failure of the electrical harness can cause multiple systems to malfunction, including power steering, engine, and airbag systems, which can lead to a loss of vehicle control, increased risk of accidents, and potential harm to occupants.",
      "symptoms": [
        "Multiple components of the vehicle fail to operate",
        "including parking",
        "power steering",
        "engine",
        "and seats; abnormal popping sound while turning the steering wheel; airbag warning light illuminated on the instrument panel; features on the steering wheel fail to operate as needed."
      ],
      "odiNumbers": [
        "11529022",
        "11412908"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Steering System Failure",
      "impact": "The failure of the steering system can cause a loss of vehicle control, increasing the risk of accidents and potential harm to occupants.",
      "symptoms": [
        "Abnormal popping sound while turning the steering wheel; features on the steering wheel fail to operate as needed."
      ],
      "odiNumbers": [
        "11412908"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Infotainment System Failure",
      "impact": "The failure of the infotainment system can cause distractions while driving, as the driver may be focused on the malfunctioning screen instead of the road, which can increase the risk of accidents.",
      "symptoms": [
        "The display screen goes blank",
        "the screen displays a still frame image",
        "unknown sensor warning messages appear on the screen",
        "the system fails to respond or is unresponsive."
      ],
      "odiNumbers": [
        "11587123"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Sensor Malfunction",
      "impact": "The malfunction of sensors can cause incorrect or misleading information to be displayed on the infotainment system, which can lead to confusion and distraction while driving, increasing the risk of accidents.",
      "symptoms": [
        "Unknown sensor warning messages appear on the screen",
        "incorrect or misleading information is displayed on the infotainment system."
      ],
      "odiNumbers": [
        "11587123"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}