{
  "totalComplaints": 15,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "STEERING",
    "UNKNOWN OR OTHER",
    "VEHICLE SPEED CONTROL",
    "POWER TRAIN"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Unstable Handling and Pulling to One Side",
      "impact": "The unstable handling and pulling to one side can cause the motorcycle to lose control, leading to accidents, injuries, or fatalities. This issue can also cause uneven tire wear, increasing costs for the consumer.",
      "symptoms": [
        "The motorcycle pulls to one side",
        "typically the left",
        "while riding at highway speeds",
        "especially when near semi-trucks or in crosswinds. The bike requires constant pressure adjustment to track a straight line",
        "and if not corrected",
        "can veer into oncoming traffic. The issue can cause fatigue on long rides",
        "making it difficult to control the bike."
      ],
      "odiNumbers": [
        "11414373",
        "11253455",
        "11196948",
        "11082340",
        "11082379"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Wobbling and Vibrations",
      "impact": "The wobbling and vibrations can cause the motorcycle to lose control, leading to accidents, injuries, or fatalities. This issue can also make it difficult to control the bike, especially when riding at high speeds.",
      "symptoms": [
        "The motorcycle wobbles or vibrates abnormally",
        "especially when riding at high speeds or behind high-profile vehicles. The wobbling can be more noticeable in crosswinds or when riding near semi-trucks."
      ],
      "odiNumbers": [
        "11414373",
        "11253455"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Vehicle Instability at Highway Speed",
      "impact": "The vehicle's instability at high speeds can lead to loss of control, accidents, and potential injuries or fatalities.",
      "symptoms": [
        "The vehicle feels unstable or wobbly while driving at highway speeds",
        "despite attempts to balance wheels and replace tires."
      ],
      "odiNumbers": [
        "11113682"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Throttle Sticking on Motorcycle",
      "impact": "The throttle sticking can cause the motorcycle to accelerate uncontrollably, leading to loss of control, accidents, and potential injuries or fatalities.",
      "symptoms": [
        "The throttle gets stuck revving at high RPM (approximately 3000 RPM) when starting the engine from a stationary position in neutral",
        "making it impossible to shift gears or control the throttle."
      ],
      "odiNumbers": [
        "11098192"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Throttle Unresponsiveness",
      "impact": "The throttle's failure to respond can cause the vehicle to stall or lose power, leading to accidents or leaving the driver stranded.",
      "symptoms": [
        "The throttle does not respond when turning the engine on",
        "making it difficult or impossible to accelerate or control the vehicle."
      ],
      "odiNumbers": [
        "11097731"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Throttle Body Failure",
      "impact": "The failure of the throttle body can cause the motorcycle to enter limp mode, resulting in a loss of power and acceleration, which can increase the risk of accidents, especially at high speeds.",
      "symptoms": [
        "The motorcycle enters limp mode",
        "the engine problem warning message is displayed",
        "the accelerator pedal is depressed but the vehicle fails to accelerate",
        "the vehicle hesitates or stalls",
        "the motorcycle experiences intermittent power loss."
      ],
      "odiNumbers": [
        "11464467",
        "11351396"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Intermittent Engine Power Loss",
      "impact": "The intermittent loss of engine power can cause the motorcycle to stall or hesitate, increasing the risk of accidents, especially at high speeds.",
      "symptoms": [
        "The motorcycle experiences intermittent power loss",
        "the engine problem warning message is displayed",
        "the accelerator pedal is depressed but the vehicle fails to accelerate",
        "the vehicle hesitates or stalls",
        "the motorcycle enters limp mode."
      ],
      "odiNumbers": [
        "11351396"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Delayed Recall Repair for Power Train Issue",
      "impact": "The delay in providing the necessary parts for the recall repair can lead to a prolonged period of uncertainty for the vehicle owner, potentially affecting their confidence in the vehicle's safety and performance.",
      "symptoms": [
        "Notification of recall",
        "but parts are not available for repair",
        "manufacturer exceeds reasonable time for recall repair",
        "uncertainty about vehicle safety."
      ],
      "odiNumbers": [
        "11311599",
        "11301367"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}