{
  "totalComplaints": 52,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "FUEL/PROPULSION SYSTEM",
    "ELECTRICAL SYSTEM",
    "POWER TRAIN"
  ],
  "parsedComplaintsResultLength": 12,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Fuel Pump Failure",
      "impact": "The failure of the fuel pump can cause the vehicle to stall or accelerate unexpectedly, leading to accidents or fires.",
      "symptoms": [
        "The fuel pump continues to run after the engine is shut off",
        "the vehicle stalls or accelerates unexpectedly",
        "the fuel pump makes a humming or whining noise",
        "the vehicle has difficulty starting or running",
        "the fuel level in the tank is not high enough to properly cool the pump",
        "which can cause overheating and potentially lead to a fire."
      ],
      "odiNumbers": [
        "11487686",
        "11387823",
        "11375061",
        "11367055",
        "11329983",
        "11324901",
        "11323813",
        "11321787",
        "11319947"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Unintended Acceleration",
      "impact": "The unintended acceleration of the vehicle can cause accidents or loss of control, leading to injuries or fatalities.",
      "symptoms": [
        "The vehicle accelerates suddenly and unexpectedly",
        "the vehicle jumps the curb or hits an obstacle",
        "the vehicle's auto-braking system fails to function."
      ],
      "odiNumbers": [
        "11552788",
        "11367055"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Fuel System Issues",
      "impact": "The fuel system issues can cause the vehicle to stall or have difficulty starting, leading to inconvenience and potential safety risks.",
      "symptoms": [
        "The fuel pump makes a humming or whining noise",
        "the vehicle has difficulty starting or running",
        "the fuel level in the tank is not high enough to properly cool the pump",
        "the vehicle stalls or has difficulty accelerating",
        "the fuel system warning light is illuminated."
      ],
      "odiNumbers": [
        "11316848",
        "11316755",
        "11310505",
        "11301532"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Camera Detection (RCD) System Failure",
      "impact": "The failure of the RCD system can cause a lack of visibility while reversing, increasing the risk of accidents or injuries.",
      "symptoms": [
        "The RCD system displays an \"unavailable\" message",
        "and the rear camera does not function properly."
      ],
      "odiNumbers": [
        "11549096"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Unusual Loud Noise and Flashing Lights on Startup",
      "impact": "The loud noise and flashing lights can startle the driver and potentially cause an accident.",
      "symptoms": [
        "A loud",
        "high-pitched sound is emitted when starting the vehicle",
        "accompanied by flashing red and green lights next to the SOS button."
      ],
      "odiNumbers": [
        "11545731"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Climate Control Panel Failure",
      "impact": "The failure of the climate control panel can cause a lack of defrosting and demisting capabilities, leading to reduced visibility and increased risk of accidents.",
      "symptoms": [
        "The climate control panel does not function",
        "resulting in no fan",
        "heat",
        "air conditioning",
        "window defroster",
        "mirror defroster",
        "or seat heat."
      ],
      "odiNumbers": [
        "11530193"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Defective Sunroof",
      "impact": "The defective sunroof can cause water to leak into the vehicle, leading to mold growth and potential electrical issues.",
      "symptoms": [
        "The sunroof clogs",
        "causing water to spill into the interior",
        "and the driver-side sunroof tray drains become clogged."
      ],
      "odiNumbers": [
        "11505992"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Unreliable Pre-Collision Warning System",
      "impact": "The unreliable pre-collision warning system can cause the driver to rely on a faulty system, increasing the risk of accidents.",
      "symptoms": [
        "The pre-collision warning system light turns on intermittently",
        "indicating a faulty system."
      ],
      "odiNumbers": [
        "11485006"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Blind Spot Monitoring System Failure",
      "impact": "The failure of the blind spot monitoring system can cause the driver to be unaware of vehicles in the blind spot, increasing the risk of accidents.",
      "symptoms": [
        "The blind spot monitoring system on the passenger side does not function properly",
        "failing to detect vehicles in the blind spot."
      ],
      "odiNumbers": [
        "11331907",
        "11183716"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 7,
      "issueCategory": "Unintended Acceleration",
      "impact": "The unintended acceleration can cause the vehicle to accelerate suddenly, increasing the risk of accidents.",
      "symptoms": [
        "The vehicle hesitates and then accelerates spontaneously while driving in stop-and-go traffic."
      ],
      "odiNumbers": [
        "11195557"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Slipping or Jerking",
      "impact": "The transmission slipping or jerking can cause the vehicle to stall or hesitate, leading to accidents or near-misses, especially when accelerating from a stop or turning into traffic.",
      "symptoms": [
        "The vehicle jerks or hesitates when shifting gears",
        "especially at low speeds (less than 35 mph)",
        "the transmission slips or feels like it's downshifting unexpectedly",
        "the vehicle stalls or hesitates when accelerating from a stop."
      ],
      "odiNumbers": [
        "11535916",
        "11309436",
        "11282119"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Transmission Stalling",
      "impact": "The transmission stalling can cause the vehicle to come to a sudden stop, leading to accidents or near-misses, especially when accelerating from a stop or turning into traffic.",
      "symptoms": [
        "The vehicle stalls when accelerating from a stop",
        "especially at low speeds",
        "the vehicle stalls when turning into traffic",
        "the vehicle hesitates or jerks before shifting gears."
      ],
      "odiNumbers": [
        "11427262",
        "11338968",
        "11282119"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}