{
  "totalComplaints": 33,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "EXTERIOR LIGHTING",
    "STEERING",
    "VISIBILITY/WIPER",
    "STRUCTURE"
  ],
  "parsedComplaintsResultLength": 11,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Daytime Running Light Failure",
      "impact": "The failure of the daytime running lights can reduce the visibility of the vehicle, making it difficult for other drivers to see it, which can lead to accidents.",
      "symptoms": [
        "The daytime running lights stop working without warning signs or notifications",
        "reducing visibility."
      ],
      "odiNumbers": [
        "11583318",
        "11565006"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Headlight Design Issues",
      "impact": "The narrow cone of light projected forward by the headlights can make it difficult to determine if it is safe to turn, especially when turning from one dark road onto another dark road.",
      "symptoms": [
        "The light cone is blocked by the escutcheon around the headlight",
        "which is set inward too deep",
        "making it difficult to see when turning."
      ],
      "odiNumbers": [
        "11522954",
        "11374036",
        "11363062"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Rear Light Failure",
      "impact": "The failure of the rear lights, including brake lights, can reduce the visibility of the vehicle, making it difficult for other drivers to see it, which can lead to accidents.",
      "symptoms": [
        "The rear lights can be turned off when a bright light is shone on the rear red lenses",
        "disabling the brake lights",
        "and there are no warning lights that pop up when the rear lights or brake lights go out."
      ],
      "odiNumbers": [
        "11427376",
        "11424781",
        "11423306"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Inadequate Lighting",
      "impact": "Inadequate lighting can make it difficult to drive safely, especially at night, which can lead to accidents.",
      "symptoms": [
        "The light intensity of the main beam is insufficient for proper night driving on dark roads."
      ],
      "odiNumbers": [
        "11522954"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Uncommanded Lane Keep Assist Activation",
      "impact": "The sudden and uncommanded activation of the lane keep assist feature can cause the vehicle to swerve or move unexpectedly, increasing the risk of accidents or loss of control.",
      "symptoms": [
        "The lane keep assist feature activates without driver input or warning",
        "the steering wheel turns abruptly",
        "the vehicle moves from side to side",
        "the driver must take corrective action to maintain control."
      ],
      "odiNumbers": [
        "11360178",
        "11375851"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Power Steering Failure/Lock-Up",
      "impact": "The failure or lock-up of the power steering system can cause the steering wheel to become difficult or impossible to turn, increasing the risk of accidents or loss of control.",
      "symptoms": [
        "The power steering is disabled or locked",
        "the steering wheel is difficult or impossible to turn",
        "the vehicle is unable to be driven."
      ],
      "odiNumbers": [
        "11446777",
        "11446251"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Engine Stalling and Loss of Steering",
      "impact": "The sudden stalling of the engine and loss of steering can cause the vehicle to become unstable and increase the risk of accidents or loss of control.",
      "symptoms": [
        "The engine dies",
        "the cluster shows a red triangle and alarm message",
        "the steering wheel vibrates",
        "the vehicle is unable to be moved."
      ],
      "odiNumbers": [
        "11454234"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Defective Windshield",
      "impact": "The defective windshield can crack or shatter due to minor impacts, such as small pebbles or even no apparent strike, impairing visibility and creating an unsafe driving experience.",
      "symptoms": [
        "Windshield cracks or shatters with minimal or no external impact",
        "cracks form from the A-pillar or other areas not related to rock chips",
        "windshield noise or sudden cracking sound."
      ],
      "odiNumbers": [
        "11491779",
        "11435211",
        "11433648"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Windshield Wiper Failure",
      "impact": "The failure of the windshield wipers can impair visibility during rain or other weather conditions, increasing the risk of accidents.",
      "symptoms": [
        "Windshield wipers fail to turn on or function properly",
        "especially during rainstorms."
      ],
      "odiNumbers": [
        "11364755"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "A-Pillar Trim Failure",
      "impact": "The failure of the A-Pillar trim can cause it to detach from the vehicle while driving, potentially causing accidents or injuries to occupants or other road users.",
      "symptoms": [
        "Rattling or fluttering noise from the A-Pillar",
        "A-Pillar trim comes loose or falls off while driving",
        "A-Pillar trim mounting bolt is pulled out."
      ],
      "odiNumbers": [
        "11484723",
        "11384926",
        "11348990"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Windshield Failure",
      "impact": "The sudden and unexpected cracking of the windshield can obstruct the driver's view, leading to accidents or injuries.",
      "symptoms": [
        "Windshield cracks or shatters without any apparent cause or warning",
        "no impact or temperature gradients."
      ],
      "odiNumbers": [
        "11434894"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}