{
  "totalComplaints": 13,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "POWER TRAIN",
    "ENGINE AND ENGINE COOLING"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Electronic Throttle Control System Failure",
      "impact": "The failure of the electronic throttle control system can cause the vehicle to lose power, making it difficult to control, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The vehicle's dashboard lights go out",
        "the car sounds as if it is going to shut down",
        "and power to the vehicle is declined dramatically when the gas pedal is pushed and speed is above 65MPH."
      ],
      "odiNumbers": [
        "11542389"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Transmission Shift Indicator Failure",
      "impact": "The failure of the transmission shift indicator can cause the vehicle to roll or move unexpectedly, potentially leading to accidents or theft of the vehicle.",
      "symptoms": [
        "The vehicle displays a \"shift to park\" message on the dashboard when the vehicle is already in park",
        "and the instruments do not shut down properly",
        "causing power draining."
      ],
      "odiNumbers": [
        "11501458"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Engine Power Reduction Due to Faulty Pedal",
      "impact": "The faulty pedal can cause the engine power to be reduced, making it difficult to control the vehicle, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The check engine light comes on",
        "and a message on the dashboard says \"engine power reduced",
        "\" causing the vehicle to lose power."
      ],
      "odiNumbers": [
        "11492192"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Safety Restraint System Failure",
      "impact": "The failure of the safety restraint system can cause the airbag to not deploy in the event of a crash, potentially leading to serious injury or death.",
      "symptoms": [
        "The \"Safety Restraint system\" service warning appears on the dashboard",
        "indicating a problem with the sensor under the passenger seat."
      ],
      "odiNumbers": [
        "11487865"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Electrical System Failure",
      "impact": "The failure of the electrical system can cause the vehicle to stall, making it difficult to control, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The interior lights stay on",
        "and the vehicle stalls while operating",
        "accompanied by the engine light coming on."
      ],
      "odiNumbers": [
        "11300501"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Shudder on 8-Speed Automatic Transmission",
      "impact": "The transmission shudder can cause the vehicle to shake violently, leading to a loss of control, especially at high speeds, which can increase the risk of accidents and put the driver's safety at risk.",
      "symptoms": [
        "The vehicle shakes or vibrates when accelerating",
        "especially at high speeds",
        "the transmission feels like it's slipping or hesitating",
        "the vehicle may hesitate or stumble when shifting gears."
      ],
      "odiNumbers": [
        "11547440"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Transmission Failure Causing Loss of Acceleration and Rollback",
      "impact": "The transmission failure can cause the vehicle to lose acceleration, roll backward, and potentially lead to accidents, especially on inclines or when stopping at intersections, which can put the driver's safety and the safety of others at risk.",
      "symptoms": [
        "The vehicle loses acceleration",
        "the vehicle rolls backward when in Drive",
        "the vehicle may hesitate or stumble when shifting gears",
        "the vehicle may not respond to accelerator input."
      ],
      "odiNumbers": [
        "11535972"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Performance Shift Activation Causing Loss of Control",
      "impact": "The performance shift activation can cause the vehicle to drift or lose control, leading to accidents, especially at moderate speeds, which can put the driver's safety and the safety of others at risk.",
      "symptoms": [
        "The performance shift warning light illuminates",
        "the vehicle drifts or loses control",
        "the vehicle may hesitate or stumble when shifting gears",
        "the vehicle may not respond to accelerator input."
      ],
      "odiNumbers": [
        "11463040"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Thermostat Failure",
      "impact": "A faulty thermostat can cause the engine to overheat, leading to potential engine damage, reduced performance, and increased risk of breakdowns. In extreme cases, engine overheating can cause serious accidents or even engine failure.",
      "symptoms": [
        "The coolant gauge remains stuck in the cold region",
        "the vehicle overheats",
        "an abnormal sound is heard after the engine is turned off",
        "the check engine warning light is illuminated."
      ],
      "odiNumbers": [
        "11546860"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Cooling System Failure",
      "impact": "Cooling system failures can cause engine overheating, leading to potential engine damage, reduced performance, and increased risk of breakdowns. In extreme cases, engine overheating can cause serious accidents or even engine failure.",
      "symptoms": [
        "The vehicle overheats",
        "the coolant gauge remains stuck in the cold region",
        "the check engine warning light is illuminated",
        "an abnormal sound is heard after the engine is turned off."
      ],
      "odiNumbers": [
        "11546860"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}