{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "STRUCTURE",
    "VISIBILITY/WIPER",
    "ELECTRICAL SYSTEM"
  ],
  "parsedComplaintsResultLength": 12,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Front Window Shattering",
      "impact": "The sudden and unexpected shattering of the front window can cause a loss of visibility while driving, potentially leading to accidents, and can also result in damage to the interior of the vehicle and injury to occupants.",
      "symptoms": [
        "The front window shatters suddenly",
        "without any apparent impact or reason",
        "while the vehicle is in motion or parked",
        "resulting in broken glass and potential damage to the interior."
      ],
      "odiNumbers": [
        "11566822",
        "11388937"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Sewer Termination Bracket Failure",
      "impact": "The failure of the sewer termination bracket can cause the plumbing to drag on the road, potentially leading to damage to the vehicle, other vehicles, and road infrastructure, and can also result in unsanitary conditions and environmental hazards.",
      "symptoms": [
        "The sewer termination bracket fails",
        "causing the plumbing to drag on the road",
        "resulting in potential damage and hazards."
      ],
      "odiNumbers": [
        "11580176"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Sagging Walls on Travel Trailers",
      "impact": "The sagging walls on travel trailers can cause the tires to contact the fender, leading to potential damage to the vehicle and creating a safety hazard while driving.",
      "symptoms": [
        "Walls sagging to the point where the tires will contact the fender",
        "uneven or crooked walls",
        "compromised structural integrity of the trailer."
      ],
      "odiNumbers": [
        "11492478"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Spontaneous Front Window Glass Failure",
      "impact": "The spontaneous combustion of the front window glass can cause sudden and unexpected shattering, potentially leading to injuries, accidents, or obstructed vision while driving.",
      "symptoms": [
        "Sudden and unexpected shattering of the front window glass",
        "loud noise",
        "broken glass",
        "compromised visibility."
      ],
      "odiNumbers": [
        "11450170"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Sewer Pipe Failure on Travel Trailers",
      "impact": "The failure of the sewer pipe on travel trailers can cause raw sewage to be released on the highway, creating a hazardous and unsanitary environment, and potentially causing accidents or injuries.",
      "symptoms": [
        "Sewer pipe failure",
        "raw sewage release",
        "unpleasant odors",
        "compromised sanitation and hygiene."
      ],
      "odiNumbers": [
        "11354675"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Spontaneous Shattering of Front Window in Camper",
      "impact": "The sudden and unexplained shattering of the front window in the camper can cause injury to occupants, particularly if they are sleeping inside, and may lead to lacerations, eye damage, or other harm.",
      "symptoms": [
        "The front window of the camper shatters suddenly and without warning",
        "often when the vehicle is parked and stationary",
        "with no apparent reason or external cause."
      ],
      "odiNumbers": [
        "11414584"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Poor Window Frame Design and Assembly",
      "impact": "A warped or poorly assembled window frame can cause the glass to shatter unexpectedly, leading to potential harm to occupants and damage to the vehicle.",
      "symptoms": [
        "Over-tightened screw heads",
        "warped window frame",
        "and signs of stress or binding on the glass."
      ],
      "odiNumbers": [
        "11414584"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Poor Manufacturing and Quality Control Issues in Travel Trailers",
      "impact": "The numerous failures of various components and systems in the travel trailer can lead to safety hazards, inconvenience, and financial losses for the owners. The issues can cause damage to the trailer, its contents, and potentially lead to accidents or injuries.",
      "symptoms": [
        "Refrigerator breaks loose from its mounting screws",
        "exit door gets stuck",
        "circuit breaker panel falls out of the wall",
        "microwave breaks loose from its mounting screws",
        "sink falls down due to inadequate mounting",
        "window valances break loose",
        "electric brake wires fall out of their splices",
        "and top cabinets are at risk of falling down."
      ],
      "odiNumbers": [
        "11341754"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Inadequate Refrigerator Mounting",
      "impact": "The refrigerator breaking loose from its mounting screws can cause damage to the appliance, the trailer's interior, and potentially lead to injuries or accidents.",
      "symptoms": [
        "Refrigerator slides back or falls out of its mounting position",
        "propane line is at risk of breaking off."
      ],
      "odiNumbers": [
        "11341754"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Door and Window Assembly Issues",
      "impact": "The exit door getting stuck and window valances breaking loose can cause inconvenience, safety hazards, and damage to the trailer.",
      "symptoms": [
        "Exit door gets stuck",
        "window valances break loose and hang down."
      ],
      "odiNumbers": [
        "11341754"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 7,
      "issueCategory": "Electrical System Failures",
      "impact": "The circuit breaker panel falling out of the wall and electric brake wires falling out of their splices can cause electrical shocks, fires, or accidents.",
      "symptoms": [
        "Circuit breaker panel falls out of the wall",
        "electric brake wires fall out of their splices."
      ],
      "odiNumbers": [
        "11341754"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 8,
      "issueCategory": "Inadequate Mounting of Appliances and Components",
      "impact": "The microwave breaking loose from its mounting screws and the sink falling down due to inadequate mounting can cause damage to the appliances, the trailer's interior, and potentially lead to injuries or accidents.",
      "symptoms": [
        "Microwave breaks loose from its mounting screws",
        "sink falls down due to inadequate mounting."
      ],
      "odiNumbers": [
        "11341754"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}