{
  "totalComplaints": 12,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "EQUIPMENT",
    "SUSPENSION",
    "STRUCTURE"
  ],
  "parsedComplaintsResultLength": 4,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Propane Flow Issue and Recall Repair Delays",
      "impact": "The propane flow issue can cause the stove, heater, and refrigerator to malfunction, leading to inconvenience, discomfort, and potential safety risks. The delay in recall repair can exacerbate the problem, leaving owners without a functioning appliance.",
      "symptoms": [
        "Stove and heater not functioning",
        "propane gas flow stops",
        "low fuel pressure",
        "warning lights flashing."
      ],
      "odiNumbers": [
        "11491620",
        "11458876",
        "11428785"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Parts Distribution Disconnect and Recall Repair Delays",
      "impact": "The delay in receiving recall repair parts can cause inconvenience, discomfort, and potential safety risks for owners, as they are left without a functioning appliance.",
      "symptoms": [
        "None",
        "as owners have not experienced a failure",
        "but are waiting for recall repair parts."
      ],
      "odiNumbers": [
        "11430757",
        "11429907",
        "11428875",
        "11428368",
        "11427877",
        "11425141"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Leaf Spring Support Bracket Failure",
      "impact": "The failure of the leaf spring support brackets can cause the rear axle to shift, leading to uneven tire wear, loss of vehicle control, and potentially catastrophic accidents, especially when towing a trailer.",
      "symptoms": [
        "Inside tire wear on the rear tires",
        "rear axle shifted to one side",
        "leaf spring support brackets separated from the frame."
      ],
      "odiNumbers": [
        "11442459"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Cargo Carrier Hitch Failure",
      "impact": "The sudden failure of the cargo carrier hitch can cause the trailer and cargo to detach from the vehicle while in motion, leading to a loss of control, accidents, and potential damage to property or injury to occupants.",
      "symptoms": [
        "The hitch to the cargo carrier fractures without warning",
        "the trailer and cargo carrier are not securely attached to the vehicle",
        "the generator",
        "trailer",
        "and cargo carrier become detached from the vehicle while driving."
      ],
      "odiNumbers": [
        "11362912"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}