{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "UNKNOWN OR OTHER",
    "POWER TRAIN",
    "AIR BAGS",
    "EQUIPMENT"
  ],
  "parsedComplaintsResultLength": 11,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Front Parking Aid Sensor Malfunction",
      "impact": "The malfunctioning front parking aid sensors can cause the driver to be unaware of objects in front of the vehicle while parking, increasing the risk of accidents or damage to the vehicle.",
      "symptoms": [
        "The front parking aid sensors do not alert the driver to objects in front of the vehicle while parking forward",
        "requiring the driver to back up and then move forward again to trigger the sensors."
      ],
      "odiNumbers": [
        "11581979"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Ground Stud Failure Causing Electrical Power Loss",
      "impact": "The failure of the ground stud can cause a complete loss of electrical power while driving, leading to a loss of control and increasing the risk of accidents.",
      "symptoms": [
        "Complete loss of electrical power",
        "including loss of power to essential systems",
        "while driving or stopped at a stoplight."
      ],
      "odiNumbers": [
        "11581590"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Hatch Malfunction",
      "impact": "The sudden opening of the rear hatch while driving can cause a loss of control, accidents, or injury to occupants or pedestrians.",
      "symptoms": [
        "The rear hatch opens unexpectedly while driving or in a parking lot",
        "causing a potential safety hazard."
      ],
      "odiNumbers": [
        "11531771"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Windshield Seal Failure",
      "impact": "Water ingress through the windshield seal can cause electrical system failures, corrosion, and mold growth, leading to safety hazards, damage to components, and potential long-term reliability issues.",
      "symptoms": [
        "Water dripping from screw holes in the lighting and headliner",
        "water accumulation in the drive selector and electronics",
        "saturated headliner",
        "and potential mold growth."
      ],
      "odiNumbers": [
        "11443730"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Electrical System Failure",
      "impact": "The failure of the electrical system can cause the vehicle to stall or shut off while in motion, leading to a loss of control and increased risk of accidents. It can also cause the vehicle's safety features to be disabled, further compromising the driver's safety.",
      "symptoms": [
        "Warning lights illuminate on the dashboard",
        "including traction control and engine warning lights; the vehicle stalls or shuts off while in motion; the vehicle's safety features are disabled; the gear shifter blinks or becomes stuck in a particular gear; the transmission fails to engage properly; the tachometer becomes stuck on a certain RPM."
      ],
      "odiNumbers": [
        "11489510",
        "11415107"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Ground Wire Issue",
      "impact": "A loose or improperly secured ground wire can cause electrical system failures, leading to vehicle stalling or shutdown, and increased risk of accidents.",
      "symptoms": [
        "Vehicle warning lights come on",
        "including traction control and engine warning lights; the vehicle stalls or shuts off while in motion; the vehicle's safety features are disabled."
      ],
      "odiNumbers": [
        "11489510",
        "11415107"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Auto Start/Stop System Malfunction",
      "impact": "The malfunction of the auto start/stop system can cause the vehicle to stall or shut off while in motion, leading to a loss of control and increased risk of accidents.",
      "symptoms": [
        "The auto start/stop system activates while driving",
        "causing the vehicle to stall or shut off; warning lights illuminate on the dashboard; the gear shifter blinks or becomes stuck in a particular gear; the transmission fails to engage properly."
      ],
      "odiNumbers": [
        "11415107"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Passenger Airbag Sensor Malfunction",
      "impact": "A faulty passenger airbag sensor can lead to the airbag failing to deploy in the event of a crash, increasing the risk of injury or fatality to the passenger.",
      "symptoms": [
        "The passenger airbag warning light is illuminated on the dashboard",
        "the airbag system warning light is illuminated on the dashboard",
        "the passenger airbag is not deploying in a crash",
        "the passenger airbag is deploying unnecessarily."
      ],
      "odiNumbers": [
        "11584370"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Infotainment System and Electrical System Failure",
      "impact": "The failure of the infotainment system and electrical system can cause the navigation system to malfunction, leading to driver distraction and potentially increasing the risk of accidents. The failure to start the vehicle can leave the driver stranded, especially in remote areas.",
      "symptoms": [
        "The navigation system screen goes blank",
        "the vehicle randomly fails to start",
        "the Land Rover logo appears on the screen",
        "the battery warning light flashes",
        "and all warning lights are illuminated."
      ],
      "odiNumbers": [
        "11549604"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Battery and Electrical System Failure",
      "impact": "The failure of the battery and electrical system can cause the vehicle to fail to start, leaving the driver stranded, and potentially leading to accidents or other safety risks.",
      "symptoms": [
        "The battery warning light flashes",
        "and all warning lights are illuminated."
      ],
      "odiNumbers": [
        "11549604"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Software Update Issues",
      "impact": "The failure of software updates can cause the vehicle's systems to malfunction, leading to driver distraction and potentially increasing the risk of accidents.",
      "symptoms": [
        "The vehicle's systems fail to function properly after a software update",
        "and the dealer is unable to determine the failure."
      ],
      "odiNumbers": [
        "11549604"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}