{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "SERVICE BRAKES",
    "TIRES",
    "FUEL/PROPULSION SYSTEM",
    "STRUCTURE"
  ],
  "parsedComplaintsResultLength": 9,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Shifter Failure due to Snow/Slush Ingress",
      "impact": "The failure of the transmission shifter can cause the vehicle to become stuck in gear, making it difficult or impossible to shift, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "Unable to shift transmission from D to another position like R",
        "P",
        "N",
        "vehicle can only drive forward",
        "unable to turn off the engine or restart the vehicle in gear."
      ],
      "odiNumbers": [
        "11459426"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Throttle Body Sticking Wide Open",
      "impact": "The throttle body sticking wide open can cause the vehicle to accelerate uncontrollably, leading to a loss of control and increasing the risk of accidents.",
      "symptoms": [
        "Throttle body gets stuck wide open after the engine reaches operating temperature",
        "warning signs include on-off throttle use",
        "no error codes displayed."
      ],
      "odiNumbers": [
        "11455361"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Brake Pedal Softness and Transmission Gear Confusion",
      "impact": "The soft brake pedal can lead to extended stopping distances, increasing the risk of accidents, while the transmission's inability to select the correct gear can cause loss of control and accidents.",
      "symptoms": [
        "Brake pedal feels soft",
        "requires both feet on the brake pedal to stop",
        "transmission has difficulty selecting the correct gear",
        "resulting in poor fuel economy."
      ],
      "odiNumbers": [
        "11455361"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Diesel Exhaust Fluid (DEF) Heater Failure",
      "impact": "The failure of the DEF heater can cause the vehicle to operate at reduced speeds, increasing the risk of accidents, and can lead to engine damage.",
      "symptoms": [
        "DEF light and check engine light illuminated on the dashboard",
        "error code \"P20C1 Reductant Heater C Control Circuit/OPEN\" displayed",
        "vehicle speed limited to 55MPH or lower."
      ],
      "odiNumbers": [
        "11454519"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Brake Failure with Soft Pedal and Loss of Stopping Power",
      "impact": "The sudden failure of the brakes can lead to accidents, injuries, or fatalities, especially when the vehicle is unable to stop or slow down, leaving the driver with no control over the vehicle.",
      "symptoms": [
        "The brake pedal feels soft or spongy",
        "the brake pedal goes to the floor",
        "the vehicle is unable to stop or slow down",
        "the vehicle rolls backwards or moves unexpectedly",
        "the brake pedal must be pumped to get the vehicle to stop."
      ],
      "odiNumbers": [
        "11584171",
        "11438295"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Parking Brake System Failure",
      "impact": "The failure of the parking brake system can cause the vehicle to roll or move unexpectedly, leading to accidents or injuries, especially when the brakes fail simultaneously.",
      "symptoms": [
        "The parking brake warning message appears on the dashboard",
        "the parking brake does not engage",
        "the vehicle rolls or moves unexpectedly when the brakes fail."
      ],
      "odiNumbers": [
        "11584171"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "ABS System Failure",
      "impact": "The failure of the ABS system can cause the vehicle to lose traction and stability, leading to accidents or injuries, especially when the brakes fail simultaneously.",
      "symptoms": [
        "The myGMC app notifies the driver of the need to service the ABS system",
        "the vehicle exhibits unusual vibrations or noises when driving."
      ],
      "odiNumbers": [
        "11584171"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Tire Separation and Blowout",
      "impact": "The sudden separation and blowout of a tire can cause loss of vehicle control, leading to accidents, injuries, or fatalities. Additionally, the damage to the vehicle's body and potential for subsequent tire failures can result in costly repairs and downtime.",
      "symptoms": [
        "Sudden and unexpected tire blowout",
        "loss of vehicle control",
        "difficulty steering",
        "tire separation",
        "damage to vehicle body and surrounding components."
      ],
      "odiNumbers": [
        "11523697"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Tailgate Latch Failure",
      "impact": "The sudden opening of the tailgate while driving can cause cargo to shift or fall out, obstructing the road and potentially causing accidents or injuries to other drivers or pedestrians.",
      "symptoms": [
        "The tailgate opens unexpectedly while driving",
        "the tailgate does not stay closed",
        "the tailgate latch feels loose or weak",
        "the tailgate makes a rattling or clunking noise while driving."
      ],
      "odiNumbers": [
        "11446957"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}