{
  "totalComplaints": 73,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "FORWARD COLLISION AVOIDANCE",
    "ELECTRICAL SYSTEM",
    "POWER TRAIN",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 13,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Erroneous Activation of Forward Collision Mitigation System",
      "impact": "The system's false activation can cause sudden and unexpected braking, leading to a loss of control, accidents, and potential injuries or fatalities.",
      "symptoms": [
        "The vehicle's forward collision mitigation system activates unnecessarily",
        "causing the brakes to engage suddenly",
        "often without warning",
        "and sometimes accompanied by a loud alarm or flashing lights. This can occur when driving on straight roads",
        "curves",
        "or when approaching intersections",
        "and may be triggered by oncoming traffic",
        "road signs",
        "or other environmental factors."
      ],
      "odiNumbers": [
        "11584192",
        "11583971",
        "11584159",
        "11583701",
        "11583718",
        "11577045",
        "11532077",
        "11529316",
        "11523966",
        "11500844",
        "11491201",
        "11488424",
        "11462717",
        "11460787",
        "11414260"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inadequate Response to False Activations",
      "impact": "The failure of dealerships and manufacturers to address these issues can lead to continued risk of accidents and injuries, as well as frustration and mistrust among vehicle owners.",
      "symptoms": [
        "Dealerships and manufacturers may not take adequate action to address the issue",
        "claiming that the system is functioning as designed or that the problem is due to user error. They may not provide a permanent fix or recall",
        "leaving owners to continue experiencing the problem."
      ],
      "odiNumbers": [
        "11529316",
        "11488424",
        "11414260"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Unintended Braking and Forward Collision Warning",
      "impact": "The unintended braking and false forward collision warnings can cause sudden stops, leading to rear-end collisions, and potentially resulting in accidents or injuries.",
      "symptoms": [
        "The forward collision warning comes on for no reason",
        "brakes are applied unexpectedly",
        "the vehicle nearly comes to a stop",
        "and the CMBS lights remain permanently on."
      ],
      "odiNumbers": [
        "11583738",
        "11583623"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Audio System Malfunction",
      "impact": "The audio system malfunction can cause distractions while driving, leading to accidents or near-misses, and can also impact the functionality of other safety features like the backup camera and lane-keeping assist.",
      "symptoms": [
        "The speakers or radio crackle and make static noises",
        "music cuts out",
        "and the system becomes unusable."
      ],
      "odiNumbers": [
        "11536295",
        "11477255",
        "11416499"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Auto Engine Idle Restart Failure",
      "impact": "The failure of the auto engine idle restart system can cause the vehicle to stall in traffic, leading to accidents or near-misses, and can also put the driver and passengers at risk.",
      "symptoms": [
        "The vehicle fails to restart after coming to a complete stop",
        "requires manual restart",
        "and has been slow to restart many times."
      ],
      "odiNumbers": [
        "11533062",
        "11528172"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Instrument Panel and Display Failure",
      "impact": "The instrument panel and display failure can cause distractions while driving, leading to accidents or near-misses, and can also impact the driver's ability to access important vehicle information.",
      "symptoms": [
        "The entire dash goes blank",
        "speedometer",
        "warnings",
        "and display disappear",
        "and the system takes time to recover."
      ],
      "odiNumbers": [
        "11520930",
        "11436749"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Transmission and Shifter Malfunction",
      "impact": "The transmission and shifter malfunction can cause the vehicle to become stuck in park, leading to accidents or near-misses, and can also cause inconvenience and delay.",
      "symptoms": [
        "The vehicle is unable to shift out of park",
        "the push-button electronic shifter is rendered useless",
        "and warning lights for the transmission and blind spot systems appear."
      ],
      "odiNumbers": [
        "11474731"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Failure",
      "impact": "The failure of the transmission can cause the vehicle to decelerate or accelerate unexpectedly, leading to loss of control, accidents, or leaving the driver stranded.",
      "symptoms": [
        "The vehicle independently decelerates or accelerates",
        "the engine revs",
        "and the RPMs increase",
        "the vehicle fails to respond with the accelerator pedal depressed",
        "the transmission shifts into neutral or low gear on its own",
        "the transmission makes a grinding noise",
        "the dashboard displays a \"Transmission Problem\" message."
      ],
      "odiNumbers": [
        "11499256",
        "11498892",
        "11490754",
        "11459260",
        "11456572",
        "11440641",
        "11422638",
        "11422348"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Transmission Slipping or Harsh Shifting",
      "impact": "The transmission slipping or harsh shifting can cause the vehicle to lose traction, leading to accidents or loss of control.",
      "symptoms": [
        "The transmission slips or harshly shifts",
        "the vehicle accelerates or decelerates unexpectedly",
        "the transmission makes a grinding noise."
      ],
      "odiNumbers": [
        "11499256",
        "11456572",
        "11422348",
        "11394358"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Transmission Error Messages and Failure to Engage Gears",
      "impact": "The transmission error messages and failure to engage gears can cause the vehicle to become stuck in neutral or fail to respond to the accelerator pedal, leading to loss of control or accidents.",
      "symptoms": [
        "The dashboard displays a \"Transmission Problem\" message",
        "the transmission fails to engage gears",
        "the vehicle shifts into neutral or low gear on its own",
        "the vehicle fails to respond with the accelerator pedal depressed."
      ],
      "odiNumbers": [
        "11498892",
        "11490754",
        "11440641",
        "11422638"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Safety Hazard due to Seat Belt Sensor Design",
      "impact": "The seat belt sensor design can cause the vehicle to move forward or backward unexpectedly, creating a serious safety hazard.",
      "symptoms": [
        "The vehicle fails to automatically shift into park when the driver exits the vehicle without taking it out of drive",
        "reverse",
        "or neutral",
        "the vehicle moves forward or backward unexpectedly."
      ],
      "odiNumbers": [
        "11398931"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Unintended Braking and Brake System Failure",
      "impact": "The unintended application of the brakes can cause sudden stops, potentially leading to accidents, injuries, or fatalities. Additionally, brake system failures can result in the loss of vehicle control, increasing the risk of crashes.",
      "symptoms": [
        "The vehicle suddenly brakes or slows down without warning",
        "the brake pedal feels stiff or hard",
        "the brake pedal does not respond or engage",
        "the vehicle surges forward without warning",
        "the brake warning light illuminates on the dashboard",
        "the steering wheel shakes or vibrates."
      ],
      "odiNumbers": [
        "11583595",
        "11583134",
        "11577349",
        "11576758",
        "11496899",
        "11472223",
        "11448988",
        "11406823"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "False Collision Detection and Erroneous Brake Activation",
      "impact": "The false detection of collisions or obstacles can cause the vehicle to brake unnecessarily, leading to sudden stops, accidents, or injuries. This can also lead to a loss of trust in the vehicle's safety features.",
      "symptoms": [
        "The vehicle's collision warning system or brake display light activates without an actual obstacle or hazard",
        "the vehicle brakes or slows down unnecessarily",
        "the driver's side mirror warning system activates without an actual obstacle."
      ],
      "odiNumbers": [
        "11583134",
        "11577349",
        "11576758",
        "11472223"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}