{
  "totalComplaints": 22,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "SERVICE BRAKES",
    "ELECTRICAL SYSTEM",
    "UNKNOWN OR OTHER",
    "POWER TRAIN"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Brake Hydraulic System Failure",
      "impact": "The failure of the brake hydraulic system can cause the brakes to grab suddenly, leading to sudden stops, accidents, or loss of control, which can result in injuries or fatalities.",
      "symptoms": [
        "The brakes grab suddenly during low-speed braking",
        "the brakes lock up when coming to a stop at higher speeds",
        "the vehicle lunges forward when the brake pedal is depressed",
        "the brake pedal fails to respond",
        "the brake fluid low warning light fails to illuminate."
      ],
      "odiNumbers": [
        "11525206",
        "11497775",
        "11470394"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Delayed Recall Repair",
      "impact": "The delay in recall repair can leave the vehicle in an unsafe condition, increasing the risk of accidents or injuries.",
      "symptoms": [
        "The vehicle is subject to a recall",
        "but the parts are not available",
        "the manufacturer has exceeded a reasonable amount of time for the recall repair."
      ],
      "odiNumbers": [
        "11553004"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Evaporative Emission System Failure",
      "impact": "The failure of the evaporative emission system can cause the check engine light to illuminate, leading to decreased fuel efficiency and potentially causing damage to the vehicle's engine and emissions system.",
      "symptoms": [
        "The check engine light comes on",
        "the vehicle throws codes related to the evaporative emission system",
        "the vehicle may experience decreased fuel efficiency."
      ],
      "odiNumbers": [
        "11561274"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Delayed Recall Repair for Electrical System",
      "impact": "The delay in repairing the electrical system recall can lead to potential safety risks, including increased risk of a crash, due to the brake system warning indicator not illuminating when the brake fluid is depleted.",
      "symptoms": [
        "The brake system warning indicator may not illuminate when the brake fluid is below the recommended level",
        "the vehicle may experience brake system failure."
      ],
      "odiNumbers": [
        "11558588",
        "11558589"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Infotainment System Failure",
      "impact": "The failure of the infotainment system can cause the rearview camera to malfunction, leading to safety concerns when reversing or parking the vehicle.",
      "symptoms": [
        "The rearview camera is not working",
        "the infotainment display freezes",
        "the entire infotainment system is inoperable until the next ignition cycle."
      ],
      "odiNumbers": [
        "11548399"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Advanced Driver-Assistance System (ADAS) Failure",
      "impact": "The failure of ADAS features, such as lane departure warning and blind spot monitoring, can increase the risk of accidents and injuries.",
      "symptoms": [
        "Lane departure warning and blind spot monitoring systems fail to function",
        "leading to accidents or near-miss incidents."
      ],
      "odiNumbers": [
        "11479487"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Driver Assist System Malfunction",
      "impact": "The malfunction of the driver assist system can cause the vehicle to surge forward unexpectedly, leading to accidents or near-miss incidents, especially in slow traffic scenarios.",
      "symptoms": [
        "The engine revs uncontrollably and inconsistently when releasing the brake pedal",
        "causing the vehicle to accelerate unexpectedly",
        "especially when driving in slow traffic scenarios."
      ],
      "odiNumbers": [
        "11441741"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Failure and Erratic Shifting",
      "impact": "The transmission failure and erratic shifting can cause loss of power, sudden acceleration, and jerky movements, which can lead to accidents, especially at low speeds or when merging onto highways.",
      "symptoms": [
        "The vehicle acts like it's in neutral",
        "surges when trying to accelerate",
        "loses power",
        "and smoke billows from under the car. The transmission shifts erratically",
        "goes into limp mode",
        "and hesitates or stumbles in most gears. The vehicle lunges forward or bucks at low speeds",
        "making it difficult to control."
      ],
      "odiNumbers": [
        "11509876",
        "11499594",
        "11492196"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Valve Body Failure",
      "impact": "The failure of the valve body can cause the transmission to malfunction, leading to erratic shifting, loss of power, and sudden acceleration, which can increase the risk of accidents.",
      "symptoms": [
        "The transmission shifts extremely hard",
        "feels like running over something or getting rear-ended",
        "and hesitates or stumbles in most gears."
      ],
      "odiNumbers": [
        "11509876"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Failure to Diagnose and Repair Transmission Issues",
      "impact": "The failure to diagnose and repair transmission issues can lead to repeated problems, increased risk of accidents, and decreased confidence in the vehicle's safety and performance.",
      "symptoms": [
        "Dealerships fail to diagnose and repair transmission issues",
        "leading to repeated visits and continued problems with erratic shifting",
        "loss of power",
        "and sudden acceleration."
      ],
      "odiNumbers": [
        "11509876",
        "11499594",
        "11492196"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}