{
  "totalComplaints": 41,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "UNKNOWN OR OTHER",
    "POWER TRAIN",
    "ELECTRICAL SYSTEM"
  ],
  "parsedComplaintsResultLength": 15,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Engine Stalling",
      "impact": "The sudden stalling of the engine can cause loss of control, accidents, or leave the driver stranded.",
      "symptoms": [
        "The vehicle begins to chug like it's going to stop",
        "then goes back to driving normally; the vehicle suddenly stops in the middle of the highway."
      ],
      "odiNumbers": [
        "11584876",
        "11525290"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Instrument Cluster Display Issues",
      "impact": "The malfunctioning instrument cluster display can cause the driver to be unaware of important safety warnings, mileage, and digital speedometer information, which can lead to accidents or other safety issues.",
      "symptoms": [
        "The screen behind the steering wheel gets streaky and becomes unreadable."
      ],
      "odiNumbers": [
        "11581448"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Hill Assist System Failure",
      "impact": "The failure of the hill assist system can cause the vehicle to roll back, which can lead to accidents or injuries.",
      "symptoms": [
        "The hill assist system does not activate",
        "causing the vehicle to roll back."
      ],
      "odiNumbers": [
        "11510419"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Auto Stop/Start System Issues",
      "impact": "The auto stop/start system can cause a delay in the vehicle's response to the driver's input, which can lead to accidents or near-misses.",
      "symptoms": [
        "The engine shuts off at every stop",
        "even in traffic conditions where it may not be safe; the engine restarts with a thump; the vehicle lurches forward if the foot is not firm on the brake."
      ],
      "odiNumbers": [
        "11503391",
        "11491398"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Infotainment System Glitches",
      "impact": "The malfunctioning infotainment system can cause distractions, inconvenience, and potentially lead to safety issues.",
      "symptoms": [
        "The SD card removal message appears multiple times; the radio stops working; the phone is not connected to the car; the station is identified",
        "but the radio does not work."
      ],
      "odiNumbers": [
        "11469809"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Vehicle Vibration",
      "impact": "The vibration of the vehicle can cause loss of control, accidents, or discomfort for the driver and passengers.",
      "symptoms": [
        "The front end of the vehicle shakes at 25-30 mph",
        "but the vibration goes away after 30 mph."
      ],
      "odiNumbers": [
        "11457665"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 7,
      "issueCategory": "Steering and Lane Departure Issues",
      "impact": "The malfunctioning steering and lane departure system can cause loss of control, accidents, or injuries.",
      "symptoms": [
        "The vehicle starts swaying towards the left",
        "especially on the freeway; the tech screen issue shows a flashing green warning when there is no vehicle ahead."
      ],
      "odiNumbers": [
        "11397643"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission/Drivetrain Failure",
      "impact": "The failure of the transmission or drivetrain can cause the vehicle to hesitate, shudder, or lose power, leading to accidents or stranding the driver.",
      "symptoms": [
        "The vehicle shudders significantly",
        "hesitates to respond",
        "or loses power while driving; the vehicle fails to go into park; the vehicle lurches forward unexpectedly."
      ],
      "odiNumbers": [
        "11544483",
        "11508853",
        "11422780"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electrical System Failure",
      "impact": "The failure of the electrical system can cause the vehicle to shut down, lose power, or experience electrical malfunctions, leading to accidents or stranding the driver.",
      "symptoms": [
        "The vehicle shuts down while in operation; the vehicle fails to start; electrical systems remain on despite the vehicle being shut off; warning lights illuminate on the dashboard."
      ],
      "odiNumbers": [
        "11508853",
        "11442734"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Fuel System Failure",
      "impact": "The failure of the fuel system can cause the vehicle to stall, lose power, or experience engine problems, leading to accidents or fires.",
      "symptoms": [
        "The vehicle stalls or shuts down while in operation; the vehicle fails to start; a solid check engine light illuminates; the fuel pump flow issue causes cars to stall and not turn on."
      ],
      "odiNumbers": [
        "11506709"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Braking System Failure",
      "impact": "The failure of the braking system can cause the vehicle to lose braking ability, leading to accidents or injuries.",
      "symptoms": [
        "The braking system becomes impossible to use while operating; the vacuum pump fails",
        "affecting braking performance."
      ],
      "odiNumbers": [
        "11495225"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Engine Performance Issues",
      "impact": "The failure of the engine performance can cause the vehicle to lose power, hesitate, or experience reduced engine performance, leading to accidents or stranding the driver.",
      "symptoms": [
        "The engine power is reduced; the vehicle hesitates or loses power; the turbocharger overboost warning illuminates."
      ],
      "odiNumbers": [
        "11442734"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Infotainment System Malfunction",
      "impact": "The malfunction of the infotainment system can cause distractions while driving, leading to accidents, and can also result in the loss of important vehicle functions such as navigation and climate control.",
      "symptoms": [
        "The touch screen display goes black",
        "the touch screen display does not show GPS information",
        "the instrument panel does not display readings",
        "the SD card error message appears",
        "the radio turns on at maximum volume",
        "the backup camera remains on",
        "and the infotainment center becomes unresponsive."
      ],
      "odiNumbers": [
        "11570610",
        "11536337"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electrical System Failure",
      "impact": "The failure of the electrical system can cause unexpected shutdowns, loss of critical vehicle functions, and potentially lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The vehicle fails to restart",
        "multiple warning messages appear on the dashboard",
        "the vehicle shuts down while driving",
        "the power locks malfunction",
        "and the radio cuts off."
      ],
      "odiNumbers": [
        "11457275",
        "11451627",
        "11448338"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Body Control Module (BCM) Failure",
      "impact": "The failure of the BCM can cause a range of electrical system malfunctions, leading to unexpected shutdowns, loss of critical vehicle functions, and potentially leading to accidents or leaving the driver stranded.",
      "symptoms": [
        "Multiple warning messages appear on the dashboard",
        "the vehicle fails to restart",
        "and the side detection system becomes inoperable."
      ],
      "odiNumbers": [
        "11457275"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}