{
  "totalComplaints": 13,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "STEERING",
    "POWER TRAIN",
    "UNKNOWN OR OTHER",
    "ENGINE",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Unstable Steering",
      "impact": "Unstable steering can cause the vehicle to swerve or lose control, increasing the risk of accidents and injuries.",
      "symptoms": [
        "The vehicle tries to steer into oncoming traffic",
        "the steering wheel requires moderate force to keep the vehicle in its lane",
        "the lane assist icon changes color or flashes."
      ],
      "odiNumbers": [
        "11512905"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Steering Noise and Failure",
      "impact": "Steering noise and failure can cause loss of control, accidents, and injuries.",
      "symptoms": [
        "Scraping and squealing noise from under the front right tire",
        "loud spring noise",
        "tire and wheel jerk",
        "front right brake seems to be locked",
        "steering wheel makes more noise when turned."
      ],
      "odiNumbers": [
        "11495434"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Lack of Steering Column Lock",
      "impact": "The lack of a steering column lock can make the vehicle more susceptible to theft and vandalism, potentially causing damage to the vehicle.",
      "symptoms": [
        "No alarm goes off when someone breaks into the car",
        "the steering column is damaged or destroyed."
      ],
      "odiNumbers": [
        "11480234"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Unintended Vehicle Movement",
      "impact": "The vehicle can move unintentionally, even when the transmission is in Park, which can cause accidents, injuries, or fatalities, especially if there are people or objects in the vehicle's path.",
      "symptoms": [
        "The vehicle moves forward or backward without the driver's input",
        "even when the transmission is in Park",
        "the vehicle accelerates unexpectedly",
        "the vehicle fails to respond to the driver's inputs."
      ],
      "odiNumbers": [
        "11555136"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Sudden Loss of Power",
      "impact": "The sudden loss of power can cause the vehicle to stall or lose speed, which can increase the risk of accidents, especially when driving on highways or uphill.",
      "symptoms": [
        "The vehicle loses power or acceleration",
        "the vehicle struggles to climb hills",
        "the vehicle's speed is significantly reduced",
        "the vehicle's engine RPMs fluctuate or drop."
      ],
      "odiNumbers": [
        "11491460"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Wind Noise from Driver's Side B-Pillar",
      "impact": "The annoying wind noise can be a distraction to the driver, potentially affecting their focus on the road and increasing the risk of accidents.",
      "symptoms": [
        "A \"flapping\" noise is heard from the driver's side B-pillar at speeds over 20 miles per hour",
        "similar to a bag or piece of paper blowing in the wind."
      ],
      "odiNumbers": [
        "11513877"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Over-Sensitive Lighting Control Lever",
      "impact": "The overly sensitive lighting control lever can cause the headlights to turn off unexpectedly, reducing visibility and increasing the risk of accidents, especially at night or in low-light conditions.",
      "symptoms": [
        "When switching from high beams to low beams",
        "the lighting control lever twists and turns off the headlights entirely",
        "rather than just dimming them. This is more likely to occur for drivers with shorter fingers who cannot reach the base of the lever."
      ],
      "odiNumbers": [
        "11500633"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Throttle Body Failure",
      "impact": "The failure of the throttle body can cause a loss of acceleration, leading to a potential loss of control, accidents, or stranding the driver. This issue can also trigger the check engine light, indicating a serious problem.",
      "symptoms": [
        "Sudden loss of acceleration",
        "inability to accelerate",
        "check engine light illumination",
        "vehicle stalling or hesitation."
      ],
      "odiNumbers": [
        "11459319",
        "11446051",
        "11327498",
        "10734988",
        "10650766",
        "10588926",
        "10585118",
        "10567062",
        "10565141",
        "10561132"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Unintended Brake Activation",
      "impact": "Unintended brake activation can cause the vehicle to slow down or come to a sudden stop, increasing the risk of accidents, especially when trying to avoid collisions or merging into traffic.",
      "symptoms": [
        "The vehicle fails to move forward despite releasing the brake pedal and pressing the gas pedal",
        "the vehicle slows down or stops unexpectedly",
        "the brake pedal feels like it's still being applied even after releasing it."
      ],
      "odiNumbers": [
        "11426082"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Brake System Failure",
      "impact": "Brake system failure can lead to a loss of vehicle control, increasing the risk of accidents, injuries, and fatalities.",
      "symptoms": [
        "The vehicle fails to reduce speed effectively",
        "the vehicle turns widely or erratically",
        "the vehicle collides with objects or other vehicles."
      ],
      "odiNumbers": [
        "11448123"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}