{
  "totalComplaints": 15,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "POWER TRAIN",
    "ELECTRICAL SYSTEM",
    "STEERING"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Transmission Shuddering or Vibration",
      "impact": "The transmission shuddering or vibration can cause the vehicle to lose traction, leading to a loss of control, especially when driving uphill or around corners, which can increase the risk of accidents.",
      "symptoms": [
        "The vehicle shakes or vibrates when accelerating from a stop",
        "especially between 35-45 mph or 45-60 mph",
        "the steering wheel shakes",
        "the vehicle feels like it's losing traction",
        "the transmission shudders or vibrates when shifting gears."
      ],
      "odiNumbers": [
        "11548782",
        "11434563",
        "11425716"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Erratic Transmission Shifts",
      "impact": "The erratic transmission shifts can cause the vehicle to unexpectedly shift into reverse or neutral, which can lead to accidents or loss of control.",
      "symptoms": [
        "The vehicle inadvertently shifts into reverse or neutral",
        "the gear shift selector is stuck in park (P) position",
        "the instrument panel displays the wrong gear",
        "the vehicle hesitates or jerks when shifting gears."
      ],
      "odiNumbers": [
        "11457737"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Brake Noise and Grinding",
      "impact": "The squeaking and grinding noise from the rear brakes can indicate worn-out brake pads or other brake component failures, which can lead to reduced stopping power and increased risk of accidents.",
      "symptoms": [
        "Squeaking or grinding noise from the rear brakes when backing up."
      ],
      "odiNumbers": [
        "11490163"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Infotainment System Failure",
      "impact": "The intermittent failure of the infotainment system can cause distractions while driving, leading to accidents, and may also indicate a underlying electrical or software issue.",
      "symptoms": [
        "The information screen or radio screen goes black for a few seconds or several minutes",
        "Bluetooth connectivity issues."
      ],
      "odiNumbers": [
        "11447976",
        "11490163"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Keyless Entry System Failure",
      "impact": "The failure of the keyless entry system can lead to unintended vehicle operation, potentially causing accidents or leaving the driver stranded, and may also compromise vehicle security.",
      "symptoms": [
        "The vehicle can be driven without the key fob present",
        "no warning message or indication that the remote is not in the car",
        "the vehicle does not shut off even when the key fob is not present."
      ],
      "odiNumbers": [
        "11442208"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Transmission Slipping and Delayed Engagement",
      "impact": "The transmission slipping and delayed engagement can cause loss of vehicle control, accidents, and unexpected movements, which can lead to serious safety risks.",
      "symptoms": [
        "The vehicle revs to high RPMs",
        "the steering wheel jerks or moves unexpectedly",
        "the vehicle hesitates or delays engaging into gear",
        "the vehicle fails to move when the accelerator pedal is pressed",
        "the infotainment screen blacks out and twitches."
      ],
      "odiNumbers": [
        "11574021"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Electronic Control Module (ECM) Failure",
      "impact": "The failure of the ECM can cause a range of issues, including transmission problems, electrical system malfunctions, and loss of vehicle control, which can lead to accidents and safety risks.",
      "symptoms": [
        "The infotainment screen blacks out and twitches",
        "the vehicle's electrical systems malfunction",
        "the transmission slips or hesitates",
        "the vehicle's engine revs to high RPMs."
      ],
      "odiNumbers": [
        "11574021"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Steering System Malfunction",
      "impact": "The steering system malfunction can cause loss of vehicle control, accidents, and unexpected movements, which can lead to serious safety risks.",
      "symptoms": [
        "The steering wheel jerks or moves unexpectedly",
        "the vehicle is difficult to steer",
        "the vehicle pulls to one side."
      ],
      "odiNumbers": [
        "11574021"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}