{
  "totalComplaints": 73,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "FORWARD COLLISION AVOIDANCE",
    "SERVICE BRAKES",
    "VEHICLE SPEED CONTROL"
  ],
  "parsedComplaintsResultLength": 9,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Phantom Braking due to Faulty Automatic Emergency Braking System",
      "impact": "The sudden and unexpected braking of the vehicle can cause accidents, injuries, or fatalities, especially if there are vehicles behind the affected car. This issue can also lead to a loss of control, rear-end collisions, or other accidents.",
      "symptoms": [
        "The vehicle suddenly brakes or decelerates without warning",
        "often with no obstacles or vehicles in front of it. The dashboard may display a \"BRAKE\" warning light",
        "and the brakes may apply forcefully",
        "even when there is no apparent danger."
      ],
      "odiNumbers": [
        "11587679",
        "11585702",
        "11585109",
        "11583739",
        "11583886",
        "11578582",
        "11570041",
        "11564286",
        "11558801",
        "11558222",
        "11555966",
        "11552273",
        "11533811",
        "11508403",
        "11496889",
        "11484491",
        "11483667",
        "11481458",
        "11478012",
        "11473533",
        "11455515"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Rear Brake Noise and Failure",
      "impact": "The rear brake noise and failure can lead to a loss of braking performance, increasing the risk of accidents and injuries.",
      "symptoms": [
        "Squealing or grinding noise from the rear brakes",
        "especially when reversing; brakes may not respond or fail to engage; error lights on the dashboard related to the brakes",
        "forward collision warning",
        "and emergency braking."
      ],
      "odiNumbers": [
        "11559089",
        "11553383",
        "11506396"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Brake System Failure",
      "impact": "The brake system failure can cause a loss of braking performance, increasing the risk of accidents and injuries.",
      "symptoms": [
        "Brakes may not respond or fail to engage; error lights on the dashboard related to the brakes",
        "forward collision warning",
        "and emergency braking; abnormal",
        "rattling",
        "or screeching sounds from the brake pedal."
      ],
      "odiNumbers": [
        "11533026",
        "11531303",
        "11502649"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Unintended Automatic Braking Activation",
      "impact": "The unintended activation of the automatic braking system can increase the risk of rear-end collisions and accidents.",
      "symptoms": [
        "Automatic braking system activates at random times",
        "even when there is no obstacle or hazard present; near-miss rear-end collisions."
      ],
      "odiNumbers": [
        "11454059"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Random Traction Control Light and Feature Disablement",
      "impact": "The random activation of the traction control light can cause a loss of vehicle control, leading to accidents or near-misses. The disablement of features like economy and cruise control can also affect vehicle performance and safety.",
      "symptoms": [
        "The traction control light turns on randomly",
        "accompanied by multiple indicator lights; the vehicle makes an electrical sound; and features like economy and cruise control are disabled."
      ],
      "odiNumbers": [
        "11571320"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Sudden Loss of Acceleration and Limp Mode",
      "impact": "The sudden loss of acceleration can cause a loss of vehicle control, leading to accidents or near-misses. The activation of limp mode can also leave the driver stranded.",
      "symptoms": [
        "The check engine light begins blinking",
        "the vehicle loses acceleration",
        "and the vehicle drops to a low speed."
      ],
      "odiNumbers": [
        "11550704"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Unintended Acceleration",
      "impact": "Unintended acceleration can cause a loss of vehicle control, leading to accidents or near-misses.",
      "symptoms": [
        "The vehicle accelerates on its own",
        "even when the cruise control is turned off; the vehicle fails to respond to shifting into neutral; and the brakes may not respond as expected."
      ],
      "odiNumbers": [
        "11521204",
        "11517902"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Overly Sensitive and Erratic Collision Mitigation Braking System",
      "impact": "The overly sensitive and erratic collision mitigation braking system can cause sudden and unexpected braking, leading to accidents or near-misses.",
      "symptoms": [
        "The system applies heavy stopping power in unexpected situations",
        "including on the freeway at high speeds; and the system can cause unexpected and abrupt loss of speed."
      ],
      "odiNumbers": [
        "11520299"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Unpredictable Cruise Control and Acceleration Issues",
      "impact": "Unpredictable cruise control and acceleration issues can cause a loss of vehicle control, leading to accidents or near-misses.",
      "symptoms": [
        "The vehicle accelerates or decelerates unexpectedly while using cruise control; and the vehicle may fail to respond to braking or shifting."
      ],
      "odiNumbers": [
        "11516373"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}