{
  "totalComplaints": 27,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "AIR BAGS",
    "UNKNOWN OR OTHER",
    "ELECTRICAL SYSTEM"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Delayed Recall Repair for Driver's Airbag",
      "impact": "The delayed repair of the recalled driver's airbag can lead to a significant safety risk, as the airbag may not deploy in the event of a crash, potentially causing serious injury or death.",
      "symptoms": [
        "None reported",
        "as the issue is related to the unavailability of parts for the recall repair."
      ],
      "odiNumbers": [
        "11531756",
        "11522576",
        "11521734",
        "11521595",
        "11521340",
        "11520403",
        "11520115",
        "11520121",
        "11519781",
        "11517903"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Automatic Mirror Malfunction",
      "impact": "The malfunction of the automatic side view mirrors can create a safety hazard when switching lanes, as the driver may not be aware of the mirror's failure to fold out.",
      "symptoms": [
        "The driver-side mirror fails to fold out when unlocking and starting the car",
        "and cannot be manually overridden."
      ],
      "odiNumbers": [
        "11576407"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Drivetrain Failure",
      "impact": "The failure of the drivetrain can cause the vehicle to stall, leading to accidents or leaving the driver stranded, and can also cause safety hazards when the vehicle is unable to change gears.",
      "symptoms": [
        "The vehicle's engine remains on",
        "but the drivetrain fails to allow gear changes",
        "displaying a warning message on the dashboard. The vehicle may stall in the middle of the street."
      ],
      "odiNumbers": [
        "11568082"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Unintended Acceleration",
      "impact": "Unintended acceleration can lead to accidents, injuries, and fatalities, as the vehicle may accelerate rapidly without warning.",
      "symptoms": [
        "The vehicle accelerates on its own without the driver pressing the accelerator pedal",
        "sometimes when taking off from a traffic light or stop sign. The acceleration continues even when the driver takes their foot off the accelerator",
        "and can only be stopped by braking."
      ],
      "odiNumbers": [
        "11512273"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Automatic Locking System Malfunction",
      "impact": "The malfunction of the automatic locking system can create a safety hazard, particularly when children or pets are left inside the vehicle, as the doors may lock without warning, trapping them inside.",
      "symptoms": [
        "The doors lock automatically when the driver shuts the door",
        "even when the key is still inside the vehicle",
        "and the driver has no way to unlock the car or call for help."
      ],
      "odiNumbers": [
        "11525285"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Autonomous Driving System Failure",
      "impact": "The failure of the autonomous driving system can cause accidents, injuries, and fatalities, as the vehicle may not respond to obstacles or follow the intended path.",
      "symptoms": [
        "The vehicle fails to stop or respond to obstacles",
        "even when using features like Recorded Path",
        "and may cause damage to the vehicle or surrounding structures."
      ],
      "odiNumbers": [
        "11503442"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Unintended Movement",
      "impact": "Unintended movement can lead to accidents, injuries, and fatalities, as the vehicle may move unexpectedly, even when the driver is not in control.",
      "symptoms": [
        "The vehicle moves unexpectedly",
        "such as lurching forward when stopped",
        "and can cause accidents or injuries."
      ],
      "odiNumbers": [
        "11538226"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Control Module Overheating",
      "impact": "The overheating of the control module can cause the emergency call system to malfunction, which can lead to a delay or failure in emergency situations, potentially putting occupants at risk.",
      "symptoms": [
        "The \"Emergency Call System Malfunction\" warning light is displayed",
        "a chemical burn smell is present in the vehicle",
        "the control module may be overheating."
      ],
      "odiNumbers": [
        "11547159"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "High Voltage Battery Malfunction",
      "impact": "The malfunction of the high voltage battery can cause the vehicle to lose motive power, increasing the risk of accidents or leaving the driver stranded.",
      "symptoms": [
        "The vehicle suddenly loses motive power",
        "the message \"Malfunction",
        "Pull Over\" is displayed",
        "the vehicle may not restart or may restart only to fail again."
      ],
      "odiNumbers": [
        "11526767"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Lack of Recall Notification",
      "impact": "The failure to notify owners of a recommended recall can lead to continued use of a potentially defective vehicle, increasing the risk of accidents or injuries.",
      "symptoms": [
        "Owners are not notified of a recommended recall",
        "despite the manufacturer being aware of the issue."
      ],
      "odiNumbers": [
        "11529456"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}