{
  "totalComplaints": 10,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "FORWARD COLLISION AVOIDANCE",
    "ELECTRICAL SYSTEM",
    "ENGINE",
    "STRUCTURE",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 10,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Unwanted Activation of Forward Collision Avoidance System",
      "impact": "The unwanted activation of the Forward Collision Avoidance system can cause the vehicle to suddenly stop or brake, increasing the risk of accidents or rear-end collisions.",
      "symptoms": [
        "The vehicle suddenly stops or brakes without warning",
        "the Forward Collision Avoidance system engages abruptly",
        "the vehicle beeps or alerts the driver",
        "the brake is applied independently without warning."
      ],
      "odiNumbers": [
        "11592399",
        "11520552"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Infotainment System Failure",
      "impact": "The failure of the infotainment system can cause navigation and communication disruptions, leading to safety risks, especially in heavy traffic or inclement weather conditions.",
      "symptoms": [
        "The infotainment screen goes blank or freezes",
        "the system resets itself",
        "the system fails to provide navigation directions",
        "the system fails to connect with Android Auto",
        "the system requires frequent restarts",
        "which can only be done when the vehicle is stopped and the driver's door is opened."
      ],
      "odiNumbers": [
        "11592140",
        "11557922"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Infotainment System Battery Drain",
      "impact": "The infotainment system can cause battery drain, leading to the vehicle not starting, which can leave the driver stranded.",
      "symptoms": [
        "The vehicle's battery is drained",
        "the vehicle fails to start",
        "the infotainment system is suspected to be the cause of the battery drain."
      ],
      "odiNumbers": [
        "11592140"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Infotainment System Software Issues",
      "impact": "The infotainment system's software issues can cause connectivity problems, leading to safety risks and inconvenience to the driver.",
      "symptoms": [
        "The infotainment system fails to connect with Android Auto",
        "the system fails to provide navigation directions",
        "the system requires frequent restarts",
        "the system's software issues are suspected to be the cause of the problem."
      ],
      "odiNumbers": [
        "11557922"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Engine Power Loss and Limp Mode",
      "impact": "The sudden loss of engine power and entry into limp mode can cause a significant reduction in vehicle speed, leading to a hazardous situation, especially when merging onto a highway or navigating heavy traffic.",
      "symptoms": [
        "Engine loses power",
        "vehicle enters limp mode",
        "speed limited to 60 MPH or less",
        "check engine light flashes or remains illuminated."
      ],
      "odiNumbers": [
        "11576358",
        "11543022"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Faulty Engine Misfire Detection",
      "impact": "The faulty engine misfire detection system can cause the engine to misfire, leading to a loss of power and potentially causing a stall or accident.",
      "symptoms": [
        "Fast-blinking engine light",
        "engine misfire codes (P0300",
        "P0301",
        "P0304)",
        "vehicle unable to accelerate past a certain speed (e.g.",
        "40 MPH)."
      ],
      "odiNumbers": [
        "11543022"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Intermittent Brake Failure Warning",
      "impact": "The intermittent brake failure warning message can cause driver distraction and anxiety, potentially leading to an accident if the brakes fail while driving.",
      "symptoms": [
        "Intermittent \"Brake Failure. See Dealership\" message on the dashboard",
        "no permanent code present",
        "dealership unable to repair or identify the issue."
      ],
      "odiNumbers": [
        "11543022"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Liftgate Sensor Malfunction",
      "impact": "The malfunction of the liftgate sensor can cause the liftgate to close without detecting obstacles or resistance, potentially leading to injury or entrapment.",
      "symptoms": [
        "The liftgate closes without stopping or reversing when encountering resistance",
        "requires excessive pressure to stop and reverse",
        "fails to detect obstacles or people in its path."
      ],
      "odiNumbers": [
        "11528693"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Spontaneous Rear Hatch Window Shattering",
      "impact": "The sudden shattering of the rear hatch window can cause injury from flying glass, and potentially lead to accidents or distractions while driving.",
      "symptoms": [
        "The rear hatch window or sunroof glass shatters spontaneously without any apparent cause",
        "often with no warning signs or signals."
      ],
      "odiNumbers": [
        "11502240"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Spontaneous Rear Glass Shattering",
      "impact": "The sudden and unexpected shattering of the rear glass can cause a loud noise, distraction, and potential injury from flying glass, which can lead to accidents or loss of control while driving.",
      "symptoms": [
        "The rear glass shatters suddenly and without warning",
        "often accompanied by a loud noise",
        "while driving or parking."
      ],
      "odiNumbers": [
        "11532827"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}