{
  "totalComplaints": 9,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "STEERING",
    "VISIBILITY/WIPER",
    "SERVICE BRAKES",
    "SEATS"
  ],
  "parsedComplaintsResultLength": 11,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Parking Sensor Module Connection Failure",
      "impact": "The failure to connect the parking sensor module during manufacturing can lead to the unavailability of parking assist, rear braking, and auto park assist features, which can increase the risk of accidents and compromise vehicle safety.",
      "symptoms": [
        "Parking sensors do not work",
        "dashboard message indicating parking assist",
        "rear braking",
        "and auto park assist are unavailable."
      ],
      "odiNumbers": [
        "11518181"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Unintended Airbag Deployment",
      "impact": "Unintended airbag deployment can cause injuries to occupants, including children, and may lead to accidents or loss of vehicle control.",
      "symptoms": [
        "Airbags deploy without a collision",
        "airbags deploy suddenly and without warning",
        "airbags deploy when driving on a gravel driveway or during normal vehicle operation."
      ],
      "odiNumbers": [
        "11508711"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Faulty Running Board and Automatic Brake System",
      "impact": "The malfunctioning running board and automatic brake system can cause sudden and abrupt stops, which can lead to accidents, injuries, or loss of vehicle control.",
      "symptoms": [
        "Running boards extend and retract randomly",
        "automatic brakes engage suddenly and without warning",
        "seatbelt locks up and thrusts occupant forward and backward."
      ],
      "odiNumbers": [
        "11508711"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Rear Entertainment System Malfunction",
      "impact": "The malfunctioning rear entertainment system can cause distractions while driving and compromise vehicle safety.",
      "symptoms": [
        "Rear entertainment system screen remains black",
        "screen requires repeated turning on and off to function."
      ],
      "odiNumbers": [
        "11508711"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Electrical Failure Causing Vehicle Shutdown and Loss of Brake Function",
      "impact": "The sudden shutdown of the vehicle while in motion can increase the risk of accidents, injuries, or fatalities. The loss of brake function can further exacerbate the situation, making it difficult for the driver to control the vehicle.",
      "symptoms": [
        "The vehicle shuts off while in motion",
        "the steering column locks",
        "the brake pedal is depressed but fails to respond",
        "the rear axle disengages",
        "and the suspension leveling system fails."
      ],
      "odiNumbers": [
        "11586741"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Rear Axle Disengagement",
      "impact": "The disengagement of the rear axle can cause loss of traction, stability, and control, increasing the risk of accidents, injuries, or fatalities.",
      "symptoms": [
        "The rear axle disengages",
        "causing loss of traction",
        "stability",
        "and control."
      ],
      "odiNumbers": [
        "11586741"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Suspension Leveling System Failure",
      "impact": "The failure of the suspension leveling system can cause uneven ride height, reduced stability, and increased risk of accidents, injuries, or fatalities.",
      "symptoms": [
        "The suspension leveling system fails",
        "causing uneven ride height and reduced stability."
      ],
      "odiNumbers": [
        "11586741"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Intermittent Windshield Wiper Failure",
      "impact": "The periodic failure of the windshield wipers can cause reduced visibility during rain or snow, increasing the risk of accidents, especially at high speeds.",
      "symptoms": [
        "Windshield wipers stop working when turned on",
        "wipers fail to operate despite adjusting speed settings",
        "wipers stop working and then resume operation after a few minutes",
        "wipers cut out during heavy rain or snow."
      ],
      "odiNumbers": [
        "11582539"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Inadequate Dealer Diagnostic and Repair",
      "impact": "The failure of dealerships to diagnose and repair the intermittent windshield wiper failure can lead to continued safety risks for the driver and other road users.",
      "symptoms": [
        "Dealerships unable to diagnose the problem due to intermittent nature",
        "refusal to replace parts to fix the issue",
        "lack of concern from dealerships despite evidence of the problem",
        "inadequate response from manufacturer's customer care."
      ],
      "odiNumbers": [
        "11582539"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Inadequate Braking Capacity in Diesel Vehicles",
      "impact": "The inadequate braking capacity of diesel vehicles can lead to increased stopping distances, accidents, and potentially serious injuries or fatalities.",
      "symptoms": [
        "Longer stopping distances",
        "reduced braking effectiveness",
        "inconsistent braking performance",
        "and a noticeable difference in braking capacity compared to similar gas-fueled vehicles."
      ],
      "odiNumbers": [
        "11581369"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Discrepancy in Braking Performance between Diesel and Gas-Fueled Vehicles",
      "impact": "The disparity in braking performance between diesel and gas-fueled vehicles can lead to confusion and uncertainty among drivers, potentially resulting in accidents or near-misses.",
      "symptoms": [
        "Notably superior braking performance in gas-fueled vehicles compared to diesel vehicles",
        "despite similar brake systems and higher weight of diesel vehicles."
      ],
      "odiNumbers": [
        "11581369"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}