{
  "totalComplaints": 18,
  "numberOfFilteredComplaintMapKeys": 4,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "EXTERIOR LIGHTING",
    "UNKNOWN OR OTHER",
    "SERVICE BRAKES"
  ],
  "parsedComplaintsResultLength": 11,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Sudden Unintended Acceleration",
      "impact": "Sudden unintended acceleration can cause loss of vehicle control, accidents, and potential injuries or fatalities.",
      "symptoms": [
        "The vehicle accelerates rapidly without warning",
        "often when parking or slowing down",
        "and may cause the vehicle to jump curbs or hit objects."
      ],
      "odiNumbers": [
        "11562910"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Airbag Failure to Deploy",
      "impact": "Failure of airbags to deploy in the event of a collision can increase the risk of injury or fatality.",
      "symptoms": [
        "Airbags do not deploy during a collision",
        "despite the vehicle being equipped with an airbag system."
      ],
      "odiNumbers": [
        "11558150"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Recall Repair Delays",
      "impact": "Delays in recall repairs can leave vehicles on the road with known safety defects, increasing the risk of accidents or injuries.",
      "symptoms": [
        "Vehicle owners receive notification of a recall",
        "but the necessary parts are unavailable",
        "leaving the vehicle unrepaired."
      ],
      "odiNumbers": [
        "11555423"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Electric Drive Unit Failure",
      "impact": "Failure of the electric drive unit can cause the vehicle to become disabled, potentially stranding the driver in a hazardous location.",
      "symptoms": [
        "The vehicle experiences a sudden loss of power",
        "accompanied by warning lights and messages",
        "and may become unable to move or turn off."
      ],
      "odiNumbers": [
        "11549415"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Electrical Shock",
      "impact": "Electrical shock can cause injury or electrocution, particularly when the vehicle is plugged into a charging station.",
      "symptoms": [
        "Vehicle owners experience electrical shock when interacting with the vehicle",
        "such as when opening the rear hatch or plugging in the charger."
      ],
      "odiNumbers": [
        "11530025"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Malfunctioning Electric Vehicle Charging Station",
      "impact": "Malfunctioning electric vehicle charging stations can cause electrical shocks, fires, or other safety hazards.",
      "symptoms": [
        "The charging station malfunctions",
        "requiring frequent restarts",
        "and may pose a fire risk due to improper installation or design."
      ],
      "odiNumbers": [
        "11494961"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Insufficient Rear Brake Light Visibility",
      "impact": "The low placement of the rear brake lights on the Chevy Bolt EV can lead to reduced visibility, increasing the risk of rear-end collisions, which can result in accidents, injuries, and fatalities.",
      "symptoms": [
        "Rear brake lights are difficult to see",
        "especially for taller vehicles or from a close distance",
        "increasing the risk of being rear-ended; drivers may not be aware of the vehicle braking",
        "leading to potential accidents."
      ],
      "odiNumbers": [
        "11558243",
        "11551855",
        "11526242",
        "11494365"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Software Download Incompatibility",
      "impact": "The incompatibility of the software download can cause safety risks, as the vehicle may not function properly, and the driver may be left stranded. In this case, the vehicle could not be released for safety reasons, and the issue was not resolved for three weeks.",
      "symptoms": [
        "The vehicle cannot accept the software download",
        "and the service center cannot release the vehicle due to safety concerns."
      ],
      "odiNumbers": [
        "11583735"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "\"Conditions not correct for shift\" Error",
      "impact": "This error can cause the vehicle to not start, leaving the driver and passengers stranded, which can be a safety risk, especially in extreme weather conditions or for passengers with special needs.",
      "symptoms": [
        "The vehicle does not start",
        "and an error message \"Conditions not correct for shift\" appears on the dashboard. The vehicle may not turn off",
        "even when the ignition is switched off."
      ],
      "odiNumbers": [
        "11541055"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Regenerative Brake System Failure",
      "impact": "The failure of the regenerative brake system can cause a delay in response to the foot brake, leading to accidents or near-miss situations, especially when switching from the hand brake to the foot brake.",
      "symptoms": [
        "Soft brake pedal",
        "delayed response to foot brake",
        "inconsistent brake performance when switching between hand brake and foot brake."
      ],
      "odiNumbers": [
        "11574601"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Inadequate Brake Lighting",
      "impact": "The inadequate brake lighting design can cause confusion for following drivers, leading to accidents or near-miss situations, as the brake lights are not clearly visible.",
      "symptoms": [
        "Brake lights are not visible to following drivers",
        "tail lights do not illuminate when braking",
        "only collision lights and turn signal lights illuminate."
      ],
      "odiNumbers": [
        "11526465"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}