{
  "totalComplaints": 8,
  "numberOfFilteredComplaintMapKeys": 5,
  "filteredComplaintMapKeys": [
    "ELECTRICAL SYSTEM",
    "POWER TRAIN",
    "UNKNOWN OR OTHER",
    "SEAT BELTS",
    "STEERING"
  ],
  "parsedComplaintsResultLength": 8,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 4,
      "issueCategory": "Rodent-Related Wiring Damage",
      "impact": "Rodent-related wiring damage can cause various electrical system failures, including slow or difficult starting, which can lead to safety risks, inconvenience, and costly repairs.",
      "symptoms": [
        "The vehicle is slow to start",
        "or has difficulty starting",
        "with no warning lights illuminated."
      ],
      "odiNumbers": [
        "11571712"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Horn Failure",
      "impact": "A failed horn can increase the risk of accidents, as it is an essential safety feature for alerting other drivers or pedestrians of the vehicle's presence.",
      "symptoms": [
        "The horn does not produce any sound when activated",
        "with no warning lights or messages displayed on the vehicle's dashboard."
      ],
      "odiNumbers": [
        "11544840"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Transmission Electrical Harness Failure due to Rodent Damage",
      "impact": "The failure of the transmission electrical harness due to rodent damage can cause the vehicle to suddenly lose power, leading to accidents or leaving the driver stranded. This can also lead to overheating, which can cause further damage to the transmission and other components.",
      "symptoms": [
        "Sudden loss of power",
        "engine light comes on",
        "transmission light comes on",
        "overheating light comes on",
        "vehicle shuts down."
      ],
      "odiNumbers": [
        "11541449"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Automatic Door Locking Mechanism Failure",
      "impact": "The unexpected activation of the automatic door locking mechanism can trap occupants, including children, inside the vehicle, potentially leading to heatstroke, dehydration, or other life-threatening situations.",
      "symptoms": [
        "The doors lock unexpectedly",
        "the doors lock with occupants inside",
        "the doors lock with children or pets inside",
        "the vehicle's sensors fail to detect occupants",
        "the automatic door locking mechanism overrides manual door control."
      ],
      "odiNumbers": [
        "11529967"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Intermittent Failure of Advanced Safety Features",
      "impact": "The intermittent failure of advanced safety features such as Blind-Spot Collision Warning, Rear Cross-Traffic Collision Warning, Rear Occupant Alert, and Driver Attention Warning can increase the risk of accidents and compromise vehicle safety.",
      "symptoms": [
        "The safety features work randomly",
        "sometimes functioning properly and sometimes not functioning at all",
        "without any warning or indication."
      ],
      "odiNumbers": [
        "11527653"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Infotainment System Malfunction",
      "impact": "The malfunction of the infotainment system can cause distractions while driving, potentially leading to accidents.",
      "symptoms": [
        "The 8-inch color touchscreen with navigation goes into night mode during the day",
        "and starts to run a setup by itself while driving",
        "without any user input."
      ],
      "odiNumbers": [
        "11527653"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Inconsistent Blue Link Notifications",
      "impact": "The inconsistent notifications from Blue Link can lead to confusion and uncertainty about the vehicle's status, potentially causing inconvenience and anxiety for the driver.",
      "symptoms": [
        "Blue Link only sent an email notification about the automatic setup once",
        "without providing any further information or updates."
      ],
      "odiNumbers": [
        "11527653"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Lane Assistance System Malfunction",
      "impact": "The malfunctioning lane assistance system can cause the vehicle to pull the wheel, making it difficult for the driver to control the vehicle, which can lead to accidents or near-miss situations.",
      "symptoms": [
        "The lane assistance system repeatedly sounds an alert",
        "the system yanks the wheel",
        "the vehicle is difficult to control",
        "especially in crosswinds",
        "the driver must make constant corrections to stay within the lane",
        "the vehicle pulls inches out of the lane."
      ],
      "odiNumbers": [
        "11525607"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}