{
  "totalComplaints": 14,
  "numberOfFilteredComplaintMapKeys": 1,
  "filteredComplaintMapKeys": [
    "STEERING"
  ],
  "parsedComplaintsResultLength": 3,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Steering Head Bearing Failure/Overtorquing",
      "impact": "The failure of the steering head bearings can cause the steering to become restricted, leading to loss of control, accidents, and potentially lethal consequences.",
      "symptoms": [
        "The steering feels stiff",
        "sticky",
        "or catches",
        "especially at low speeds; the handlebars may wobble or feel unstable; the motorcycle may pull to one side or make sudden turns; the steering may become heavy or difficult to turn."
      ],
      "odiNumbers": [
        "11583209",
        "11560601",
        "11556049",
        "11547527",
        "11546458",
        "11542036",
        "11542079",
        "11541677",
        "11541445",
        "11541534",
        "11537226",
        "11536799",
        "11535256"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Clutch Hydraulic System Failure",
      "impact": "The failure of the clutch hydraulic system can cause the clutch pedal to stick to the floor, making it difficult or impossible to shift gears, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The clutch pedal feels soft or spongy",
        "the clutch pedal sticks to the floor",
        "the clutch pedal does not return to its normal position",
        "the clutch pedal has a delayed return to its normal position",
        "the clutch pedal has a sudden loss of pressure",
        "the vehicle is unable to shift into gear."
      ],
      "odiNumbers": [
        "11582029"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "False Neutral Issue",
      "impact": "The false neutral issue can cause the motorcycle to lunge forward unexpectedly, leading to accidents or loss of control.",
      "symptoms": [
        "The motorcycle shifts into neutral unexpectedly",
        "the neutral light illuminates on the dash",
        "the motorcycle lunges forward even when the side stand is down",
        "the rider may experience near-misses or accidents."
      ],
      "odiNumbers": [
        "11582029"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}