{
  "totalComplaints": 32,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "FORWARD COLLISION AVOIDANCE",
    "ELECTRICAL SYSTEM",
    "UNKNOWN OR OTHER"
  ],
  "parsedComplaintsResultLength": 12,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Advanced Driver Assistance Systems (ADAS) Defect - Radar Obstruction",
      "impact": "The defective design of the ADAS system, specifically the placement of the RADAR behind the large HONDA emblem on the front grille, can cause the system to malfunction, leading to false warnings and disabling of safety features such as Automatic Emergency Braking, Adaptive Cruise Control, and Forward Collision Warning, which can increase the risk of accidents.",
      "symptoms": [
        "\"RADAR OBSTRUCTED\" warning",
        "disabling of Advanced Driver Assistance Systems",
        "inability to reset the warning by restarting the vehicle or disconnecting the battery",
        "requiring recalibration of the RADAR at a significant cost."
      ],
      "odiNumbers": [
        "11590581",
        "11549343",
        "11537514",
        "11529657",
        "11527579",
        "11507803",
        "11503148"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Unintended Automatic Emergency Braking",
      "impact": "The unintended activation of the Automatic Emergency Braking system can cause sudden and unexpected braking, which can lead to accidents, especially if the vehicle is being followed by another vehicle.",
      "symptoms": [
        "Sudden and unexpected braking",
        "even when there are no obstacles in the vehicle's path",
        "inability to override the system",
        "and potential for accidents."
      ],
      "odiNumbers": [
        "11549343",
        "11537514",
        "11529657",
        "11527579",
        "11503148"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Adaptive Cruise Control Malfunction",
      "impact": "The malfunction of the Adaptive Cruise Control system can cause the vehicle to accelerate or decelerate unexpectedly, which can lead to accidents, especially when driving downhill.",
      "symptoms": [
        "Unintended acceleration or deceleration",
        "inability to maintain a set speed",
        "and potential for accidents."
      ],
      "odiNumbers": [
        "11507803"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Unintended Vehicle Startup",
      "impact": "The vehicle may start unexpectedly, even when turned off, which can cause unexpected movements, accidents, or injuries.",
      "symptoms": [
        "The vehicle starts on its own",
        "even after being turned off; the speakers or other systems may activate unexpectedly; the vehicle may display a low battery warning even when not in use."
      ],
      "odiNumbers": [
        "11582069"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Unintended Braking and Acceleration",
      "impact": "The vehicle may brake or accelerate unexpectedly, which can cause loss of control, accidents, or injuries.",
      "symptoms": [
        "The vehicle slows down or brakes suddenly",
        "even when there are no obstacles or hazards; the vehicle may accelerate unexpectedly",
        "even when the driver is not pressing the accelerator."
      ],
      "odiNumbers": [
        "11581411",
        "11541512"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Auto Idle Stop System Failure",
      "impact": "The Auto Idle Stop system may shut down the vehicle unexpectedly, which can cause inconvenience, delay, or even accidents.",
      "symptoms": [
        "The vehicle shuts down suddenly",
        "even when the Auto Idle Stop system is engaged; the vehicle may not restart immediately; the dashboard may go dark",
        "and hazard lights may not be accessible."
      ],
      "odiNumbers": [
        "11556827"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 4,
      "issueCategory": "Defective Blind Spot Sensors",
      "impact": "The blind spot sensors may malfunction, causing the vehicle to brake unexpectedly, which can lead to accidents or injuries.",
      "symptoms": [
        "The vehicle may brake suddenly when merging onto a highway or changing lanes",
        "even when there are no obstacles or hazards; the blind spot sensors may not detect vehicles in the blind spot."
      ],
      "odiNumbers": [
        "11545388"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 5,
      "issueCategory": "Inaccurate Speed Limit Display",
      "impact": "The vehicle's speed limit display may show incorrect information, which can lead to speeding, accidents, or injuries.",
      "symptoms": [
        "The vehicle's speed limit display shows incorrect or inconsistent information; the display may show a higher speed limit than the actual speed limit."
      ],
      "odiNumbers": [
        "11535432"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 6,
      "issueCategory": "Power Sliding Door Safety Issue",
      "impact": "The power sliding door may close unexpectedly, causing injuries or trapping occupants or objects.",
      "symptoms": [
        "The power sliding door closes suddenly",
        "even when there are obstacles or objects in the way; the door may not reverse or stop when it encounters resistance."
      ],
      "odiNumbers": [
        "11486694"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Unintended Acceleration",
      "impact": "The unintended acceleration of the vehicle can cause accidents, injuries, and fatalities, as well as damage to property.",
      "symptoms": [
        "The vehicle accelerates suddenly and unexpectedly",
        "even when the brake pedal is applied",
        "and fails to engage automatic emergency braking features."
      ],
      "odiNumbers": [
        "11583862"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Sunroof Glass Implosion",
      "impact": "The sudden implosion of the sunroof glass can cause physical harm to occupants, including lacerations and injuries from flying glass shards, and can also lead to emotional distress and trauma.",
      "symptoms": [
        "The sunroof glass shatters suddenly",
        "producing a loud noise and releasing micro crystals that can cause injuries and discomfort."
      ],
      "odiNumbers": [
        "11566166"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Low-Hanging Muffler and Lack of Vented Shield",
      "impact": "The low-hanging muffler without a vented shield can cause burns, cuts, and other injuries to individuals, particularly children, who may come into contact with the hot muffler while accessing the underside of the vehicle.",
      "symptoms": [
        "The muffler is positioned too close to the ground",
        "making it a hazard for people",
        "especially children",
        "who may reach under the vehicle to retrieve items."
      ],
      "odiNumbers": [
        "11505109"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}