{
  "totalComplaints": 20,
  "numberOfFilteredComplaintMapKeys": 3,
  "filteredComplaintMapKeys": [
    "EXTERIOR LIGHTING",
    "ELECTRICAL SYSTEM",
    "POWER TRAIN"
  ],
  "parsedComplaintsResultLength": 6,
  "parsedComplaintsResult": [
    {
      "complaintNumber": 1,
      "issueCategory": "Failure of Auto High Beam Function",
      "impact": "The failure of the auto high beam function can lead to reduced visibility and increased risk of accidents, especially at night or in low-light conditions.",
      "symptoms": [
        "The high beams do not activate when the headlights are in the \"Auto\" position",
        "the high beams only work when the lights are in the \"ON\" position",
        "the high beams can only be activated by switching to manual mode",
        "the paddle or switch does not activate the high beams in auto mode."
      ],
      "odiNumbers": [
        "11591192",
        "11579649",
        "11578917",
        "11578175",
        "11571984",
        "11569778",
        "11568579",
        "11568319",
        "11566189"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Hybrid System Malfunction",
      "impact": "The hybrid system malfunction can cause the engine to shut off while driving, leading to a loss of power and control, which can increase the risk of accidents, especially on highways or city streets.",
      "symptoms": [
        "The engine shuts off automatically while driving",
        "the vehicle hesitates when the gas engine is communicating with the electric battery",
        "the vehicle acts like it is in neutral for about 5 seconds",
        "the vehicle will not accelerate past a certain speed (e.g.",
        "29 mph)",
        "the \"D\" indicator on the shifter knob and driver info panel screen blinks",
        "numerous error messages and icons are displayed",
        "including the check engine light",
        "battery warning light",
        "check hybrid electrical system light and warning",
        "and service electronic stability control warning."
      ],
      "odiNumbers": [
        "11586971",
        "11574874",
        "11573849"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Electrical System Failure",
      "impact": "The electrical system failure can cause various malfunctions, including the loss of power, brake pedal kicking back, and gear shifter moving when the vehicle is dead, which can lead to accidents or leave the driver stranded.",
      "symptoms": [
        "The vehicle loses power",
        "the odometer blinks",
        "blind spot indicators stay illuminated",
        "the rear back-up camera displays a \"system unavailable\" fault",
        "the brake pedal kicks back when trying to start the vehicle",
        "the gear shifter moves when the vehicle is dead."
      ],
      "odiNumbers": [
        "11573849"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 1,
      "issueCategory": "Hybrid/Electric Powertrain Failure",
      "impact": "The sudden shutdown of the engine while driving can cause loss of control, increasing the risk of accidents, and potentially leaving the driver stranded. The inability to shift gears or restart the engine can further exacerbate the situation.",
      "symptoms": [
        "The engine shuts off while driving",
        "the vehicle shifts into park or neutral unexpectedly",
        "the vehicle is unable to accelerate past a certain speed",
        "the \"D\" indicator on the shifter and driver information panel blinks",
        "error codes are displayed on the diagnostic system."
      ],
      "odiNumbers": [
        "11574396",
        "11574483"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 2,
      "issueCategory": "Infotainment System Malfunction",
      "impact": "The malfunctioning infotainment system can distract the driver, leading to accidents, and may also prevent the vehicle from shutting off properly, causing safety concerns.",
      "symptoms": [
        "The infotainment system remains on despite the engine shutting off",
        "the system displays incorrect or misleading information",
        "the system fails to respond to user input."
      ],
      "odiNumbers": [
        "11574396",
        "11574483"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    },
    {
      "complaintNumber": 3,
      "issueCategory": "Transmission Control System Failure",
      "impact": "The failure of the transmission control system can cause the vehicle to become stuck in a particular gear, leading to loss of control and increasing the risk of accidents.",
      "symptoms": [
        "The vehicle is unable to shift gears",
        "the \"D\" indicator on the shifter and driver information panel blinks",
        "the vehicle is unable to accelerate past a certain speed."
      ],
      "odiNumbers": [
        "11574483"
      ],
      "relatedIssues": [],
      "relatedMaintenance": []
    }
  ]
}